[
    {
        "title": "Pick mes stfu",
        "author": "Swimming_Weight_7723",
        "created_utc": 1761685212.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oilblb/pick_mes_stfu/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Trying to study for midterms in a study room in 8th and ya'll are ANNOYING!\n\nI've been trying to figure out some stuff since 12 and pulled up into a quiet room... and like 20 minutes later a group of two came in. I muted my mfing YouTube video and put on NOISE CANCELING headphones to be polite and quiet in a common study area.\n\nThey were studying fine until about 40 minutes later when she starts with that drawl voice and he's like loud whispering???\n\n\"Omg am I fattttt I feel like my face is rounderrrr\"\n\n\"Omg my ex did blah blah blahhhh\"\n\n\"Stawppp omg nooo do I have a double chin be honestttt\"\n\n\"Nooo don't go yettttt stay a lil longer for me\"\n\nHOLY SHIT MAN, go somewhere else without tweakin students being subjected to hearing 10 minutes of you needing to lose weight and getting back in the gym when you're as thin as a twig and learn to control your volume, there's no reason why it should penetrate through my headphones. \n\nI get there's no clear rules about remaining low in these common areas, but have some common decency when you see other looking crazy and hunched over!! I came here for quiet cause my suite is too loud!\n\nI ended up switching floors cuz I couldn't deal with it b4 yall start ✌️"
    },
    {
        "title": "Overnight Parking",
        "author": "Brilliant_Telephone8",
        "created_utc": 1761684511.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oil0k7/overnight_parking/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I have a friend staying over tomorrow and I was wondering which parking lot allowed for overnight parking for guests and how much it would cost."
    },
    {
        "title": "Freddie Gibbs and the alchemist",
        "author": "Altruistic_Ad7398",
        "created_utc": 1761683928.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oikr9y/freddie_gibbs_and_the_alchemist/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anyone heading to the LA Alfredo show tn? "
    },
    {
        "title": "Horsey News: UCSD Taco Bell Might Open Tomorrow",
        "author": "One_Block_4596",
        "created_utc": 1761683110.0,
        "num_comments": 4,
        "score": 8,
        "permalink": "/r/UCSD/comments/1oikefq/horsey_news_ucsd_taco_bell_might_open_tomorrow/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Welcome to Horsey News! The UCSD Taco Bell is now scheduled to open tomorrow, October 29, 2025. Originally, it was supposed to open on October 10, 2025, but the date was first pushed back to October 27, and now we’ll have to wait just one more day!"
    },
    {
        "title": "Lost Apple Pencil",
        "author": "weetafricks",
        "created_utc": 1761682877.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oikanu/lost_apple_pencil/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey guys! I lost my Apple Pencil (2nd gen) in FAH 1302 after SIO 132 with Dovi Kacev today at 9:30. I was sitting probably 3 rows from the back in the middle. Please dm me if you find anything!!"
    },
    {
        "title": "Sick ppl at library clarifications",
        "author": "Hot_Beautiful_6207",
        "created_utc": 1761682728.0,
        "num_comments": 0,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oik8ad/sick_ppl_at_library_clarifications/",
        "image_url": "https://external-preview.redd.it/ULEp-TRFU4VEygC8PbdzsK4MliQYNbGiUtQN7GN690s.jpeg?auto=webp&s=cf3fffda5f8afdc640ad0d9193465ecfaf0344d9",
        "thumbnail_url": "",
        "body": "\n\nREPOST FOR CLARIFICATION:\n\nJust reposting this bc people thought I took a picture of someone and attached their image to my post. I WOULD NEVEEEEER. That would be extremely rude and disrespectful. But I understand the anger by some, I’d be angry to if I took on the misunderstanding!  Good luck on finals and feel better soon to all those who are sick on midterm week. \n\nHere’s the link, it was a meme reaction: https://i.pinimg.com/736x/5c/43/88/5c438821f5138189e65e7b8fa3f6bd83.jpg"
    },
    {
        "title": "What's the perfect song to play for a suitemate who blasts music all day and night?",
        "author": "UCSDICK",
        "created_utc": 1761682717.0,
        "num_comments": 17,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oik844/whats_the_perfect_song_to_play_for_a_suitemate/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I live in a suite where one of the neighbors  speaker never sleeps. 24/7 concert energy, no intermission, no encore just endless noise. Im looking for the ultimate revenge but make it artistic track. Something that says \"I hear you, and now you hear me\". What the best song to play?"
    },
    {
        "title": "lost owala 😭",
        "author": "junalcyon",
        "created_utc": 1761682166.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oijzes/lost_owala/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i am on a streak of losing stuff this qtr and this is kind of a long shot but i lost my owala in one of the enterprise rental cars on campus in pangea. its an desert sand owala with snoopy, pokemon, and ghibli stickers on it. if anyone who rented the car after me found it/turned it in pls lmk 🥹 "
    },
    {
        "title": "CSE 100r Midterm",
        "author": "HackAnime",
        "created_utc": 1761679146.0,
        "num_comments": 1,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oiinky/cse_100r_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "For those of you who have taken CSE 100r midterm with Niema this quarter, how was the exam?"
    },
    {
        "title": "Yogurt world today?",
        "author": "MasterpieceFun3855",
        "created_utc": 1761670711.0,
        "num_comments": 1,
        "score": 10,
        "permalink": "/r/UCSD/comments/1oiew16/yogurt_world_today/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Title"
    },
    {
        "title": "Glbh 181 with burgos final",
        "author": "Unusual-Payment1675",
        "created_utc": 1761660031.0,
        "num_comments": 2,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oia5rz/glbh_181_with_burgos_final/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I heard both midterm and final was take home but he changed the final to be in person??? I really wish he kept it chill idk what he’s thinking by making the midterm online but the final in person. How tough will the test be?"
    },
    {
        "title": "Gen BBQ UTC: Terrible Management and Disrespect Toward Employees",
        "author": "empty_studio22",
        "created_utc": 1761644693.0,
        "num_comments": 10,
        "score": 47,
        "permalink": "/r/UCSD/comments/1oi508m/gen_bbq_utc_terrible_management_and_disrespect/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "\nI have a roommate who applied at Gen Korean BBQ, and their management practices explain exactly why the place struggles. They hire managers who seem completely untrained in actual management. Employees are told not to clock in even when arriving on time for their scheduled shift, simply because there are no customers yet. Shifts get canceled constantly with no regard for workers’ time or income. It sounds like an awful place to work.\n\nHopefully this reaches their corporate office. Invest in better management and respect your employees. Customers already have plenty of complaints about this location. UTC is not a rundown area, so stop running the restaurant like it is.\n"
    },
    {
        "title": "Please share your best cram success stories",
        "author": "Strange-Lingonberry8",
        "created_utc": 1761641946.0,
        "num_comments": 5,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oi4bt2/please_share_your_best_cram_success_stories/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Midterm is on Thursday for Bipn140 and I've not kept up with the course since we finished our first midterm...  \n\n\nI am not a crammer/procrastinator so I need all the inspo and tips i can get (pls help me)"
    },
    {
        "title": "what are your plans for halloween?",
        "author": "artificalapples",
        "created_utc": 1761640837.0,
        "num_comments": 6,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oi42iv/what_are_your_plans_for_halloween/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "need ideas so pls comment"
    },
    {
        "title": "Halloween parties before 31st?",
        "author": "KnightofContrite",
        "created_utc": 1761635027.0,
        "num_comments": 0,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oi2p5j/halloween_parties_before_31st/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’m going to escape on 31 and Nov 1 but I feel bad that I haven’t gone to a ucsd Halloween party since it’s my first year here (transfer)"
    },
    {
        "title": "Downfall of Surf Club",
        "author": "Low-Conversation-321",
        "created_utc": 1761634809.0,
        "num_comments": 16,
        "score": 104,
        "permalink": "/r/UCSD/comments/1oi2n25/downfall_of_surf_club/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "UCSD Surf Club has fallen off. The new board has too many nepo babies and there’s been no mention of a Halloween party. That was the one event everyone enjoyed last year.\n\nIf you’re gonna run surf club, maybe start by actually planning parties like you’re supposed to be known for.\n\nBring back the old energy, or at least some transparency.\n"
    },
    {
        "title": "i'm a highschool senior and i want to get into UCSD",
        "author": "1vxa",
        "created_utc": 1761634567.0,
        "num_comments": 9,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oi2kx6/im_a_highschool_senior_and_i_want_to_get_into_ucsd/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi everyone, i'm currently applying for colleges and id love to know what the average stats are for ucsd. for context, i'm applying for biotech"
    },
    {
        "title": "So behind on my course content",
        "author": "Fawnsk1n",
        "created_utc": 1761631662.0,
        "num_comments": 0,
        "score": 55,
        "permalink": "/r/UCSD/comments/1oi1v2p/so_behind_on_my_course_content/",
        "image_url": "https://i.redd.it/kjfrjdsdnsxf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/x0aL9UPVAg1ohHiuOlADBWkpeqPjdWvNwHwB5weuEy8.jpg",
        "body": ":("
    },
    {
        "title": "Any yogurt world fundraisers tomorrow??",
        "author": "aloevera2043",
        "created_utc": 1761630580.0,
        "num_comments": 2,
        "score": 8,
        "permalink": "/r/UCSD/comments/1oi1l41/any_yogurt_world_fundraisers_tomorrow/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "title lol i just want some tomorrow but discounted a little 😅"
    },
    {
        "title": "Anyone lose a Visa gift card",
        "author": "Myahcat",
        "created_utc": 1761627823.0,
        "num_comments": 0,
        "score": 5,
        "permalink": "/r/UCSD/comments/1oi0uuc/anyone_lose_a_visa_gift_card/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Found a 50 dollar visa gift card the other night by a vending machine. DM me with something identifying like which vending machine u left ita at or what exactly it looked like"
    },
    {
        "title": "office hours",
        "author": "Different_Manner_591",
        "created_utc": 1761627633.0,
        "num_comments": 4,
        "score": 5,
        "permalink": "/r/UCSD/comments/1oi0svg/office_hours/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "is it normal for a professor to list his office hours and not show up to them and he didn't cancel them today I waited an extra 20 min but no show "
    },
    {
        "title": "phys 12 midterm when",
        "author": "riveyuz",
        "created_utc": 1761626927.0,
        "num_comments": 1,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oi0lyd/phys_12_midterm_when/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "to those also in phys12, when is our midterm (since it's not stated in the syllabus)? Thanks"
    },
    {
        "title": "math 10a",
        "author": "tpwk2040",
        "created_utc": 1761625123.0,
        "num_comments": 10,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oi03mm/math_10a/",
        "image_url": "https://i.redd.it/q976k2qx3sxf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/8Vn4UXQqiGzRPs00od37zcWSIEa0fz8P8HV-A0NdOtE.jpg",
        "body": "having a hard time with this problem for some reason. can someone please help me? \n"
    },
    {
        "title": "This generation is cooked",
        "author": "dieg215",
        "created_utc": 1761623829.0,
        "num_comments": 56,
        "score": 607,
        "permalink": "/r/UCSD/comments/1ohzpnd/this_generation_is_cooked/",
        "image_url": "https://external-preview.redd.it/OGhlcWRteTIwc3hmMUge0QxaAlu2T0HZf_rvN2zAnyoNfnvRTtdrTuYugXVy.png?format=pjpg&auto=webp&s=3d8a9c3f92923cd6e58314714964ff73c9730b6b",
        "thumbnail_url": "https://external-preview.redd.it/OGhlcWRteTIwc3hmMUge0QxaAlu2T0HZf_rvN2zAnyoNfnvRTtdrTuYugXVy.png?width=140&height=140&format=jpg&auto=webp&s=8cfda02640d04edb429e6ff3628bf7e806164972",
        "body": ""
    },
    {
        "title": "What is the diversity for each of the separate colleges in UCSD?",
        "author": "Over_Lab_5636",
        "created_utc": 1761623054.0,
        "num_comments": 7,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ohzh10/what_is_the_diversity_for_each_of_the_separate/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Specifically, which has the highest Hispanic population? I have to rank colleges when applying."
    },
    {
        "title": "Burger king cini minis",
        "author": "avacadotoasttoe",
        "created_utc": 1761622871.0,
        "num_comments": 4,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohzezd/burger_king_cini_minis/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I kinda wanna get them but i dont wanna spend $4 on them does anyone wanna let me have one just one to see if theyre worth it. I been craving it for weeks"
    },
    {
        "title": "Does it get better here?",
        "author": "ElderberryStrong647",
        "created_utc": 1761622247.0,
        "num_comments": 13,
        "score": 15,
        "permalink": "/r/UCSD/comments/1ohz7yv/does_it_get_better_here/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Sorry if this is formatted wrong, I dont ever usually interact with anything online that is public bc of anxiety but I genuinely need to hear from some upperclassmen. Im a freshman at ucsd and since deciding to attend I feel like the school has done nothing but make me feel like they didn’t want me to actually accept. I have severe social anxiety to the point where I spent a large portion of my childhood unable to leave the house on my own. Despite this being very well documented, the Osd randomly ghosted me despite multiple calls and emails leaving me completely on my own in a triple dorm. Additionally, I have been on an anti-anxiety medication for years and almost had to go through withdrawals because the campus pharmacy would not respond to my requests to send my medication there. I live in a near constant state of anxiety because of how little privacy I have(resulting in me waking up constantly throughout the night) and have been showering multiple times a day just so my roommates wont hear me cry. On top of that I have a lot of uncommon food allergies and have had several scares with dining hall food to the point where Im forced to cook everything myself. Every place I reach out to sends me to someone else, and it feels like they don’t actually want to help and just want to get rid of me. I know I struggle to make friends and I was prepared for some level of isolation, but I haven’t had a word spoken to me in weeks and I somehow feel as though Im both too surrounded by people and too isolated? The whole reason I picked this school was for the quality of classes, but I am finding all the material to be shallower and easier than the stuff I learned in high school. In short im miserable and feel like Im not even getting the education I wanted to show for it. Does it get easier? Will my classes become more rigorous? I would love to hear from students with a few more years under their belt because Im finding it hard to make myself stay here. Im not looking for someone to tell me solutions to the problems I’ve faced so far, im looking for someone to give me something to maybe look forward to."
    },
    {
        "title": "nw pass or better alternatives?",
        "author": "Annual_Peace",
        "created_utc": 1761621920.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohz43e/nw_pass_or_better_alternatives/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "my friend is coming to visit me this thurs-sun. i thought about getting a nw pass, but im just wondering if there are any other options I have for parking without risking a ticket. \n\ni just dont want to worry about moving the car around at 7:30am on friday morning, finding where to park it in the meantime, and then move it again once 3-4pm hits. would I need to also move it saturday morning (if friday is also technically a weekday right?)? then sat-sun, am I able to just leave it there without having to move it till sunday when she leaves?? lowk confused lol sorry if this is all annoyingly wrong. \n\ni might be overcomplicating this because i've never used this permit before, so please feel free to suggest what you think i should do or correct my misunderstanding of how the permit works lol. please and thank you guys 😭"
    },
    {
        "title": "Math date",
        "author": "Master-Opinion-7629",
        "created_utc": 1761621464.0,
        "num_comments": 7,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ohyytn/math_date/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I have cleared most math classes here and down to help someone struggling for a good time. Let's go on cute study dates, solve equations, and make math less scary. Coffee and grind problems until we're cooked and need to blow some steam off. \n\n\nIf you're looking to learn in a chilled setting, DM and let's make it happen "
    },
    {
        "title": "Bike rack at UTC",
        "author": "Away-Training2841",
        "created_utc": 1761619764.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohyeij/bike_rack_at_utc/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Do you know where the bike rack is at UTC?\nI'd like to go UTC after class but I don't have idea where to park my bike.\nLet me know some places if you know! "
    },
    {
        "title": "UCSDiddy",
        "author": "NicebrickLomoney",
        "created_utc": 1761618304.0,
        "num_comments": 2,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ohxwkg/ucsdiddy/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Made a instagram for diddy parties.\nFollow for fire ucsd parties. End ucsd being socially dead one baby oil bottle at a time🧴🧴🧴👀👀👀\n\nhttps://www.instagram.com/ucsdiddy?igsh=MW5jZGRvYjExYXAxcA%3D%3D&amp;utm_source=qr"
    },
    {
        "title": "I think about this woman with the dry ice from last Fall from time to time, and I hope she's okay",
        "author": "PhoGaPhoever",
        "created_utc": 1761617151.0,
        "num_comments": 6,
        "score": 56,
        "permalink": "/r/UCSD/comments/1ohxi63/i_think_about_this_woman_with_the_dry_ice_from/",
        "image_url": "https://i.redd.it/d6l2p40ufrxf1.png",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/PZy83P_SxunOftAjBpKHFh-kKiCQd7Q9TqIVfrjmjqY.jpg",
        "body": ""
    },
    {
        "title": "💈Cheap Ucsd BARBER 💈",
        "author": "WA-SNOOP",
        "created_utc": 1761615755.0,
        "num_comments": 2,
        "score": 8,
        "permalink": "/r/UCSD/comments/1ohx0jv/cheap_ucsd_barber/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey guys , My name is ismail Just wanted to let you guys know I’m a also a barber here at ucsd  💈! If you ever need a taper, a fade, or a beard update — I got you 🫡. My prices range between $15–25 (cheaper that what we can find here in San diego ) depending on the cut.\n\nI’m on campus every day, and I can also do home visits!. Feel free to contact me anytime or give my contact to your friends via WhatsApp or Ig : ismail_elhammoumi. Thanks guys and feel free to contact me 🫡💈"
    },
    {
        "title": "math 10A midterm",
        "author": "Interesting-Food457",
        "created_utc": 1761612263.0,
        "num_comments": 3,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ohvr9w/math_10a_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "scores are out, am i the only one who got cooked?"
    },
    {
        "title": "If the leaking nitrogen tanks on the east side of campus don't get you, the ones on the west side will",
        "author": "PhoGaPhoever",
        "created_utc": 1761611950.0,
        "num_comments": 1,
        "score": 16,
        "permalink": "/r/UCSD/comments/1ohvn36/if_the_leaking_nitrogen_tanks_on_the_east_side_of/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/Ya9sZjERAP38GM1widRMPXN4wDGDVfowSL3Dee55U4o.jpg",
        "body": ""
    },
    {
        "title": "Women’s Weight Lifting RIMAC Class",
        "author": "Live_Stranger_7090",
        "created_utc": 1761610423.0,
        "num_comments": 2,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ohv3bg/womens_weight_lifting_rimac_class/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Has anyone taken it? If so, what was your experience and how does it work? The registration closed for this quarter but I’m thinking about taking it next quarter. Also, the location says Triton Fit Park…I’ve never been how does that work?😣"
    },
    {
        "title": "PHYS 2A grades",
        "author": "No-Palpitation-8746",
        "created_utc": 1761609282.0,
        "num_comments": 5,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ohuo32/phys_2a_grades/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm taking PHYS 2A this quarter as a freshman and my professor is Brian Shotwell. According to his syllabus the rough cut off for each letter grade is 85% (A-/B+), 70% (B-/C+), 55% (C-/D), 50% (D/F) which I feel is kind of harsh considering his quiz average is apparently 42-55%. I'm just wondering if anyone who took his class know if this is similar to what our final grade is based on."
    },
    {
        "title": "best/easiest way to get to the airport?",
        "author": "pondspirit",
        "created_utc": 1761608663.0,
        "num_comments": 13,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ohufdo/besteasiest_way_to_get_to_the_airport/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "besides uber/lyft"
    },
    {
        "title": "BICD 100 — Professor McDonnell",
        "author": "Many-Lack-2207",
        "created_utc": 1761607776.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohu33d/bicd_100_professor_mcdonnell/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’m taking BICD 100 with McDonnell and I just took her midterm last week, it was insanely hard. I honestly did really bad and now I’m kinda freaking out because I don’t know how to study for her class anymore.\n\nIf anyone’s taken her before, do you have any tips on how to study or prepare for her exams? Like what actually helps. I really don’t want to mess up the next one ( I need to have 80% on the next midterm to have a B in her class) please help 🙏🏻 thank youuuu\n\n"
    },
    {
        "title": "reverse vending machine",
        "author": "CabinetPuzzleheaded3",
        "created_utc": 1761607060.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohtszg/reverse_vending_machine/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Any know if there is any RVM in La Jolla ? Or best place to take recycling ? "
    },
    {
        "title": "HDH application",
        "author": "Status_Minute_4933",
        "created_utc": 1761603270.0,
        "num_comments": 4,
        "score": 8,
        "permalink": "/r/UCSD/comments/1ohsa73/hdh_application/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "How long does it usually take to hear back from HDH to work at dining? I've applied at the end of September and haven't heard back, do they usually call back to say the application was denied or do they email?"
    },
    {
        "title": "Want to drop out",
        "author": "rinkyrin",
        "created_utc": 1761602846.0,
        "num_comments": 20,
        "score": 101,
        "permalink": "/r/UCSD/comments/1ohs3v3/want_to_drop_out/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm so tired and can't balance my study and life well. The things I learn are extremely difficult and I feel lonely. I really want to drop out of school!"
    },
    {
        "title": "Anyone else living/has lived in the Venetian Condominiums ?",
        "author": "happylee_family982",
        "created_utc": 1761600661.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohr716/anyone_else_livinghas_lived_in_the_venetian/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Moved in to the Venetian Condominiums because it was one of the most affordable options nearby. To keep it short, our place was pretty filthy on move in and infested with cockroaches. \n\nAnyone else have a similar experience or any insight on the place? I’ve read up on the older UCSD post on it and found it very enlightening. "
    },
    {
        "title": "PUR watet filter installation",
        "author": "Away-Training2841",
        "created_utc": 1761600219.0,
        "num_comments": 4,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohr09j/pur_watet_filter_installation/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/tFTengVyD3_FbUiET45N4rNOzx3PpCbTx9gTdT_FJbQ.jpg",
        "body": "I saw some students installed PUR water filter system so I bought PURs to install both in the Kitchen and bath room.\n\nAnd I don't know how to install and replace faucet mounts. Do you have any idea? Will HDH help me?"
    },
    {
        "title": "taco bell",
        "author": "AnxiousComputer9398",
        "created_utc": 1761600166.0,
        "num_comments": 33,
        "score": 267,
        "permalink": "/r/UCSD/comments/1ohqzfu/taco_bell/",
        "image_url": "https://i.redd.it/wfugulvl1qxf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/x2_Ie7UtjFbIrSb1-pVtjUIkiv75IGDNasgudyFdyHs.jpg",
        "body": "it was supposed to open today but its still closed 💔"
    },
    {
        "title": "BIMM 100 with Jose Pruneda Paz",
        "author": "amberlitte",
        "created_utc": 1761599590.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ohqqdt/bimm_100_with_jose_pruneda_paz/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Was his midterm actually similar to problem sets/clickers? How should I prepare"
    },
    {
        "title": "Any Revelle students going into or have gone into Nursing?",
        "author": "Ein_Sof_",
        "created_utc": 1761597973.0,
        "num_comments": 1,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ohq1k8/any_revelle_students_going_into_or_have_gone_into/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Do you all know from experience if the Humanities courses cover the English Comp requirements or if you have to make a special case for it to count?\n\nNot trying to take English comp after spending 2 years writing argumentative essays. Different programs have different requirements and very few list humanities. Thanks "
    },
    {
        "title": "churro stand by center hall",
        "author": "Resident_Assist7166",
        "created_utc": 1761596229.0,
        "num_comments": 2,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ohp9rh/churro_stand_by_center_hall/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "has anyone seen the churro stand by center hall (and when)\ni want churro but i always miss it"
    },
    {
        "title": "Rhode Peptide lip tint",
        "author": "Top_Acanthisitta154",
        "created_utc": 1761596002.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohp655/rhode_peptide_lip_tint/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I found it in Warren Lecture Hall 2001 at around 12:50 so if it is yours hit me up otherwise ima turn it into the lost and found"
    },
    {
        "title": "Lost lip gloss",
        "author": "Mindless-Hearing-329",
        "created_utc": 1761593926.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oho8m3/lost_lip_gloss/",
        "image_url": "https://i.redd.it/rig8f526jpxf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/hO-2yQBFr-WeZf15lSHATSa66WVU2ibu1Gqee4RjNRc.jpg",
        "body": "If you lost your summer Fridays it’s on outside loop💔\n"
    },
    {
        "title": "froyo cupon",
        "author": "GuideLazy",
        "created_utc": 1761593246.0,
        "num_comments": 0,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ohny24/froyo_cupon/",
        "image_url": "https://i.redd.it/rnuv1qd5hpxf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/Y-NUATPxRcAqGyFuEqaXTfL_HcxcZbJ-0NK4IbNdND0.jpg",
        "body": "TODAY TILL 9 "
    },
    {
        "title": "Found AirPod case by Revelle Courtyard",
        "author": "Busy-Question9114",
        "created_utc": 1761592920.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ohnsv4/found_airpod_case_by_revelle_courtyard/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I found an AirPod case with a cover on it at one of the benches in the courtyard area this morning, like across from the small coffee stand. I turned it in at the store in 64°. "
    },
    {
        "title": "current joys concert",
        "author": "Gold-Volume-5445",
        "created_utc": 1761590425.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ohmog7/current_joys_concert/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "is anyone going to the current joys concert tn at the quartyard? "
    },
    {
        "title": "how safe from airport to campus?",
        "author": "booknerd_07",
        "created_utc": 1761589581.0,
        "num_comments": 16,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ohmb77/how_safe_from_airport_to_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’m a female flying back today and I’ll reach the airport at around 7. I was wondering how safe it is to use the shuttle and then the trolley back to the campus? Btw I’m a female"
    },
    {
        "title": "HDH contingent offer",
        "author": "Remote_Background902",
        "created_utc": 1761585708.0,
        "num_comments": 2,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ohkjsd/hdh_contingent_offer/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I got a contingent offer to work at ovt and they sent a background check on October 17 which I filled out the same day, I was wondering if anyone knows how long it usually takes for them to get back to you?"
    },
    {
        "title": "Cogs 2 midterm",
        "author": "ImpactAshamed4317",
        "created_utc": 1761585296.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ohkcwx/cogs_2_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "How are you guys studying?"
    },
    {
        "title": "How were everyone's midterms?",
        "author": "Wide-Squash-2475",
        "created_utc": 1761581208.0,
        "num_comments": 22,
        "score": 19,
        "permalink": "/r/UCSD/comments/1ohiifq/how_were_everyones_midterms/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "We're halfway through the quarter and midterms are pretty much over. How was it for you guys? Smooth sailing or turbulence ahead? "
    },
    {
        "title": "Good at rhythm and right-handed? Earn $20 in ~30min as our participant (In person only)",
        "author": "wawnx",
        "created_utc": 1761580536.0,
        "num_comments": 2,
        "score": 28,
        "permalink": "/r/UCSD/comments/1ohi7ik/good_at_rhythm_and_righthanded_earn_20_in_30min/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/ptLO9M65pbXtVzH2KoFp8xFipbKdM4GAXtENIw3TY_s.jpg",
        "body": "Hi folks, I'm a graduate student from the CSE department and here is the opportunity to make $20 in about \\~30 minutes in this week. In person only. (in the CSE building)\n\nTo participate, make sure you are right-handed, can hear music and have a normal/good sense of rhythm.\n\nThere are 2 tasks. The 1st task is about 30 min. The 2nd task is about 40 min. Max 1.5h combined.\n\n(1)If you'd like to do the 1st part for $20, book a 30 min slot; (2)If you'd like to do the full task for $40 in one seating, then book 3 consecutive slots; (3)If you'd like to do the full task for $40 at two different time, book them separately, task1 uses a 30min slot, task2 uses two consecutive 30min slots.\n\nAnd if u have joined my studies before, you are eligible for only part2 (because you have already done part1)😅\n\nhttps://preview.redd.it/eei6r9h9foxf1.png?width=820&amp;format=png&amp;auto=webp&amp;s=030a019fe370de67938a34bc6d6da098c9b74132\n\nhttps://preview.redd.it/edowjjsafoxf1.png?width=592&amp;format=png&amp;auto=webp&amp;s=385c5a071ffbfe8502d1c2f4a03a25b99f181aec"
    },
    {
        "title": "Lost Keys",
        "author": "Ok-Buffalo-2420",
        "created_utc": 1761578994.0,
        "num_comments": 1,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ohhisg/lost_keys/",
        "image_url": "https://i.redd.it/kd0n64oraoxf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/mCxCbIroAyCLOf21b_tb44d3xrNj6zgrZEoyY-5LUgU.jpg",
        "body": "If you recognize these keys please let me know! I found them on the crosswalk of Torrey Pines Scenic Drive at 8:27AM on Monday, October 27th "
    },
    {
        "title": "Never attending lecture",
        "author": "ConstructionIll3025",
        "created_utc": 1761549403.0,
        "num_comments": 27,
        "score": 67,
        "permalink": "/r/UCSD/comments/1oh7xxy/never_attending_lecture/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Has anyone ever gotten good grades even though they never went to class? For difficult classes? I’ve been having a bit of a transportation conflict and just wanted to know if it’s realistic or I just drop out 😭"
    },
    {
        "title": "Physics 2C",
        "author": "PlantOk774",
        "created_utc": 1761545661.0,
        "num_comments": 2,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oh70yo/physics_2c/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "How’d everyone do with that quiz 🤔 "
    },
    {
        "title": "anyone wanna study together tomorrow?",
        "author": "Psychological_End164",
        "created_utc": 1761544810.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oh6t26/anyone_wanna_study_together_tomorrow/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I need to lock in for my DSC 10 midterm"
    },
    {
        "title": "bimm 121 homework 1 report",
        "author": "nobaanana",
        "created_utc": 1761544480.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oh6pz0/bimm_121_homework_1_report/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi, im currently taking bimm 121, the microbio lab with Dr.Gus. I am unsure if my report, especially the tables/graph follow the intructions she put as they were confusing. So I was wondering if anyone would want to go over our report together? \n\nIf so, PLS pm. This class has been bringing down my entire quarter 😭\n\nedit: or if anyone took this class with her and is willing to give me some of their precious time, that would be VERY MUCH appreciated. "
    },
    {
        "title": "VIS 20 Midterm",
        "author": "No_Examination_8833",
        "created_utc": 1761542406.0,
        "num_comments": 4,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oh6631/vis_20_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi, I was wondering if anyone here has taken VIS 20 and had any advice or notes of what I should expect for my upcoming midterm this week. I'm pretty bad when it comes with memorizing stuff, and I really only have time tonight to study- so anything helps! Very much appreciated :')"
    },
    {
        "title": "Yall are so easy",
        "author": "tay1stplace",
        "created_utc": 1761541898.0,
        "num_comments": 3,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oh6135/yall_are_so_easy/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Went to halloween parties this weekend and I don't even have to try cuz yall are overly going. its really bbq chicken easy fr"
    },
    {
        "title": "Where to get a matcha latte on campus with dining dollars?",
        "author": "waifadreama",
        "created_utc": 1761541540.0,
        "num_comments": 27,
        "score": 57,
        "permalink": "/r/UCSD/comments/1oh5xka/where_to_get_a_matcha_latte_on_campus_with_dining/",
        "image_url": "https://i.redd.it/dk3goxie7lxf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/-3Dh_F2Jxn09YR-weBoBIy_zXKsQu7fTSnRDCOJ4kRk.jpg",
        "body": "Thank you in advance. I've never had one before and I'm curious about it! I can't be a performative male if I have tits, right?"
    },
    {
        "title": "FOUND Ipencil 2nd gen!",
        "author": "DearImplement6284",
        "created_utc": 1761538813.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oh55vj/found_ipencil_2nd_gen/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I found an ipencil on 2nd floor Geisel in classroom 1 (room 262) on the east wing. It has an engraving that starts with ✨ and ends with ✨, if you can tell me the name engraved on it in between I’ll meet up on campus!"
    },
    {
        "title": "Study shortcuts",
        "author": "Wooden_House_8013",
        "created_utc": 1761537743.0,
        "num_comments": 2,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oh4uk5/study_shortcuts/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey everyone,\n\nCan anyone suggest a good site that you can upload textboom PDFs (and possibly lecture podcasts) and get flash cards and summaries automatically made? If they can make mind maps that'd be cool too. The flashcards are most important though. \n\nI have a lot of dense readings this quarter and I really could use a way to save time that is being used  on monotonous tasks to prep study materials. \n\nI've tried a few AI sites but they weren't that good. They'd laser focus on one sentence for one topic then not put down anything for things that have their own section header and take up at least a page! So frustrating.  \n\nI'm willing to pay within reason for a good product too. Help much appreciated!"
    },
    {
        "title": "Note/Studying Tricks w/AI",
        "author": "Wooden_House_8013",
        "created_utc": 1761537718.0,
        "num_comments": 1,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oh4u9b/notestudying_tricks_wai/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey everyone,\n\nCan anyone suggest a good site that you can upload textboom PDFs (and possibly lecture podcasts) and get flash cards and summaries automatically made? If they can make mind maps that'd be cool too. The flashcards are most important though. \n\nI have a lot of dense readings this quarter and I really could use a way to save time that is being used  on monotonous tasks to prep study materials. \n\nI've tried a few AI sites but they weren't that good. They'd laser focus on one sentence for one topic then not put down anything for things that have their own section header and take up at least a page! So frustrating.  \n\nI'm willing to pay within reason for a good product too. Help much appreciated!"
    },
    {
        "title": "PCE 20 minute parking TOW",
        "author": "UCSDICK",
        "created_utc": 1761537222.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oh4oot/pce_20_minute_parking_tow/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "if youre parked in the 20 min parking spot, you maybe getting towed. "
    },
    {
        "title": "Harlan Hall Mysteries",
        "author": "ReeARat",
        "created_utc": 1761534908.0,
        "num_comments": 4,
        "score": 9,
        "permalink": "/r/UCSD/comments/1oh3yiw/harlan_hall_mysteries/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/TiYl_lD1iTe3sC7Fx4aADCkTUrX5XQXrnxyUX6_UzQc.jpg",
        "body": "Every now and then I hear someone knocking on my suite door and whenever me and my suite mates open the door there’s always some sort of utensil and a little treat with a message coming from “Big J”. My roommate always eats these little treats 😭 and just a few minutes ago, the suite had received another treat from Big J. It’s honestly really funny and it makes everyone confused."
    },
    {
        "title": "Religious Recruitment",
        "author": "jandj681",
        "created_utc": 1761532724.0,
        "num_comments": 11,
        "score": 80,
        "permalink": "/r/UCSD/comments/1oh38ym/religious_recruitment/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Why do these people always stop me to ask if I would like to hear a bible verse, man leave me alone. I said I wasn't interested and this guy tried following me like bruh"
    },
    {
        "title": "Is ECE 271a midterm and final curved",
        "author": "AggravatingSyrup8146",
        "created_utc": 1761532590.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oh37c8/is_ece_271a_midterm_and_final_curved/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm studying for the midterm right now, ive watched all of the classes and done all of the homework and still feel so lost when practicing for the midterm. What are dissections like for this class? are exams usually curved, I know the midterm is P/F but I dont know if its curved before the P/F"
    },
    {
        "title": "vis 20 midterm",
        "author": "AgencyHorror1844",
        "created_utc": 1761531684.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oh2wek/vis_20_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anyone have any notes for the vis 20 midterm? "
    },
    {
        "title": "Math20A Midterm Grade",
        "author": "MasterpieceFun3855",
        "created_utc": 1761528130.0,
        "num_comments": 17,
        "score": 28,
        "permalink": "/r/UCSD/comments/1oh1ojz/math20a_midterm_grade/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I got 49%. It's over. I'm cooked."
    },
    {
        "title": "Dijon Concert Tonight!",
        "author": "iwillbetheendofme",
        "created_utc": 1761526966.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oh1adk/dijon_concert_tonight/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Who’s coming thru 😜 I have good spots in line &amp; doors open @ 7"
    },
    {
        "title": "soci 138 midterm",
        "author": "YNGLUVZ-",
        "created_utc": 1761522990.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ogzvae/soci_138_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "has anyone started their cheat sheet for navon’s midterm on thursday? i’m really stumped because i know i should use the slides but as for the readings does anyone know if we should focus on specific ones?"
    },
    {
        "title": "BS MS Decisions",
        "author": "Used_Wind_2043",
        "created_utc": 1761521452.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ogzbk5/bs_ms_decisions/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone know when the BS/MS decisions for CSE come out? I know it says November on the website but does anyone know how early/late in November? Thanks!"
    },
    {
        "title": "Anyone wanna go see deftones",
        "author": "Right-Pie-8193",
        "created_utc": 1761520678.0,
        "num_comments": 3,
        "score": 18,
        "permalink": "/r/UCSD/comments/1ogz194/anyone_wanna_go_see_deftones/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "😁"
    },
    {
        "title": "stop",
        "author": "huggablebeetle",
        "created_utc": 1761520346.0,
        "num_comments": 7,
        "score": 338,
        "permalink": "/r/UCSD/comments/1ogywsd/stop/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Stop spending so much time on that damn life and get on your phone. There’s reels to scroll through "
    },
    {
        "title": "Free beginner boxing/kickboxing classes.",
        "author": "Honest_Comment8309",
        "created_utc": 1761519891.0,
        "num_comments": 0,
        "score": 7,
        "permalink": "/r/UCSD/comments/1ogyqn6/free_beginner_boxingkickboxing_classes/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I love boxing and kick boxing and have been doing it all my life. Add me at @triton.sd on IG if you’re interested, and send me a msg that says boxing or kickboxing, I’ll add you to a chat and we can get some stuff going. I have a lot of training gear for new ppl. We would most likely meet by main gym. "
    },
    {
        "title": "BIMM 100 with Amy Pasquenelli Midterm 1.",
        "author": "HungryBasket151",
        "created_utc": 1761519547.0,
        "num_comments": 1,
        "score": 6,
        "permalink": "/r/UCSD/comments/1ogylpj/bimm_100_with_amy_pasquenelli_midterm_1/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "For anyone who has taken Pasquenelli for BIMM 100, was her actual midterms similar to clicker questions and the pre-midterm? I hear from different people that the midterm is super hard and her class is mainly the final+midterm.... Any tips of how to do well on her midterm and I know it's mainly analyzing lab results. A little nervous for her midterm that's coming up lol. "
    },
    {
        "title": "Lost AirPods at eighth college",
        "author": "Flat_You_5763",
        "created_utc": 1761518612.0,
        "num_comments": 0,
        "score": 17,
        "permalink": "/r/UCSD/comments/1ogy9b8/lost_airpods_at_eighth_college/",
        "image_url": "https://i.redd.it/66z2yk17bjxf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/ZfL0z4schj0nloeicYh-4F28wC7x-dhYrQBJQleNC94.jpg",
        "body": ""
    },
    {
        "title": "dont be nasty",
        "author": "Turbulent-Living6875",
        "created_utc": 1761518504.0,
        "num_comments": 6,
        "score": 95,
        "permalink": "/r/UCSD/comments/1ogy7sw/dont_be_nasty/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I know it’s cold and flu season, but please be a bit more conscious about others' health as well. Like coughing into your elbow instead of your hand, some of you are NASTY in the library. I get that isolating completely isn’t always possible, but when you’re out in public, a little extra awareness goes a long way. Even if it's wearing a mask while you're coughing your lungs out in an enclosed space."
    },
    {
        "title": "Help finding lost Jacket w Passport inside",
        "author": "No_Brief5210",
        "created_utc": 1761514377.0,
        "num_comments": 0,
        "score": 9,
        "permalink": "/r/UCSD/comments/1ogwmhc/help_finding_lost_jacket_w_passport_inside/",
        "image_url": "https://i.redd.it/uyeb3ermyixf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/jm3prJiZJ6xVQp11UfvS6LMbHzdar_iS65ewUhLbt_4.jpg",
        "body": "Hi guys, I lost my jacket with my passport inside yesterday night around PC/Solis. It's a black zip-up jacket with gray insides. Any help is appreciated. Thanks."
    },
    {
        "title": "Sixth tapestry dryers",
        "author": "Express_Exchange3999",
        "created_utc": 1761514210.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ogwk2f/sixth_tapestry_dryers/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "TAKE YOUR SHIT OUT ON TIME ... OR ELSE IMMA LEAVE IT ON THE FLOOR RAHSHJSHDHS"
    },
    {
        "title": "Cooking pots at Target?",
        "author": "IdiocyInverted",
        "created_utc": 1761513048.0,
        "num_comments": 4,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ogw34o/cooking_pots_at_target/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone know if they stock big cooking pots at Target? I've went to the kitchenware section but I mainly see frying pans, which I already have. I can't make the ramen I bought "
    },
    {
        "title": "Lost Keys in 6th college Arts and Humanities 1st floor couch",
        "author": "No-Surround8702",
        "created_utc": 1761510153.0,
        "num_comments": 0,
        "score": 7,
        "permalink": "/r/UCSD/comments/1oguw88/lost_keys_in_6th_college_arts_and_humanities_1st/",
        "image_url": "https://i.redd.it/m0sli0j2mixf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/UhyKAa7GfiJdxkx8b3xdo3bhq7I0X1nWV0ugpBY_0dk.jpg",
        "body": "Was left in the couch on the building across from blue bowl"
    },
    {
        "title": "easy bio upper divs for winter 2026",
        "author": "Available-Ice3100",
        "created_utc": 1761500772.0,
        "num_comments": 0,
        "score": 8,
        "permalink": "/r/UCSD/comments/1ogqxv3/easy_bio_upper_divs_for_winter_2026/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi! does anyone have recommendations for easy (non-time consuming) bio upper divs being offered this winter that *don't* require chem 40b/another prereq that needs it?\n\nthanks!"
    },
    {
        "title": "off-campus housing",
        "author": "Certain-University58",
        "created_utc": 1761497935.0,
        "num_comments": 3,
        "score": 10,
        "permalink": "/r/UCSD/comments/1ogpqhp/offcampus_housing/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi, im a second year looking into off campus housing and im a little overwhelmed! does anyone have any good tips on where to start? im already in the facebook housing group, but it’s a lot to look at LOL\n\ni was told they might raise my financial aid loan-wise if i mark my housing status as off-campus, is that true? "
    },
    {
        "title": "Brawlhalla players?",
        "author": "Weird_Actuary_8554",
        "created_utc": 1761474274.0,
        "num_comments": 4,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ogh6lb/brawlhalla_players/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi looking for ppl who play brawlhalla and wanna run some games."
    },
    {
        "title": "looking for concert/music friends",
        "author": "Ayexo",
        "created_utc": 1761463094.0,
        "num_comments": 2,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ogeaji/looking_for_concertmusic_friends/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hello I'm a new first year student at 6th college. I've been having an alright time so far but I really want meet some people that listen to and talk about lots of music like me and want friends to go to concerts with. I truly do listen to everything, but heres like some of my favorite artists,\n\nASAP Rocky\nISOxo\nNinajirachi\nBlood Orange\nRufus Du Sol\nBerlioz\nTame Impala\nDrake\nSantigold\nThee Sacred Souls\nKaytranada\nFontaines DC\nAriana Grande 😭\nPheonix\n\nthese are just what i commonly listen to but i literally like listening to anything and just want some friends that expand what i listen to and can go to fun concerts/events with so lmk if your looking for a music friend, and I look forward to talking to you!"
    },
    {
        "title": "which calculator should I get",
        "author": "TeachExtreme9893",
        "created_utc": 1761462471.0,
        "num_comments": 2,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oge4rl/which_calculator_should_i_get/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "For some classes like bio, I need a calculator for exams. Right now I only have a graphing one that isn’t permitted. Should I get the ti 30xiis or ti 30xs"
    },
    {
        "title": "Kaytranada",
        "author": "Kiara_Star",
        "created_utc": 1761459786.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ogdfbs/kaytranada/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anyone going for the show on tuesday? Was thinking of going solo and was wondering if anyone else is "
    },
    {
        "title": "Chem 7l midterm",
        "author": "Slow-Stomach2076",
        "created_utc": 1761458950.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ogd7df/chem_7l_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Is anyone also taking 7l and how are you studying for the midterm? I know the practices midterm but what else"
    },
    {
        "title": "First year searching for fellow musicians",
        "author": "confogI",
        "created_utc": 1761456015.0,
        "num_comments": 5,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ogcf0d/first_year_searching_for_fellow_musicians/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Just a dude looking for people to jam or make friends with; currently commuting as a first year so it’s rough out here socially speaking but if you’re passionate about music let’s hang! I play bass and piano so I’m pretty open as far as genres I play and listen to. I’ve lately been balls deep in emo/midwest emo but I also love metal, grunge, shoegaze, classical, art in general really"
    },
    {
        "title": "ballot drop off",
        "author": "Inevitable-Suit1768",
        "created_utc": 1761455068.0,
        "num_comments": 2,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ogc5n6/ballot_drop_off/",
        "image_url": "",
        "thumbnail_url": "",
        "body": ""
    },
    {
        "title": "3rd year and accomplished almost nothing so far",
        "author": "Ashamed_Big4514",
        "created_utc": 1761453947.0,
        "num_comments": 31,
        "score": 128,
        "permalink": "/r/UCSD/comments/1ogbuci/3rd_year_and_accomplished_almost_nothing_so_far/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I've devoted 99% of my time here to keeping straight A's for a 3.9 with no time for social orgs or hobbies, all while knowing other people are performing just as well at this school while having perfectly balanced social lives and have resumes that grad schools would kill for. On the other hand here I am, having met almost no one here, have pretty much no peers to talk to in my classes, never joined a club, never joined a volunteer organization, nothing. I was watching a video the other day of a dude who is applying to law school and he's had a 3.9 gpa and already started several youth outreach and leadership orgs, businesses, and has had several internships, and is still popular and parties every weekend, meanwhile I have zero time in my schedule for anything other than studying and I feel like a failure by comparison. How do you guys do it? "
    },
    {
        "title": "Looking for friends",
        "author": "RoutineAd3119",
        "created_utc": 1761452758.0,
        "num_comments": 19,
        "score": 18,
        "permalink": "/r/UCSD/comments/1ogbiaz/looking_for_friends/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey everyone never posted anything like this before. But I’m just having feeling of loneliness and not being able to find genuine friends. I’ve tried talking to people in my class but it never really goes beyond classmates. I’ve attended some clubs and events but I couldn’t really find a place to stay. For reference I’m a 3rd year 20 M, a marine bio major. I’m down to hangout, and talk to new people. If anyone wants to be friends pls hmu or comment thanks. 🙏"
    },
    {
        "title": "y’all seriously need to stop working out",
        "author": "WorkGroundbreaking83",
        "created_utc": 1761448710.0,
        "num_comments": 14,
        "score": 106,
        "permalink": "/r/UCSD/comments/1ogaavc/yall_seriously_need_to_stop_working_out/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Why does everyone here have such good bodies?? like chill bro y’all making it impossible for me to stand out. Stop hitting the gym so I can finally shine pls😡"
    },
    {
        "title": "shroooooooms 🤰",
        "author": "Correct-Argument-543",
        "created_utc": 1761448138.0,
        "num_comments": 2,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oga4up/shroooooooms/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I can’t believe i’m posting this here but anyone wanna help a buddy out with mushrooms 🙏 \n\ni wanna trip and talk to god don’t judge"
    },
    {
        "title": "Anyone want to challenge an Alumni to Magic Arena??",
        "author": "thevmcampos",
        "created_utc": 1761445264.0,
        "num_comments": 3,
        "score": 9,
        "permalink": "/r/UCSD/comments/1og98t2/anyone_want_to_challenge_an_alumni_to_magic_arena/",
        "image_url": "https://i.redd.it/p8o4dnj68dxf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/3oaqdk10u2GVwfl8F_VGNlOVaKQTpXItgCN9H0nHZR4.jpg",
        "body": "If you're into Brawl on Magic: The Gathering Arena, find me as vmcampos#69225. My discord is [https://discord.gg/SMapk5ZB](https://discord.gg/SMapk5ZB) \n\nI'm doing another weekend MTGA + drinks thing, like [last week](https://www.reddit.com/r/UCSD/comments/1o9kzu3/so_i_havent_been_a_ucsd_student_in_nearly_30), so hilarity may ensue! \n\nPictured is my original UCSD teddy bear from the late '90s, my madd skillz on Arena, and a Grown-Up Beverage. ✨"
    },
    {
        "title": "does math18 require a scientific calculator?",
        "author": "TeachExtreme9893",
        "created_utc": 1761443705.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1og8qvg/does_math18_require_a_scientific_calculator/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "title"
    },
    {
        "title": "sun is setting earlier and earlier..",
        "author": "mikewhocheese297",
        "created_utc": 1761441336.0,
        "num_comments": 4,
        "score": 77,
        "permalink": "/r/UCSD/comments/1og7yy6/sun_is_setting_earlier_and_earlier/",
        "image_url": "https://i.redd.it/afrjirsiwcxf1.gif",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/2xt8tYRZbQinTiajN45IZ_eCCXbWMdjL8emF8gLp-Gg.jpg",
        "body": ""
    },
    {
        "title": "What do I do with this class",
        "author": "ManufacturerDue6786",
        "created_utc": 1761441169.0,
        "num_comments": 12,
        "score": 16,
        "permalink": "/r/UCSD/comments/1og7x3s/what_do_i_do_with_this_class/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm a freshman so idk how this works but this class has an average midterm score of like 20%. The same class taught by another professor has a much easier exam with a higher average score. What is gonna happen? Will my professor realize that the exam is too tough and make the next one easier?"
    },
    {
        "title": "Horror movie night for Halloween",
        "author": "Wide-Squash-2475",
        "created_utc": 1761440655.0,
        "num_comments": 2,
        "score": 12,
        "permalink": "/r/UCSD/comments/1og7r1w/horror_movie_night_for_halloween/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’m not big on parties or costumes, but I really love _spooky_ season. I’m thinking of hosting a horror movie night at my place for a small group of people and I'd love some recs. So what are your must-watch horror movies for Halloween? \n\nAlso, those who wanna join, feel free to DM "
    },
    {
        "title": "\"Should I do my MS/PhD/etc in A or B or C or.....\"",
        "author": "FactAndTheory",
        "created_utc": 1761440228.0,
        "num_comments": 1,
        "score": 18,
        "permalink": "/r/UCSD/comments/1og7m43/should_i_do_my_msphdetc_in_a_or_b_or_c_or/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I see this question a lot and it is a totally smart thing to ask, but reddit is the last place you should ask it.\n\nIf this is you, go find 5 PIs who work in the realm you're considering and ask them what they would have an extra pair of grad student hands/eyes work on, if they magically had an extra F grant to pay them. *Everyone* has a list of projects or open questions they'd like to tackle if they had the bodies to throw at it, and generally they'll know the kind of skillset they would look for in the person who could succeed at it. You can roll the dice with abstract insight as people talk about \"where the field is going\" but:\n\nA) expect all your peers to have heard the same thing so it is not beneficial to you as one person in a competitive group,\n\nB) people don't really get hired by the field, they get hired by PIs and lab managers, and\n\nC) the NIH is being dismantled by Nazis, meaning the competition is going to radically ramp up. Departments will likely cut their intakes or switch to admitting every other year (or both), multi-year grants have to be funded in lump sums so they're gonna be way harder to get, etc. It's dark and you will need to be agile about it."
    },
    {
        "title": "Fun clubs?",
        "author": "Illustrious-Solid134",
        "created_utc": 1761434638.0,
        "num_comments": 9,
        "score": 10,
        "permalink": "/r/UCSD/comments/1og5q2f/fun_clubs/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "What are some fun clubs to join? I haven’t joined any so far and want to make more friends haha"
    },
    {
        "title": "Come dance with us! No partner or experience required, free!",
        "author": "Party-Tale-4297",
        "created_utc": 1761433498.0,
        "num_comments": 0,
        "score": 6,
        "permalink": "/r/UCSD/comments/1og5bmq/come_dance_with_us_no_partner_or_experience/",
        "image_url": "https://i.redd.it/crqtvlq3acxf1.png",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/vv2LesZR0G4agtbOeQmkR8B8aUrA0UpB3S4IY0THUyQ.jpg",
        "body": "Come learn a new skill and make some friends!"
    },
    {
        "title": "to the dumbass who parked their scooter over mine",
        "author": "Numerous_Wallaby_824",
        "created_utc": 1761433200.0,
        "num_comments": 4,
        "score": 101,
        "permalink": "/r/UCSD/comments/1og57mb/to_the_dumbass_who_parked_their_scooter_over_mine/",
        "image_url": "https://i.redd.it/ymyxugy89cxf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/0lBR5CfaBL8WNC8JFjcAsGg3yPSg3cTK2n8dAt8JiwI.jpg",
        "body": "was it really that hard to have put it next to mine or find a different spot? it took me an unreasonably long time to unlock mine from how you put it so thanks :) "
    },
    {
        "title": "Alarm and Sirens?",
        "author": "seeyathere856",
        "created_utc": 1761430463.0,
        "num_comments": 0,
        "score": 10,
        "permalink": "/r/UCSD/comments/1og485z/alarm_and_sirens/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’m studying for a midterm and hear this alarm coming from campus (I live in grad) also hella sirens- what’s going on? It’s hella loud and been for the last 5 min. I can hear smaller alarms going off too. Sounds like a tornado or tsunami warming."
    },
    {
        "title": "No freaky 😢",
        "author": "Unfair_Gold1720",
        "created_utc": 1761428738.0,
        "num_comments": 10,
        "score": 20,
        "permalink": "/r/UCSD/comments/1og3l1y/no_freaky/",
        "image_url": "",
        "thumbnail_url": "nsfw",
        "body": "Where's the subreddit for when I wanna get freaky 😢"
    },
    {
        "title": "Full-Time vs Flex Evening MBA (Using GI Bill) — What’s the Real Difference?",
        "author": "namelesshuman1233",
        "created_utc": 1761428690.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1og3ken/fulltime_vs_flex_evening_mba_using_gi_bill_whats/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’m deciding between the **Full-Time MBA** and the **Flex Evening MBA**, and I’m using the **GI Bill** to cover tuition.\n\nFor those who’ve done either program —\n\n* What would you recommend?\n* What does the **class schedule** actually look like (how many days/class sessions per week)?\n* Do you get **summers off**?\n\nFrom what I’ve heard:\n\n* The **Flex Evening** requires **summer classes** if you want to finish in \\~2.5 years.\n* The **Full-Time** program can be done in about **21 months** and may have **no summer classes**.\n\nCan anyone confirm if that’s accurate and share what your experience was like with workload, pace, and scheduling?\n\nThanks in advance!"
    },
    {
        "title": "Assignment help",
        "author": "Awkward-Call-1773",
        "created_utc": 1761422161.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1og1038/assignment_help/",
        "image_url": "https://external-preview.redd.it/L2xmy1e94cOiopc_hy4h5nSlevgAOR8uX3oWvjgJoDA.png?auto=webp&s=f3cb4c111f415638a3c8f6ef136e32534caf6ebe",
        "thumbnail_url": "",
        "body": "hi can yall help with my assignment ty in advance (3min survey) \\[heads up: it collects emails but I couldn't really find another way to show the professor that the responders are different\\]  \n\\[update: i believe i turned off the email collection lmk otherwise. sorry about that\\]  \n[https://docs.google.com/forms/d/e/1FAIpQLSdJkarnZ\\_GkB3o1ZXsOdYwI-XBzrhJuxjxNXanqF63O6mkX3w/viewform?usp=dialog](https://docs.google.com/forms/d/e/1FAIpQLSdJkarnZ_GkB3o1ZXsOdYwI-XBzrhJuxjxNXanqF63O6mkX3w/viewform?usp=dialog)"
    },
    {
        "title": "I want to use my Triton Cash on the Meal of the Week at Subway T-T",
        "author": "After_Peace7891",
        "created_utc": 1761418632.0,
        "num_comments": 1,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ofzklk/i_want_to_use_my_triton_cash_on_the_meal_of_the/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Why does Subway no longer take my Triton Cash? GrubHub doesn't have the special..."
    },
    {
        "title": "Information about the Master of Data Science online program",
        "author": "dark_green1234",
        "created_utc": 1761418110.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ofzd07/information_about_the_master_of_data_science/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hello, I was class of 2022, major in Biochemistry. I'm currently interested in applying for the Master of Data Science online program at UCSD (https://mds.ucsd.edu/).\n\nAnyone who is/was in this program can share your experience? \n\nHow do you like the program? Is there anything you don't like about it?   \nDo you have any experience in data science/coding prior? \n\nDo you think the materials is applicable and useful for jobs? \n\nAlso, I'm thinking about getting this master degree while working part-time. Do you think it feasible to do so? \n\nAny insights are greatly appreciated. Thank you so much! \n\n"
    },
    {
        "title": "Cogs 101a over summer",
        "author": "devilwearsd1or",
        "created_utc": 1761416880.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ofyv1k/cogs_101a_over_summer/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Is cogs 101a offered in the summer? "
    },
    {
        "title": "Fell on a date- literally!!",
        "author": "Glad_Preparation_889",
        "created_utc": 1761416657.0,
        "num_comments": 17,
        "score": 116,
        "permalink": "/r/UCSD/comments/1ofyrss/fell_on_a_date_literally/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Guyss, I went on my 3rd date with this guy I realllyyyy like, to the haunted maze but we were high when we went in so I was shit scared inside. Came out from there and we were walking when I just decided to forget how to walk and I fell down, scraped my knee. Mind you- I was walking, not even on the scooter guyssss- walking!! \n\nHe was really sweet to get me up and he sat me down and looked where I was hurt but on a scale of 1-10, how embarrassing is this? I fell and I laughed it off saying wow I don’t even know how to walk now but still!!! \n\nAlso, if you’re reading this- fabulous job with the haunted maze guys!!! So proud of you!! YOU DEFINITELY SCARED ME and it was a good date until I fell 🫠"
    },
    {
        "title": "Men’s Basketball: Adrian McIntyre Effect",
        "author": "xxlontexx",
        "created_utc": 1761416506.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ofypl0/mens_basketball_adrian_mcintyre_effect/",
        "image_url": "https://external-preview.redd.it/M-4asJQlwQEEGxXsjNQaxVMlb-SvN_ozaQt9MbAsoXk.jpeg?auto=webp&s=7bb9806e07fe76609d6b3fa2c062c10f261ef622",
        "thumbnail_url": "",
        "body": "The leading scorer in all of college basketball now resides in the WCC. Read about him and how he can impact the team this year: \n\nhttps://lonte.substack.com/p/top-division-ii-and-juco-players"
    },
    {
        "title": "Which CBN Programming course should I take?",
        "author": "Pretend-Cicada-8649",
        "created_utc": 1761416135.0,
        "num_comments": 2,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ofyjyc/which_cbn_programming_course_should_i_take/",
        "image_url": "",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/DiVApOiqga8uo_gn0UT1-nmR0Pa2tt2MHQPET0AoIi0.jpg",
        "body": "https://preview.redd.it/6la09ylauaxf1.png?width=442&amp;format=png&amp;auto=webp&amp;s=6623bff73cde0b3fc029d12bccbfb8974d72375c\n\nAnybody who has taken one of these pls tell me if u liked it and if it was unnecessarily difficult. I have a bit of python experience but not much. Thanks!!!"
    },
    {
        "title": "Albizati Chem 40A midterm",
        "author": "Consistent_Iron_1159",
        "created_utc": 1761416041.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ofyiik/albizati_chem_40a_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Why the freak was a majority of the class still there when time was up 😓, curve better go crazy 💔"
    },
    {
        "title": "Art I see in ucsd a bit ago, who that bnuyy",
        "author": "Protolinux217",
        "created_utc": 1761415640.0,
        "num_comments": 5,
        "score": 81,
        "permalink": "/r/UCSD/comments/1ofyc9v/art_i_see_in_ucsd_a_bit_ago_who_that_bnuyy/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/n7jFyQNVsGRanVOf3-dCLUirUhgrjUecw2TtBD_QVgc.jpg",
        "body": ""
    },
    {
        "title": "HDH Workers",
        "author": "Live_Stranger_7090",
        "created_utc": 1761413128.0,
        "num_comments": 3,
        "score": 6,
        "permalink": "/r/UCSD/comments/1ofxac3/hdh_workers/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Can you guys see the profile pictures we set when we place a mobile order? 😅"
    },
    {
        "title": "hold on student account",
        "author": "Puzzleheaded_Year187",
        "created_utc": 1761412939.0,
        "num_comments": 2,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ofx7jf/hold_on_student_account/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey guys so i have a payment due for housing and the deadline was yesterday but i dont have any holds. I wanted to ask if it would be fine if i paid at the end of next month because the only thing i cant do is enroll in classes right? so would it be fine if i just paid during fall quarter? i really cant afford to pay it now. Thanks!"
    },
    {
        "title": "cupcake/muffin tin???",
        "author": "External_Warning3475",
        "created_utc": 1761412586.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ofx28k/cupcakemuffin_tin/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone have a cupcake/muffin tin I can borrow for the day??? I’ll pay you with one of whatever I bake "
    },
    {
        "title": "Healthcare majors what’s your opinion on the anatomy+ lab online class thru UCSD extended? Should I enroll? In a dilemma😭",
        "author": "Time-Tailor-2421",
        "created_utc": 1761411908.0,
        "num_comments": 3,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ofwrzf/healthcare_majors_whats_your_opinion_on_the/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "🙏🏼"
    },
    {
        "title": "lonely and friendless asf, any advice?",
        "author": "Sea_Rain6089",
        "created_utc": 1761411561.0,
        "num_comments": 13,
        "score": 19,
        "permalink": "/r/UCSD/comments/1ofwmi0/lonely_and_friendless_asf_any_advice/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i didn't want to be one of the many posts on this reddit venting about how lonley i am, but unfourntley here i am 🫠. I'm a first year so I know I have time and what not, but I've never struggled to make friends before. I consider myself somewhat extroverted and I went to at least 1 welcome week event every day in week 0, but i still somehow have no friends. I keep talking to people and then they never respond or follow up on plans, and I don't want to keep chasing after people who, in all honesty, don't really seem that keen on being friends. I'm trying my best to be positive but it's just getting hard as I see all my suitemates making friends so easily, and I don't want this to come of in the wrong way, but I was literally the one who went up to people and introuced all of my suitemates and whatnot to other groups when out and about. My point is that nobody really comes up to me if that makes sense, it's just  so defeating that I have to keep chasing people and nothing ever comes out of it, and I've been to a few club things but it's the same way. I really felt it yesterday which is why I'm posting now ig lol, but all of my suite mates were out with their own friends and there I was just sitting in bed on my phone alone, and then when I went out to get some air everybody was with their friends. Outside of my dorm, I genuinely have 4 friends, 2 of which are from before sd and out of the other 2, one of them hasn't reached out in like 2 weeks after I kept making every plan. AGAIN i really don't want this to come off as me begging for pity, but I just don't know what I'm doing wrong lol also im a female first year and i'm lowk chopped cheese so maybe that's part of the problem 😭"
    },
    {
        "title": "Girl on Rollerskates",
        "author": "Bloup_em",
        "created_utc": 1761388986.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ofog18/girl_on_rollerskates/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anyone else saw that girl tonight by urey? Wanted to something but I think she was on the phone loll"
    },
    {
        "title": "Any former Foodworx (Old Sixth) employees here? I'm haunted by the Southwest Salad.",
        "author": "seanjin",
        "created_utc": 1761386032.0,
        "num_comments": 2,
        "score": 16,
        "permalink": "/r/UCSD/comments/1ofnnxr/any_former_foodworx_old_sixth_employees_here_im/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Okay Tritons, especially alumni—I'm on a desperate mission.\n\n  \nDoes anyone remember Foodworx at the old Sixth College, back when it was in the Pepper Canyon/Matthews area?\n\nThey used to make this Southwest Salad (at least, I'm pretty sure that's what it was called) that was, no joke, the best salad I've ever had. I *still* think about it and have never been able to find anything that tastes the same.\n\nIf you are one of the legends who worked there and remember making it... please, I'm begging you. How the hell do I make it? What was the dressing? What were all the toppings?\n\nHelp an alum relive the glory days. "
    },
    {
        "title": "Can we not scream at 2am",
        "author": "buckaroo_115",
        "created_utc": 1761383681.0,
        "num_comments": 5,
        "score": 55,
        "permalink": "/r/UCSD/comments/1ofn28r/can_we_not_scream_at_2am/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "To the group of people that were outside of Vela PCW at 2 am screaming and being very loud…can we please not. Can we please be respectful of people who are trying to sleep? Especially those who are on that first floor 😭. "
    },
    {
        "title": "Any groups that do sprint training?",
        "author": "Historical_Meet2877",
        "created_utc": 1761376396.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ofl75y/any_groups_that_do_sprint_training/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "."
    },
    {
        "title": "Is there pick up volleyball at rimac. If so when?",
        "author": "Historical_Meet2877",
        "created_utc": 1761376335.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ofl6l6/is_there_pick_up_volleyball_at_rimac_if_so_when/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "."
    },
    {
        "title": "How to know which week we are in?",
        "author": "Proper-Crazy-6589",
        "created_utc": 1761372900.0,
        "num_comments": 7,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ofk9e8/how_to_know_which_week_we_are_in/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "As title: is there somewhere where I can consistently check so? no gimmicks. official and clear stuff. Thanks in advance. "
    },
    {
        "title": "DSC140A or CSE150A?",
        "author": "kuma-u-404",
        "created_utc": 1761371436.0,
        "num_comments": 3,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ofjv9l/dsc140a_or_cse150a/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Debating which course to take! Both satisfy my major requirement. For people who had taken either courses, how are your experiences?"
    },
    {
        "title": "Remember tonight’s deadline!",
        "author": "FartRag",
        "created_utc": 1761368009.0,
        "num_comments": 0,
        "score": 23,
        "permalink": "/r/UCSD/comments/1ofiwks/remember_tonights_deadline/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Reminder! Last chance to drop without a W !!! You got 2 hours…"
    },
    {
        "title": "CSE Minor",
        "author": "wanyeetiso",
        "created_utc": 1761366411.0,
        "num_comments": 4,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ofifxy/cse_minor/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi!  \nI took cse11 spring quarter and I did kinda bad, I passed with a B, but i practically failed my exams. Should I stick with cs as a minor? Or does me doing poorly in cse11 mean im weeded out? "
    },
    {
        "title": "I need advice",
        "author": "Different_Manner_591",
        "created_utc": 1761364716.0,
        "num_comments": 7,
        "score": 9,
        "permalink": "/r/UCSD/comments/1ofhxsa/i_need_advice/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "im a second currently taking math 10B and chem 6A , I'm also premed I took my midterms this week and screwed up on both the chem and the math I failed the chem I still don't know about the math , I spent hours trying to understand a few things for chem and I literally can't I need advice on how to study I do practice questions but I thinks it the foundation I lack the exam was so easy yet I didn't understand how to do it"
    },
    {
        "title": "Where’s all the spooky posts??",
        "author": "hobocollections",
        "created_utc": 1761362775.0,
        "num_comments": 6,
        "score": 6,
        "permalink": "/r/UCSD/comments/1ofhcmg/wheres_all_the_spooky_posts/",
        "image_url": "https://i.redd.it/50wrxf4uf6xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/qbr2ik5qltWSPfTXsG7UTTRblOTIuCGaBAHhs6k8VkM.jpg",
        "body": "Where’s all the spooky memes???"
    },
    {
        "title": "Red NC Miata at Warren",
        "author": "Optimal-Can-231",
        "created_utc": 1761361528.0,
        "num_comments": 0,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ofgz15/red_nc_miata_at_warren/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Saw a clean red NC Miata parked near Warren today — anyone know whose it is? Always cool to see another Miata around campus. "
    },
    {
        "title": "Found wallet at bus station near Revelle College",
        "author": "TriplEAstronautics",
        "created_utc": 1761358854.0,
        "num_comments": 0,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ofg4x3/found_wallet_at_bus_station_near_revelle_college/",
        "image_url": "https://i.redd.it/vk06i51s36xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/G1MGqx6YYS2GiNeFCPkFavHACYL6AMu8jesrKfjFHuc.jpg",
        "body": "If you lost a wallet recently near York Hall in Revelle College. I turned it in at front desk of Main Gym. It looks like there are ids still inside it so I believe they should easily I identify if you are the owner or not."
    },
    {
        "title": "Does anyone know the club that has meetings out on the ERC green Fridays around 6pm?",
        "author": "AlfalfaCow",
        "created_utc": 1761358353.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1offz1f/does_anyone_know_the_club_that_has_meetings_out/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "It seemed like they were sparring with prop swords and literal maces lol I was curious if anyone knew which club it is!"
    },
    {
        "title": "20C Midterm today (Yu)",
        "author": "SaturnineSmith",
        "created_utc": 1761357972.0,
        "num_comments": 3,
        "score": 3,
        "permalink": "/r/UCSD/comments/1offuob/20c_midterm_today_yu/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "What do we think?"
    },
    {
        "title": "i love this school",
        "author": "WindyBoiiii",
        "created_utc": 1761357432.0,
        "num_comments": 33,
        "score": 192,
        "permalink": "/r/UCSD/comments/1offo8u/i_love_this_school/",
        "image_url": "https://external-preview.redd.it/ZHAxNzI0MXl6NXhmMcnxKg5Xx_IhvoNaozEjhUN6B0YWhoE4qXjwoR1-GNxZ.png?format=pjpg&auto=webp&s=9cf0001e564229d17834ad2818b06969dfd62337",
        "thumbnail_url": "https://external-preview.redd.it/ZHAxNzI0MXl6NXhmMcnxKg5Xx_IhvoNaozEjhUN6B0YWhoE4qXjwoR1-GNxZ.png?width=140&height=140&format=jpg&auto=webp&s=296e223358b1e204fa83378f2a32681326483802",
        "body": ""
    },
    {
        "title": "Discounts for Places that Accept Triton Cash",
        "author": "Far-Performance-6988",
        "created_utc": 1761356530.0,
        "num_comments": 4,
        "score": 9,
        "permalink": "/r/UCSD/comments/1offdh6/discounts_for_places_that_accept_triton_cash/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Places that accept triton cash: [https://hdhtcas.ucsd.edu/accounts/triton-cash/discounts.html#on-campus-locations](https://hdhtcas.ucsd.edu/accounts/triton-cash/discounts.html#on-campus-locations)\n\nSome of the places don't accept Triton Cash in-person and instead accept Triton Cash through Grubhub: download the app, make account with your school email, click account &amp; select your campus dining as Ucsd to use for free\n\nTuesday Discounts: [https://www.instagram.com/p/DPydmNBjESi/?hl=en&amp;img\\_index=2](https://www.instagram.com/p/DPydmNBjESi/?hl=en&amp;img_index=2)\n\nThe following accepts Triton Cash in person:\n\nFan Fan Happy Hour (Mon-Fri, 2:30 pm - 5 pm):\n\n* 20% off\n* Food is pay-by-weight so it does get pricey (the milk tea is cheaper though)\n\nBurger King Whopper Wednesday (need to download BK app &amp; give offer code):\n\n* $3.99 Whopper/Impossible Whopper\n* You need to pay $0.80 more if you say yes to getting cheese\n* App price is cheaper, but can't pay triton cash through app (pay offer in-person)\n\nM.O.M.:\n\n* 50¢ off if you bring your own mug\n\nUCSD Bookstore (Fri.):\n\n* 10% off if you wear blue and gold Triton gear (you need to mention it to the cashier)\n* Check the link it see if the discount will apply: [https://www.ucsandiegobookstore.com/spirit-friday](https://www.ucsandiegobookstore.com/spirit-friday)\n\nPlz correct me if I typed incorrect info. &amp; feel free to add any more!"
    },
    {
        "title": "price center fire alarm 🙁",
        "author": "Silver_Fox_3682",
        "created_utc": 1761355999.0,
        "num_comments": 2,
        "score": 12,
        "permalink": "/r/UCSD/comments/1off6xq/price_center_fire_alarm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "🙁"
    },
    {
        "title": "Midterms and Loud Music",
        "author": "UCSDICK",
        "created_utc": 1761351824.0,
        "num_comments": 8,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ofdt7v/midterms_and_loud_music/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Do people not have midterms? People playing shitty loud music during midterms week is so rude. Does the RA enforce noise or who is that next option?"
    },
    {
        "title": "What happened",
        "author": "Foreign_Ad_6052",
        "created_utc": 1761349663.0,
        "num_comments": 5,
        "score": 46,
        "permalink": "/r/UCSD/comments/1ofd2pd/what_happened/",
        "image_url": "https://i.redd.it/is9pnsrsc5xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/S-dVqUCG2ikE8a5zLnxikRKK7SuNINSunJsDwdF1sPE.jpg",
        "body": "Outer lin"
    },
    {
        "title": "No calculators allowed?",
        "author": "Short_Desk_6748",
        "created_utc": 1761347924.0,
        "num_comments": 31,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ofcgs5/no_calculators_allowed/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Okay I know I’m dumb for being in math 2 but is it seriously necessary to not allow calculators in general but especially on the placement exam to move up? when is that ever going to be useful? There will never be a scenario in the real world where I won’t have access to a calculator. And calculators make sure all of your calculations are correct, I’m not using it to cheat it’s just to prevent simple miscalculations. I’m literally having to relearn handwritten methods of long division and multiplication which is making me go insane and I’m scared I’m going to be stuck taking this class again and not be able to graduate on time because of this. I’m spending so many hours a week on this class for no reason I’m literally just stressing about not being able to move up. Are all math classes like this where you can’t use a calculator?"
    },
    {
        "title": "missing singular airpod around muir",
        "author": "MathJazzlike7536",
        "created_utc": 1761344277.0,
        "num_comments": 6,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ofb4is/missing_singular_airpod_around_muir/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "probably lost iy forever but worth a shot to try to find it here"
    },
    {
        "title": "Anyone witness this? Sounds like the Price hallway curve gooner found a new way to be creepy",
        "author": "PhoGaPhoever",
        "created_utc": 1761342919.0,
        "num_comments": 0,
        "score": 7,
        "permalink": "/r/UCSD/comments/1ofam2e/anyone_witness_this_sounds_like_the_price_hallway/",
        "image_url": "https://i.redd.it/0yg1mphgs4xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/kc9AGNynU11qNdQSRLRwCNT7680ii7hz7TeNhx_DJKQ.jpg",
        "body": ""
    },
    {
        "title": "COGS 101A midterm",
        "author": "Slight_Excitement666",
        "created_utc": 1761340867.0,
        "num_comments": 15,
        "score": 12,
        "permalink": "/r/UCSD/comments/1of9t7y/cogs_101a_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "How did everyone do…."
    },
    {
        "title": "Title: Rideshare from Mira Mesa/Sorrento Valley to UCSD — happy to split costs",
        "author": "Relevant-Ant9829",
        "created_utc": 1761340723.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1of9r7q/title_rideshare_from_mira_mesasorrento_valley_to/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi everyone! I’m a grad student looking to carpool with someone commuting to UCSD from the Mira Mesa / Sorrento Valley area. I’m fully happy to split gas and parking. \n\nIf you’re interested or have a spot in your car, please DM or comment. Thanks!"
    },
    {
        "title": "aita for grabbing a guy’s bicycle handles to stop him from crashing straight into me and for cycling way too fast into an area where people are walking",
        "author": "risogrph",
        "created_utc": 1761340334.0,
        "num_comments": 12,
        "score": 94,
        "permalink": "/r/UCSD/comments/1of9llu/aita_for_grabbing_a_guys_bicycle_handles_to_stop/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "he saw me walking straight ahead with a few other girls behind me; he had just turned in and didn’t bother slowing down. i grabbed his bike to stop him because he was literally about to run me over and all he said was “my bad” 🖕🏼"
    },
    {
        "title": "Lost Debit Card",
        "author": "miss-moxi",
        "created_utc": 1761340052.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1of9hfh/lost_debit_card/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "If you have the initials E.C. and lost your debit card, I found it and turned it in at the Open Desk (Price Center floor 2). Good luck!"
    },
    {
        "title": "What to do?",
        "author": "Background-Part-3679",
        "created_utc": 1761339828.0,
        "num_comments": 27,
        "score": 268,
        "permalink": "/r/UCSD/comments/1of9e5u/what_to_do/",
        "image_url": "https://i.redd.it/8vhsvpvlj4xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/_Vz7wOlNorS2mgr2Ve8CHKqdS4Rc-7ldnOKdkaV8ALY.jpg",
        "body": "Any advice? I want to keep the class knowing I will do better on the next midterms and finals but still would like some input. "
    },
    {
        "title": "Rita Laundry",
        "author": "Nearby_Particular_99",
        "created_utc": 1761339222.0,
        "num_comments": 5,
        "score": 5,
        "permalink": "/r/UCSD/comments/1of95cf/rita_laundry/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi everyone,\n\nIve been trying to use my student ID to do my laundry on fourth floor on Rita but everytime I swipe it prompts me \"Card not valid.\" I got a temp card from the HDH office to do it in the mean time and that works fine. I went to the triton pay office to see if they could resolve it or get me a new card but they swiped in on their end and said there was nothing wrong but I tried again at rita and still prompted with the same message. My card works fine for getting into rita, my dorm, and in the dining halls but not for laundry. Its not the machine because others use it just fine with their ID. anyone have any advice because i shouldnt have to pay $25 to get a new card if it was faulty originally. "
    },
    {
        "title": "PSYC 122 Lecture Notes 10/23",
        "author": "Independent-Salad377",
        "created_utc": 1761338852.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1of8zu4/psyc_122_lecture_notes_1023/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi everyone!\n\nIf anyone has the lecture notes for this past Thursday's lecture and would be willing to share I'd really appreciate it! I was trying to watch the podcast but the audio cuts out about 20 mins in :("
    },
    {
        "title": "WHy feet?",
        "author": "Top_Acanthisitta154",
        "created_utc": 1761337807.0,
        "num_comments": 13,
        "score": 58,
        "permalink": "/r/UCSD/comments/1of8kj9/why_feet/",
        "image_url": "https://i.redd.it/r6p58j4gd4xf1.png",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/SQ3pcsNv0Bp8h6VstRuMqyeYGpFl3cwFjAd9Ikj0leI.jpg",
        "body": "I seen this at sixth and I just want to say why. I was wearing sandals and i see this and it made me super uncomfrotable"
    },
    {
        "title": "Scooter mfs when ur trying to get to class",
        "author": "gamersans89",
        "created_utc": 1761334685.0,
        "num_comments": 10,
        "score": 607,
        "permalink": "/r/UCSD/comments/1of79sb/scooter_mfs_when_ur_trying_to_get_to_class/",
        "image_url": "https://i.redd.it/afpscmdb44xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/AEDsNLdKwCGF_V-WoQMNifG2Wy7TVBgohlSl7gOJ_lk.jpg",
        "body": "i swear ive almost been hit like 5 different times I get theres no bike line in some areas but you dont gotta be going that fast 😭😭😭"
    },
    {
        "title": "parking enforcement",
        "author": "sofiaamm",
        "created_utc": 1761334606.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1of78l5/parking_enforcement/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "parking enforcement at gilman rn "
    },
    {
        "title": "To the three people in the scooter accident",
        "author": "Zealousideal-Sign584",
        "created_utc": 1761334135.0,
        "num_comments": 22,
        "score": 96,
        "permalink": "/r/UCSD/comments/1of71dz/to_the_three_people_in_the_scooter_accident/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I really hope you guys are ok. It looked pretty bad :( "
    },
    {
        "title": "UC ship grant",
        "author": "IndependentFit7512",
        "created_utc": 1761333693.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1of6um8/uc_ship_grant/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Got an email saying, “Financial aid awards have been revised to provide additional funding for the cost of UC Student Health Insurance Plan (SHIP).” Yall know how much this grant going to be? Is it like $500 like last year? "
    },
    {
        "title": "PhD in Bioinformatics & Systems Bio with a BMI Track vs Biomedical Sciences with a Concentration in Bioinformatics",
        "author": "starlight5784",
        "created_utc": 1761333646.0,
        "num_comments": 2,
        "score": 1,
        "permalink": "/r/UCSD/comments/1of6tx4/phd_in_bioinformatics_systems_bio_with_a_bmi/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "To give some context, I have a background in general biology (so courses covering biochem, ecology and evolution, molecular genetics, neurobiology, etc) and a minor in statistical science. I feel like my computing background is limited because I only took one programming in biology course run by the biology dept, not CS. I've taken Calc 1, 2, 3, linear algebra, differential equations, discrete math, and am currently doing statistics/probability theory. I have yet to take stochastic processes, but what I'm concerned about is that the UCSD bioinformatics PhD program (even the BMI track that I'm interested in) seems to be very CS-heavy and requires background in data structures and algorithms, which I don't have. However, I watched the 2023 admissions video and some of the students said that basic familiarity with CS is adequate, so if anyone has more insight, I'd appreciate it. \n\nAs of now, I'm not sure what I want to do for my career because at this point I'm open to anything, but I'm particularly interested in genetic epidemiology, analyzing a wide range of patient genetic and epidemiological data to improve medical treatments. Just wanted to put this out there for more context."
    },
    {
        "title": "BILD-5 CODING ASSIGNMENT 4 (Keefer)",
        "author": "Hengu_07",
        "created_utc": 1761333564.0,
        "num_comments": 2,
        "score": 3,
        "permalink": "/r/UCSD/comments/1of6slu/bild5_coding_assignment_4_keefer/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "HELPPP! \n\nI AM SO LOST FOR THE CODING ASSIGNMENT 4. Can anyone help me please???\n\nEven the first one I need help. Like desperately.   \nQuestion 1: The following data table (FirstTable) is one way to display the population estimate for two different years in three large Texas cities. Use the \\`pivot\\_longer()\\` function to assign to the SecondTable object a table with 3 columns and 6 rows. Hint, \\`names\\_to = \"Year\"\\` and \\`values\\_to = \"population\"\\`. For more hints look at the tidyr cheat sheet under \"Reshape Data\".\n\n\n\n\\`\\`\\`{r}\n\nFirstTable&lt;-read.csv(text= \"City,2014,2019\n\nSan Antonio,1436697,1547253\n\nHouston,2239558,2320268\n\nAustin,912791,978908\")\n\n\n\nhead(FirstTable)\n\n\n\n**SecondTable&lt;-pivot\\_longer(FirstTable,** \n\n**cols = c(2014, 2019),**   \n\n**names\\_to = \"Year\",**        \n\n**values\\_to = \"population\")** \n\n**(did I do that right? Why wont it workkkkkk)** \n\n\n\nhead(SecondTable)\n\n"
    },
    {
        "title": "Anyone else studying for the Nvidia Ignite OA.",
        "author": "Patient-Ad-6043",
        "created_utc": 1761332482.0,
        "num_comments": 4,
        "score": 1,
        "permalink": "/r/UCSD/comments/1of6c03/anyone_else_studying_for_the_nvidia_ignite_oa/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Looking for people to study with. \n\nEdit: this is for software \nI know the topics to study and the question bank of LCs for Nvidia. "
    },
    {
        "title": "How to take upper div CS as a Math-CS major?",
        "author": "Not-The-Dark-Lord-7",
        "created_utc": 1761331766.0,
        "num_comments": 4,
        "score": 4,
        "permalink": "/r/UCSD/comments/1of60u1/how_to_take_upper_div_cs_as_a_mathcs_major/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’ve been avoiding this until now because it seems like a pain, but I’d like to take one as an elective. What’s the process? You submit an EASY request for the class as soon as possible? And then just wait to be approved? But I’ve heard the approval process takes a while, you’ll usually get approved but it’ll only be after second pass. Which can screw you for high demand classes. When can you submit EASY requests for Winter quarter? "
    },
    {
        "title": "SomiSomi [New] Fundraiser",
        "author": "PatientPowerful2458",
        "created_utc": 1761331673.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1of5zex/somisomi_new_fundraiser/",
        "image_url": "https://i.redd.it/5gqigxxcv3xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/eBGxNu06QVIvK5B6ZjvD5dfCj1Q4MRjU9kyge2qJ7oc.jpg",
        "body": ""
    },
    {
        "title": "DJ for house party",
        "author": "Reasonable-Fig-3184",
        "created_utc": 1761330443.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1of5gii/dj_for_house_party/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hiii, I was wondering if anybody knows a dj for a Halloween house party on November 1st? Please feel free to pm me."
    },
    {
        "title": "Yogurt world",
        "author": "LyleJohnBelushi69",
        "created_utc": 1761327146.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1of41cd/yogurt_world/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Fundraisers today? "
    },
    {
        "title": "cse 30 midterm",
        "author": "Lumpy_Yellow4394",
        "created_utc": 1761326819.0,
        "num_comments": 4,
        "score": 15,
        "permalink": "/r/UCSD/comments/1of3w1p/cse_30_midterm/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/i6ZvHsPmIPueS7G4qaZ-CH8ASHYfg22jrtzDFBGczRM.jpg",
        "body": "🥀\n\nhttps://preview.redd.it/qbq29qdvg3xf1.png?width=202&amp;format=png&amp;auto=webp&amp;s=8c5952a4e1101f1cc9a61881596a2b5453ac97f1\n\n"
    },
    {
        "title": "Question about the Pronto app",
        "author": "PuddingInTheBag",
        "created_utc": 1761325012.0,
        "num_comments": 3,
        "score": 4,
        "permalink": "/r/UCSD/comments/1of33rc/question_about_the_pronto_app/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "So this might be a really stupid question, but I got the Triton U-Pass on the Pronto app and under the use tab it says “stored value $0.00.” Is that right? I know it didn’t cost anything to get, but I just wanna make sure I set it up correctly."
    },
    {
        "title": "Best bathrooms on campus? (For shitting, not masturbating)",
        "author": "Rofalls",
        "created_utc": 1761324605.0,
        "num_comments": 20,
        "score": 52,
        "permalink": "/r/UCSD/comments/1of2xc7/best_bathrooms_on_campus_for_shitting_not/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Title"
    },
    {
        "title": "Airsoft Club at UCSD",
        "author": "iwinrally23",
        "created_utc": 1761323909.0,
        "num_comments": 6,
        "score": 111,
        "permalink": "/r/UCSD/comments/1of2mgm/airsoft_club_at_ucsd/",
        "image_url": "https://i.redd.it/lgmo1vp283xf1.png",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/-JANK8e-v9z7BiQclmVGIqfX-Zs0VluOdGSDg11pAmo.jpg",
        "body": "we play with adult nerf guns, come join our discord if interested: [https://discord.gg/wBbWNnqJwe](https://discord.gg/wBbWNnqJwe)"
    },
    {
        "title": "Need help finding easy GE classes that still allow late adds 😭",
        "author": "Ok-Potential-2362",
        "created_utc": 1761323002.0,
        "num_comments": 0,
        "score": 7,
        "permalink": "/r/UCSD/comments/1of28j6/need_help_finding_easy_ge_classes_that_still/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey everyone,  \nI’m trying to find an easy GE or just a chill class I can still add late to help balance out my schedule.\n\nAnyone know of any **Seventh GE classes** (arts, humanities, social science, etc.) that professors are usually flexible about letting you **add in late**? Ideally something with light workload\n\nWould really appreciate any recommendations or tips"
    },
    {
        "title": "Taco Bell @ PC",
        "author": "MaterialNeither6329",
        "created_utc": 1761322763.0,
        "num_comments": 10,
        "score": 44,
        "permalink": "/r/UCSD/comments/1of24oq/taco_bell_pc/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "When is Taco Bell opening. It's been forever. Damn!!"
    },
    {
        "title": "To the girl who almost burned down M.O.M.'s",
        "author": "ddhusu",
        "created_utc": 1761320952.0,
        "num_comments": 18,
        "score": 268,
        "permalink": "/r/UCSD/comments/1of1c30/to_the_girl_who_almost_burned_down_moms/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Call me irrational for this rant, but if you're making popcorn, you probably shouldn't be making it in a public place. And if you're DO, please fucking watch over it and don't just microwave it using the popcorn option, because it always burns it. Each microwave is different, but I mainly found 2-2:30 minutes is usually the right amount of time to get decent popcorn.\nYou were like 10 ft away from the microwave, how the HELL did you not smell the burning kernel? If it wasn't for the two girls that opened the microwave, and the people who yelled,\"Whoever's microwaving popcorn, it burned!\" Then you wouldn't have fucking made your way over. The smell of plastic and kernels about to be in flames was so excruciatingly strong. I wasn't gonna post about this, but it still pissed me off how she didn't even apologize or own up to it or anything? The least you could've done was thank the two girls who told you about it? Or IDK wipe down the microwave??? Bro is trying to start a fire in the middle of campus 💀 💀"
    },
    {
        "title": "construction outside of Eighth college",
        "author": "FitYogurtcloset4245",
        "created_utc": 1761290551.0,
        "num_comments": 0,
        "score": 21,
        "permalink": "/r/UCSD/comments/1oer9z3/construction_outside_of_eighth_college/",
        "image_url": "https://i.redd.it/gih87403h0xf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/iZLrUEjJS1ZF6U7RZ-37smV99JkqXg-i3ZHoAc6n0dY.jpg",
        "body": "why the FUCK is there so much drilling outside of survivance at MIDNIGHT??? ts actually pmo im genuinely trying to count sheep to sleep. not only that but during midterm season too vro 🫩💔"
    },
    {
        "title": "Is there a discord for chem 100 A?",
        "author": "confusedpanda555",
        "created_utc": 1761289550.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oer109/is_there_a_discord_for_chem_100_a/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "The discord for chem 43A was very helpful so was wondering if there's one for 100A"
    },
    {
        "title": "Question for students with internships!!",
        "author": "chi-owow",
        "created_utc": 1761289387.0,
        "num_comments": 3,
        "score": 9,
        "permalink": "/r/UCSD/comments/1oeqzj5/question_for_students_with_internships/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Genuine question, how did you balance UCSD workloads with extracurricular time so you could build up a competitive resume? Are there any tips or hacks you utilized to create a proper balance for school and outside major-related activities? Also, any general tips for students in their later years (without internships yet) regarding this? \n"
    },
    {
        "title": "Math 20D Midterm",
        "author": "Lazy-Power-8031",
        "created_utc": 1761287342.0,
        "num_comments": 8,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oeqgyr/math_20d_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I feel like they should have made it harder\n\nWhat do you think?"
    },
    {
        "title": "how to study for cse 120",
        "author": "memphiseng",
        "created_utc": 1761285592.0,
        "num_comments": 4,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oeq0b3/how_to_study_for_cse_120/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "THIS SHIT SO FKN HARDDDDD\n\nif you’re a pro pls lmk"
    },
    {
        "title": "UCSD x UC Minecraft Community – Crossplay & Survival 🎮",
        "author": "One_Block_4596",
        "created_utc": 1761278267.0,
        "num_comments": 3,
        "score": 11,
        "permalink": "/r/UCSD/comments/1oenxcq/ucsd_x_uc_minecraft_community_crossplay_survival/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "🎮 **Minecraft Server – Crossplay!**  \n⚡ **Vanilla – no mods, just pure Minecraft**  \n⏰ **Online 24/7 – hop in anytime!**  \n🤝 **Build, explore, and play with a friendly community**\n\nOriginally created by **UC San Diego** and **UC Davis** students for chill survival fun — now open to **U**CSD and other UC players too!\n\nEveryone’s welcome to build, explore, or just hang out together.\n\n📍 **Server info &amp; Discord link are in the comments below! 👇**"
    },
    {
        "title": "Scripps Pier, majestic as always",
        "author": "T0DEtheELEVATED",
        "created_utc": 1761277848.0,
        "num_comments": 3,
        "score": 159,
        "permalink": "/r/UCSD/comments/1oenstx/scripps_pier_majestic_as_always/",
        "image_url": "https://i.redd.it/gsca6e4bfzwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/mqzUqgiZP8oDVprhK8stjhITODxd337xo01uYBY2OqQ.jpg",
        "body": ""
    },
    {
        "title": "Wepa printers",
        "author": "Traditional_Editor95",
        "created_utc": 1761274872.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oemuld/wepa_printers/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone know if the printers by sixth are still working or is it closed already? I need to print something for my morning class tomorrow "
    },
    {
        "title": "Phil 128 midterm",
        "author": "parisianraven",
        "created_utc": 1761274637.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oemrru/phil_128_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "With prof callendar\nI couldn’t attend the last 2 classes due to ill health and the syllabus doesn’t say much about the midterm. Does anyone know how it’s gonna work? Is it an essay? Is the prompt already uploaded on canvas or something?"
    },
    {
        "title": "any advice for the new cse30 exams",
        "author": "_just_kinda_soso_",
        "created_utc": 1761274288.0,
        "num_comments": 5,
        "score": 5,
        "permalink": "/r/UCSD/comments/1oemnrm/any_advice_for_the_new_cse30_exams/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "basically the title. \n\nno one I know that has taken 30 took the new version and now I'm panicking for tomorrow's midterm. The class being 25% for midterm 1, 25% for midterm 2, and 50% for the final is stressing me out like crazy. the fact that the test is fully open note, book, etc. is also scary cause does this mean that this test is like impossible. anyways, yeah, if anyone's taken the new version of CSE30 pls drop advice/reassurances/warnings. "
    },
    {
        "title": "Where to get Japanese peanuts",
        "author": "Substantial-Grab1130",
        "created_utc": 1761273725.0,
        "num_comments": 6,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oemh3o/where_to_get_japanese_peanuts/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I am in the search for Japanese peanuts so I can make some Tostilocos. I checked 6th market and Target but I did not find any. Is there any place on campus or nearby that sells them? Thanks in advance! "
    },
    {
        "title": "Going to Peterson Hall",
        "author": "ReeARat",
        "created_utc": 1761273658.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oemgbl/going_to_peterson_hall/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Midterm is in there, going to see if the seats are actually that small."
    },
    {
        "title": "advice for biotech applicant?",
        "author": "Disastrous-Back-6038",
        "created_utc": 1761272962.0,
        "num_comments": 3,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oem7s0/advice_for_biotech_applicant/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi everyone, I'm a sophomore (Class of 2028) in high school who wants to go into biotech, and UCSD is my dream school. If I somehow manage to get in, I hope to pursue a Master's degree in biotech. I know biotech is competitive and UCSD is already a selective school, so I was hoping for some advice from current students on what I can do further. I'm from the Bay Area, of Indian ethnicity, and I go to an INSANELY competitive high school. These are my **projected** stats:\n\nMajor: Biotechnology / Bioengineering / Biology or something adjacent  \nGPA: 3.93 - 3.94  \nAPs: 7-9 (school offers over 30)  \nHonors: 2  \nSAT: \\~1450 (being optimistic here, but I know they don't count it anyway)  \nLanguages: English, Bengali/Bangla (native language), French, &amp; Hindi (can only understand/speak a little)\n\nExtracurriculars/Awards:  \nWrote &amp; published a trilogy of historical fiction novellas  \nPresident &amp; Founder of a Bengali Student Association, organized events (ethnic club) (2 years)  \nVice President of an Emergency Responders Club (3 years)  \nOfficer of a Conservation Club (1 year)  \nScience Olympiad member &amp; hopefully won some awards, in environmental and genetic categories (3 years)  \nModel UN member &amp; hopefully won some awards (3 years)  \nWon gold medal at the National French Grand Concours for 4 years in a row  \nPublished a short story in a literary magazine  \nFounder &amp; Editor-in-Chief of a STEM Magazine with a global panel of editors (3 years)  \nInterned at a biotech company (3 years)  \nCommunity service through the California Scholarship Federation (3 years)  \nRanked at the county Science &amp; Engineering Fair  \nContent moderator for a wiki fandom website with measurable impact (6+ years)\n\nI have a fairly unique essay idea (at least I believe I do...)"
    },
    {
        "title": "Lost Skull Ring Today in HSS 1315 or HSS area",
        "author": "TechnicalHunt1656",
        "created_utc": 1761271316.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oelo5m/lost_skull_ring_today_in_hss_1315_or_hss_area/",
        "image_url": "https://i.redd.it/ij12auiwrywf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/ACJwTE4yQbSbFZGsv4sUrQrfHgJvuvVPOU7E577cxy8.jpg",
        "body": "Lost this ring today, if you found it please reply/ PM me"
    },
    {
        "title": "Phew",
        "author": "whyn0tL01",
        "created_utc": 1761269714.0,
        "num_comments": 8,
        "score": 70,
        "permalink": "/r/UCSD/comments/1oel4qr/phew/",
        "image_url": "https://i.redd.it/acqwy4h4rywf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/8GdN0NbZh8Up2oCaHuSMcj86TCtLfDNEqowt8WfJ4X4.jpg",
        "body": "At least the school gave us a word of it possibly being a mistake. I might still go to the financial aid office this Friday though. "
    },
    {
        "title": "Who’s with me? 🙃",
        "author": "xxTonyTonyxx",
        "created_utc": 1761268325.0,
        "num_comments": 1,
        "score": 42,
        "permalink": "/r/UCSD/comments/1oeko54/whos_with_me/",
        "image_url": "https://i.redd.it/ofa0qopzmywf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/JSpeOnBmWK8AEo8Mrp_FUELtMNuY0Z5yaQ-yknRgfrQ.jpg",
        "body": ""
    },
    {
        "title": "About abortion",
        "author": "[deleted]",
        "created_utc": 1761267098.0,
        "num_comments": 10,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oek9ct/about_abortion/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I can understand that in certain circumstances women need to have an abortion because it could affect them in different ways like literally did, or maybe they were forced to. However, if it’s just because you don’t want to be responsible, don’t have money, you lack the support, “ I am too young” then DONT FUCKING HAVE SEX!! LIKE DAMN YALL ARE BUNCH OF IDIOTS. Play stupid games, win stupid prizes. Don’t have sex and blame it on the society for trying to “ruin”your life. YOU MADE THE DAMN DECISION.  "
    },
    {
        "title": "Anyones research lab have a cryostat I can use for about 1 hour?",
        "author": "Five0clocksomewhere",
        "created_utc": 1761266909.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oek73b/anyones_research_lab_have_a_cryostat_i_can_use/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "seriously, help.\n\nWilling to trade (decade+) of histology expertise and do your staining and imaging for you, provide consumables, or even let you bill us with a PO in exchange for letting me have 45 MINUTES on a cryostat. \n\nPls help \n\n  \nAlso........ are there like, listservs for departments, buildings, researchers at UCSD? \n\nEx. email listserv \"PFB Bioengineering hall labs @ email. edu\" to send an email to all the labs in PFB?\n\nI feel like this should be a thing but I can't find anything......"
    },
    {
        "title": "Should I transfer?",
        "author": "AppropriateEnergy571",
        "created_utc": 1761266640.0,
        "num_comments": 3,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oek3ti/should_i_transfer/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hello! I am a current second-year biology student from out of state, and with the current administration changing the parent plus loans, I can no longer afford to go to school here. My options include transferring back home, getting a job, and trying to make enough before next fall so I can lower tuition to an amount my parents can afford; or praying I get scholarships for my junior year. I love this school, and I worked really hard to get here and don't want to leave. This school is way better for my major compared to the schools back home. Any advice is welcome; I am truly stuck on what the best choice is. "
    },
    {
        "title": "Rip da good eats mane 💔🕴️🥀",
        "author": "SozinsComet1",
        "created_utc": 1761264769.0,
        "num_comments": 7,
        "score": 104,
        "permalink": "/r/UCSD/comments/1oejgye/rip_da_good_eats_mane/",
        "image_url": "https://i.redd.it/w6uh9r1fcywf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/1_V5HsOfAv9d0Y2lGrYM8squQXw9scRgRLwSwPnJdvY.jpg",
        "body": ""
    },
    {
        "title": "Any creatives out there looking to connect?",
        "author": "Altruistic_Ad7398",
        "created_utc": 1761262953.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oeitpr/any_creatives_out_there_looking_to_connect/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I have a MPC 3000 I’ve been trying to get the hang of. If anyone has experience with that or a DAW hmu. Trying to network with new people around here and create something. Pm me if interested. "
    },
    {
        "title": "working in class",
        "author": "rensheart",
        "created_utc": 1761262886.0,
        "num_comments": 17,
        "score": 24,
        "permalink": "/r/UCSD/comments/1oeisvl/working_in_class/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Let me say i admire the vast majority of my peer students because everyone is so hardworking and cool 😊😊^_^ Forreally…. \n\nBUT I’m so bewildered by Some people…  ion know why some people go to class just to be on their computer working for another class the entire time.. especially when attendance isn’t mandatory❣️ Everyone’s different but who are we helping here… While not paying attention you might as well Have stayed in bed….❣️ \n\nAlso ChatGPT use gone insaneeeeeee get off that shit use yr fucking mind😭😭😭😓😓😓using chat for simple arithmetic substitution limits is funny!!! (I’m not good at math either..) And in discussions when people don’t have ideas abt the content i seen them ask chat gpt for a Thought???? How did we get here????? Talk to someone else, maybe the person sitting next to you… \n\nI’m not even uptight academically like that i smoke weed all day and I have no talents or aspirations myself but DAMNNNNNNN yall really play games like that….😭"
    },
    {
        "title": "GSRs and ASEs...how much parental leave did you get?",
        "author": "Historical-Tower7226",
        "created_utc": 1761262674.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oeiq65/gsrs_and_aseshow_much_parental_leave_did_you_get/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "The union contract language is quite vague. I've pasted the language in the contract related to parental leave. My university says I get 8 weeks total because the qualifying event is the birth. The union claims its not one leave per birth. They say that I am eligible for 8 weeks of leave in consecutive academic years for the same birth as long as I am taking leave to care for a child who is less than 12 months old.\n\nI am curious...\n\na) how much parental leave did you get as an ASE or GSR if you took leave since 2022?\n\nb) how do you interpret the wording in the contract?\n\n**D. LONG-TERM LEAVE**\n\n1. Leave Eligibility  \nSalaried ASEs who take a leave pursuant to Section D.2 shall be eligible for up to eight (8) weeks of paid leave per academic year.\n\n2. Upon request from an ASE and subject to the provisions of this Article, the University will grant an ASE’s reasonable request for long-term leave due to:\n\nb. To care for and bond with the newborn child or a child placed with the ASE for adoption or foster care, provided that the leave is taken within twelve months of the birth or placement of the child with the ASE"
    },
    {
        "title": "Who wants to argue",
        "author": "Junior-Insurance1605",
        "created_utc": 1761262643.0,
        "num_comments": 34,
        "score": 61,
        "permalink": "/r/UCSD/comments/1oeiprw/who_wants_to_argue/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Fuck all of y’all im pissed right now"
    },
    {
        "title": "Free drink up for grabs",
        "author": "Ok-Aide3799",
        "created_utc": 1761261783.0,
        "num_comments": 0,
        "score": 8,
        "permalink": "/r/UCSD/comments/1oeiejy/free_drink_up_for_grabs/",
        "image_url": "https://i.redd.it/cqfhm9gj3ywf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/PJNBcRMgSKG1oEMgIdQPCwi2ID9Ow8OfE_XYBSUlbXY.jpg",
        "body": ""
    },
    {
        "title": "beautiful unused looking bike at muir",
        "author": "byakuwa",
        "created_utc": 1761261306.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oei8bj/beautiful_unused_looking_bike_at_muir/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "at tuolomne i see this bike. it is beautiful, it is aqua blue with a compass under the seat. its so beautiful. but i dont really see it being used. i will give you $100 for it. whoever it may be. if you want. i hope this can reach the bike person. "
    },
    {
        "title": "Please stay the fuck home or wear a mask 😭",
        "author": "slavicgirl69",
        "created_utc": 1761260441.0,
        "num_comments": 17,
        "score": 69,
        "permalink": "/r/UCSD/comments/1oehwwu/please_stay_the_fuck_home_or_wear_a_mask/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I can't sit through a single class or go to a dining hall or study in a study room without hearing at least three different people coughing like hell. I'm not afraid of getting sick or anything, it happens, but it's just gross and I'd rather avoid getting sick. I get going to class is important but I promise your profs will understand if you miss two classes due to sickness and many classes are podcast :/ it's astonishing how many people here can't grasp this"
    },
    {
        "title": "best dining hall food?",
        "author": "gasstationpie",
        "created_utc": 1761260012.0,
        "num_comments": 14,
        "score": 15,
        "permalink": "/r/UCSD/comments/1oehr57/best_dining_hall_food/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I swear i keep eating nasty shit"
    },
    {
        "title": "Yogurt world fundraiser today!!",
        "author": "BusWeird3090",
        "created_utc": 1761259674.0,
        "num_comments": 1,
        "score": 7,
        "permalink": "/r/UCSD/comments/1oehmhx/yogurt_world_fundraiser_today/",
        "image_url": "https://i.redd.it/mvy85wo9xxwf1.png",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/P-ofuWftPVT920iIhvZfXFTVX_wKkfevicaYjOh6E8c.jpg",
        "body": "From 11am-9pm!!"
    },
    {
        "title": "I hate CSE 150A",
        "author": "BubblewrapFerret",
        "created_utc": 1761258433.0,
        "num_comments": 2,
        "score": 11,
        "permalink": "/r/UCSD/comments/1oeh5m9/i_hate_cse_150a/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I hate CSE 150A"
    },
    {
        "title": "Pimple Popping",
        "author": "alaskandaisies",
        "created_utc": 1761258406.0,
        "num_comments": 3,
        "score": 5,
        "permalink": "/r/UCSD/comments/1oeh58j/pimple_popping/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/Z2zJUFmWbUYcKzBL0tFmgaOy_5fK00Sf_8GNJwCg7ZE.jpg",
        "body": "why are we popping multiple pimples mid-lecture??\n\nhttps://preview.redd.it/zh5vmnsctxwf1.jpg?width=247&amp;format=pjpg&amp;auto=webp&amp;s=e5ed6933a8b5ae2659b26ae494fa4256d7789726\n\n"
    },
    {
        "title": "airpod case",
        "author": "yourlocal_spidey",
        "created_utc": 1761258208.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oeh2l2/airpod_case/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "last i saw it was earlier in the morning near the triton pantry it looks like a milk tea boba pls tell me if you see it around"
    },
    {
        "title": "Are the water dispensers in campus clean enough to drink",
        "author": "Foreign_Ad_6052",
        "created_utc": 1761258122.0,
        "num_comments": 16,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oeh1ed/are_the_water_dispensers_in_campus_clean_enough/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I really wanna know are the water from dispensers in campus really clean enough to drink?\nWhy the waster always has the taste of rust? Some water dispensers shows how many bottle is saved in total, I guess it means how long the filter hasn’t been changed🤣"
    },
    {
        "title": "Can you guys please fill out a short questionnaire for an essay I'm writing?",
        "author": "Fire-Eyed",
        "created_utc": 1761255949.0,
        "num_comments": 2,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oeg6na/can_you_guys_please_fill_out_a_short/",
        "image_url": "https://external-preview.redd.it/UKWAhE32VJOA9mtDufT5U2zdEfkifdrq0PIFCVa_pEU.png?auto=webp&s=434a8fb2f985e9245e9ac1c34d5bdafdae1b368d",
        "thumbnail_url": "https://external-preview.redd.it/UKWAhE32VJOA9mtDufT5U2zdEfkifdrq0PIFCVa_pEU.png?width=140&height=73&auto=webp&s=5acccb5b934e6f4a60c36ce016a1850b246786f0",
        "body": "For part of my essay for SYN 2 I'm \"interviewing\" people on how art/storytelling may have had an impact on their understanding of a specific or several environmental issues. I'd really appreciate if you guys could fill it out so I can incorporate first-hand accounts in it!"
    },
    {
        "title": "UCSD protest?",
        "author": "Hot_Beautiful_6207",
        "created_utc": 1761255478.0,
        "num_comments": 4,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oefzwd/ucsd_protest/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anyone in the library or near? What’s all that noise of people yelling? It sounds like a large protest but I have no idea where it’s coming from. It definitely sounds like it’s outside."
    },
    {
        "title": "Friends (URGENT)",
        "author": "Gold-Performance-570",
        "created_utc": 1761255185.0,
        "num_comments": 21,
        "score": 12,
        "permalink": "/r/UCSD/comments/1oefvld/friends_urgent/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hii, I am a first year at UCSD and I am desperately looking for friends facts abt me:\nLove the beach\nGym\n(I’m a female)\nI enjoy studying w people\nJust lmk, I’m lonely…"
    },
    {
        "title": "Can I buy an Apple Pencil tip anywhere on campus?",
        "author": "Odd-Salary-8810",
        "created_utc": 1761254719.0,
        "num_comments": 2,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oeforp/can_i_buy_an_apple_pencil_tip_anywhere_on_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Is there anywhere that sells these? Just dropped my pencil in Geisel (the tip got dented) need one desperately 🕺🕺🗿"
    },
    {
        "title": "Anyone wanna visit balboa park this weekend?",
        "author": "LilNilx",
        "created_utc": 1761254122.0,
        "num_comments": 4,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oeffx2/anyone_wanna_visit_balboa_park_this_weekend/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm planning on visiting the art museums and installations. no museums specifically in mind so I'm flexible. dm me to join!"
    },
    {
        "title": "wok 64 system always down",
        "author": "parisianraven",
        "created_utc": 1761253936.0,
        "num_comments": 1,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oefd7a/wok_64_system_always_down/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "wtf is up with the system at wok?? i swear it’s always down. they take 1+ hours to make orders cause they have to do it manually as the system breaks down all the time. "
    },
    {
        "title": "lost id card",
        "author": "jujubit6",
        "created_utc": 1761253920.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oefcz0/lost_id_card/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "If anybody finds a lost student id card that has a picture of a girl with wavy brownish blonde hair. My initials should be J.F.T can you please let me know. I believe it fell out of my pocket around 6th college. Lol"
    },
    {
        "title": "Cse bs/ms application response",
        "author": "Interesting_Cod4477",
        "created_utc": 1761251272.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oee7x5/cse_bsms_application_response/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I applied for the program back in June/july to start fall 26. On the website it says that they’ll notify me in November. Anyone know around when they release decisions? That’ll kinda decide for me whether I graduate early or not. Thx! "
    },
    {
        "title": "Psych-100 12:30 class…",
        "author": "Intelligent-Fall5912",
        "created_utc": 1761250760.0,
        "num_comments": 8,
        "score": 36,
        "permalink": "/r/UCSD/comments/1oedzui/psych100_1230_class/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "\nTo the people in psych-100… I understand that questions may arise during this extremely interesting class that delves into mental health, along with ways to diagnose disorders, among many other concepts. Please shut the actual fuck and stop asking the professor questions that obviously will not come up on a test. We all know you’re trying to be performative intellectuals by asking this irrelevant ass questions. You ask the professor these questions and waste so much time— it’s so fucking annoying. To the people that also raise their hands to ask the professor “fun fact” questions that don’t regard anything that would come up on a test, LOOK IT UP ON GOOGLE IF YOU WANT TO KNOW. So much valuable lecture time goes into her answering questions by these buffoons. "
    },
    {
        "title": "Vendor Fair",
        "author": "According-Jump9643",
        "created_utc": 1761250638.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oedxuv/vendor_fair/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone know what time vendor fair ends everyday"
    },
    {
        "title": "Can we kill ditto AI (they have infected this campus like a plague)",
        "author": "gamersans89",
        "created_utc": 1761247416.0,
        "num_comments": 17,
        "score": 317,
        "permalink": "/r/UCSD/comments/1oecjof/can_we_kill_ditto_ai_they_have_infected_this/",
        "image_url": "https://i.redd.it/keevcaarwwwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/FeGKkfjj60N2MoErkDfVVLFEw0x6dZW502vf-UJrjrI.jpg",
        "body": ""
    },
    {
        "title": "dawg",
        "author": "Popular-Secretary-48",
        "created_utc": 1761246713.0,
        "num_comments": 117,
        "score": 663,
        "permalink": "/r/UCSD/comments/1oec8rh/dawg/",
        "image_url": "https://external-preview.redd.it/aXJxNHVoNXB1d3dmMWC8SBe7w77KgDbHHtAW2nnhanRqIGm2ipOTQsDVZyZY.png?format=pjpg&auto=webp&s=5432903fb20c6e426d4287025df6160d0957af8d",
        "thumbnail_url": "https://external-preview.redd.it/aXJxNHVoNXB1d3dmMWC8SBe7w77KgDbHHtAW2nnhanRqIGm2ipOTQsDVZyZY.png?width=140&height=140&format=jpg&auto=webp&s=edf8c639a46d771bed6cd463096b4256ae41301e",
        "body": "what just happened dawg"
    },
    {
        "title": "Tabletop RPG Club (Dungeons & Dragons) on Campus",
        "author": "Januscide",
        "created_utc": 1761246604.0,
        "num_comments": 0,
        "score": 12,
        "permalink": "/r/UCSD/comments/1oec74j/tabletop_rpg_club_dungeons_dragons_on_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Our club has existed at UCSD since the 70s/80s (was originally war gaming) and I figured that there’s not a great central way to find us. If you’re a fan of Tabletop Role Playing Games like D&amp;D then come check us out! We have GBMs every quarter where you can join one-shots or longer campaigns in a showcase format. Come check us out if you’re interested! (We also do West Marches which is an MMORPG style campaign)\n\nDiscord: https://discord.gg/btYtyDdY"
    },
    {
        "title": "Need a study break or crave ice cream? Get SomiSomi today!!",
        "author": "TakenCookies",
        "created_utc": 1761245310.0,
        "num_comments": 0,
        "score": 9,
        "permalink": "/r/UCSD/comments/1oebmb4/need_a_study_break_or_crave_ice_cream_get/",
        "image_url": "https://i.redd.it/mf2a49lxpwwf1.png",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/9k1VmZYLybKwI2Z29iXHrvEpKBZ6KmLMTYflvHnK0FY.jpg",
        "body": "If you are planning to get SomiSomi today, please use this flyer to help us fundraise!!"
    },
    {
        "title": "Ucsd admission help please",
        "author": "GeologistNo8486",
        "created_utc": 1761243388.0,
        "num_comments": 6,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oeas9x/ucsd_admission_help_please/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I don’t know if this is the right placr for this i guess but i want to see if anyone can help me. Ok so i want to go to ucsd for neuroscience and do stuff at ucsd because i think it looks world class. Although i live around 2500+ miles away, and i dont know if my uc gpa is competitive for ucsd, like if i have a good chance. I dont want to lose sleep over ucsd if i have a bad chance and i can just ED somewhere else. Im scared about the gpa which is a UC unweighted 3.63, weighted capped 3.96, weighted uncapped 4.13. To anyone who wants to or can help me please do, it is stressful to me thinking about having ucsd be a top choice if i have a low chance of getting in."
    },
    {
        "title": "Once someone gets infected, everyone does",
        "author": "ThatsCrazy312",
        "created_utc": 1761243073.0,
        "num_comments": 18,
        "score": 43,
        "permalink": "/r/UCSD/comments/1oeand8/once_someone_gets_infected_everyone_does/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "IYKYK  \n\\#fluseason"
    },
    {
        "title": "Rank Bathrooms 👃",
        "author": "Miserable-Stable1965",
        "created_utc": 1761242940.0,
        "num_comments": 3,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oeal7v/rank_bathrooms/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’ve experienced some rank-smelling bathrooms (NYC native) but the women’s restroom sandwiched between Ridgewalk Social and Shake Smart is one of the worst. This is not a temporary rankiness; it’s permanent. Is it #1? Not sure. Anyone else have a contender ?"
    },
    {
        "title": "pro life groups on campus",
        "author": "YNGLUVZ-",
        "created_utc": 1761241673.0,
        "num_comments": 98,
        "score": 149,
        "permalink": "/r/UCSD/comments/1oea0sj/pro_life_groups_on_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i was walking out of center hall and caught two girls who are wearing pro life shirts and handing out pamphlets that promote how abortion is bad\n\npls keep and eye out lol. and of course #abortionishealthcare "
    },
    {
        "title": "hey guys I took a photo in Muir today, do I look good",
        "author": "FixSharp2421",
        "created_utc": 1761240436.0,
        "num_comments": 3,
        "score": 35,
        "permalink": "/r/UCSD/comments/1oe9h9p/hey_guys_i_took_a_photo_in_muir_today_do_i_look/",
        "image_url": "https://i.redd.it/li6ma45tbwwf1.png",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/ufSG6Hyn7wKC6iwX5d_TVpnpQyby0ZYEChlWM5Ytrcc.jpg",
        "body": "this is such a cool photo after I got my coffee from M.O.M.s. I made sure to take it by the ominous concrete building"
    },
    {
        "title": "Omg",
        "author": "Fawnsk1n",
        "created_utc": 1761239745.0,
        "num_comments": 32,
        "score": 270,
        "permalink": "/r/UCSD/comments/1oe962y/omg/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Y'all I've been sick for 5 days and been trying to fight it and staying home but on day 4 I went to the student health center and the doctor (not nurse)said my body would just fight it and I'm good to go and just stay home. I felt worse the night of and like a day later and decided to get a second opinion and went to the urgent care near that gas station near ucsd (sorry I'm geographically challenged). They told me I should go to the emergency room. 😀ok. Went to the emergency room, found out I had sepsis/pnemonia and I had to stay overnight yesterday. 😀anyway so cooked for midterms"
    },
    {
        "title": "Missing Wallet",
        "author": "Ok_Mud_1042",
        "created_utc": 1761238798.0,
        "num_comments": 1,
        "score": 6,
        "permalink": "/r/UCSD/comments/1oe8qvg/missing_wallet/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "update: it was found ty!!!!!\n\nHey guys! so I was running from PCE to Rady today at like 8 am because I was late for a quiz and I think my wallet fell out of my backpack somewhere along the way 😭 i went through warren and franklin antonio to get there…\n\n\n\n"
    },
    {
        "title": "Ever find yourself spiraling after a small mistake? We’re studying emotional regulation in Asian women—help us out 💛",
        "author": "greenmfbeans",
        "created_utc": 1761237945.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oe8dbl/ever_find_yourself_spiraling_after_a_small/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi everyone! My classmate and I are running a short research survey at UC San Diego on how Asian women (West, South, East, and Central) manage emotions like stress or frustration in higher education. \n\nIt takes about 5 minutes, is completely anonymous, and your responses will help us understand emotional regulation and mental wellbeing in our community.\n\nHere’s the link: [https://ucsd.co1.qualtrics.com/jfe/form/SV\\_9nwuUHQ0FPCYuUu]()\n\nThank you!"
    },
    {
        "title": "Math tutor available",
        "author": "More_Persimmon1823",
        "created_utc": 1761235989.0,
        "num_comments": 0,
        "score": 7,
        "permalink": "/r/UCSD/comments/1oe7imr/math_tutor_available/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi everyone. I’m a math major with a strong passion for teaching. I have tutored many students over the years, and learned a great deal. \n\nAs we reach the middle of the quarter, it’s a great time to reflect on where you might be struggling and get some extra support. I’m available for one-on-one tutoring should you need it, both in person and over Zoom. \n\nI can tutor Math 3, 10, 18, 20, and other lower-division classes, as well as Math 103, 109, 140, 142, 170, 180, and other upper-division classes. \n\nFeel free to DM for availability and other details. "
    },
    {
        "title": "⚠️ Safety Alert — Suspicious Person Near La Jolla Village (US Bank / Urban Plates Area)",
        "author": "Late-Ad-3076",
        "created_utc": 1761232593.0,
        "num_comments": 13,
        "score": 89,
        "permalink": "/r/UCSD/comments/1oe60ft/safety_alert_suspicious_person_near_la_jolla/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey everyone,\nJust wanted to share something I saw this morning around 7:30 AM near the US Bank ATM in La Jolla Village.\n\nThere was a guy dressed in all black, wearing a Scream mask, carrying a backpack, skateboard, and what looked like steel cables. He walked into the Urban Plates patio, which is closed until 11 AM. The whole thing felt really off — especially at that hour.\n\nThis isn’t the first time I’ve seen him around. The last time was around 10:30 PM near Ralphs in the same area. He was wearing the same outfit and mask, with both hands in his pockets, walking between cars and hiding behind them like he was trying not to be seen. It really creeped me out.\n\nI just want to remind everyone — especially students and people walking alone — to stay aware of your surroundings. We’ve all heard about the recent incident with a man in a lion mask at La Jolla Shores attacking someone, so please be careful out there.\n\nStay safe, everyone.\n"
    },
    {
        "title": "Eighth survivance",
        "author": "Hot_Beautiful_6207",
        "created_utc": 1761217905.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oe0fta/eighth_survivance/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Is that the fire alarm that keeps going off?? I just woke up multiple times from that during my sleep. It’s 4:10am rn. Cmon man ."
    },
    {
        "title": "Drop for not meeting prereq",
        "author": "Still_Bed_4531",
        "created_utc": 1761210456.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1odyeo1/drop_for_not_meeting_prereq/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "When do they drop people for not meeting a prereq for a class you are currently taking? "
    },
    {
        "title": "Looking for best friends!!",
        "author": "j_sully_",
        "created_utc": 1761202972.0,
        "num_comments": 37,
        "score": 14,
        "permalink": "/r/UCSD/comments/1odwivc/looking_for_best_friends/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "For context, I’m a girl looking for girlfriends who wanna have fun. I’m talking about girlies who want to make cringey TikToks, take outfit pics, do makeup, go to concerts, and want to hangout!! I’m an introvert but I love listening to people yap about their interests and will open up once I get comfortable.\n\ncomment and I’ll dm you! "
    },
    {
        "title": "Can i get accepted to an easY request for DSC40A?",
        "author": "KamaIaHarriss",
        "created_utc": 1761202936.0,
        "num_comments": 1,
        "score": 5,
        "permalink": "/r/UCSD/comments/1odwiiq/can_i_get_accepted_to_an_easy_request_for_dsc40a/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Next quarter I should be takign DSC40A but i got waitlisted for a math class so now im 2 math classes behind and one of the requirements is to take math 20c which i will be taking next quarter. Is it possible to submit an easy request and possibly get accepted to the class if im taking the pre req at the same time? "
    },
    {
        "title": "Looking for aerospace advice",
        "author": "Desperate-Ad-6500",
        "created_utc": 1761200529.0,
        "num_comments": 2,
        "score": 7,
        "permalink": "/r/UCSD/comments/1odvw7a/looking_for_aerospace_advice/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm a second year aerospace engineering major and I'm feeling really lost. My gpa is horrendous (2.7) and I'm retaking phys 2A for literally the third time and still struggling pretty hard. The only thing that's kind of okay for my situation is that I'm on course for math (taking math 20D) so I'm only really behind on phys. If it helps for context I just recently got diagnosed with ADHD and hopefully will be able to get disability accommodations by next quarter. Is it over for me and should I switch or just try to lock in like crazy esp w/ the added accommodations? I really am passionate about this field and want to finish the degree but I honestly don't even know if I'll be able to make it."
    },
    {
        "title": "Guys handing out roses by sungod lawn",
        "author": "-Lana-Banana-Asylum-",
        "created_utc": 1761199996.0,
        "num_comments": 5,
        "score": 15,
        "permalink": "/r/UCSD/comments/1odvr3r/guys_handing_out_roses_by_sungod_lawn/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "These two guys holding a bouquet approached me earlier around like ten ish and asked if I wanted a rose but I said yes but now im paranoid it’s like a frat prank or something 😭 anyone know?"
    },
    {
        "title": "Somi Somi Fundraiser!",
        "author": "jellybeaniesss",
        "created_utc": 1761199369.0,
        "num_comments": 0,
        "score": 9,
        "permalink": "/r/UCSD/comments/1odvl4y/somi_somi_fundraiser/",
        "image_url": "https://i.redd.it/6hgyc1ayxswf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/2Pvwk58HHLIv7npQrQeD8NR2WvJAIRtOmB8NRnzJWjI.jpg",
        "body": "If you guys are planning on going to Somi Somi on Thursday 10/23, please use this flyer to help us fundraise! "
    },
    {
        "title": "Revelle Block",
        "author": "Intrepid-Factor5321",
        "created_utc": 1761198985.0,
        "num_comments": 1,
        "score": 20,
        "permalink": "/r/UCSD/comments/1odvha9/revelle_block/",
        "image_url": "https://i.redd.it/s3bt3n3twswf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/1DCq9NDOiSwEv4UxD-5Kv-i6Z3LJy_D911vbY_Jy0o0.jpg",
        "body": ""
    },
    {
        "title": "struggling with finding friends",
        "author": "Existing_Stranger615",
        "created_utc": 1761196144.0,
        "num_comments": 11,
        "score": 10,
        "permalink": "/r/UCSD/comments/1oduoyd/struggling_with_finding_friends/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi hello i’m a third year transfer looking for friends/hangout opportunities! i’d love to find lifelong college friends even though i’m a little late to the game :,)\n\ni struggle a bit with socializing in person so a preemptive apology for that! i love drawing/creating and long walks + talks, but since it’s ucsd i recognize we’ll probably have a bunch of study session hangouts that i desperately need tbh. \n\nif anyone (especially fellow transfer students) would like to meet up please send a message!\n\nEDIT: thanks for so many responses, everyone!! i’m trying my best to get through them all but please send me a message first stating your age, college, year, major and pronouns (safety check bc getting some not good dms) 😅 i appreciate it so much!!"
    },
    {
        "title": "Cat at grad housing",
        "author": "aria_r",
        "created_utc": 1761194338.0,
        "num_comments": 4,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odu64j/cat_at_grad_housing/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "currently getting a cat that i am starting to go through the ESA process with. in the meantime….will anybody clock me for having the cat in my studio until it’s registered and ESA certified?\n\nif they do inspections, do they give you notice?"
    },
    {
        "title": "To thr unloved girl with dogshit voices in Rita",
        "author": "Rebel1356",
        "created_utc": 1761192660.0,
        "num_comments": 6,
        "score": 97,
        "permalink": "/r/UCSD/comments/1odtop7/to_thr_unloved_girl_with_dogshit_voices_in_rita/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Shut. The. Fuck. Up. \n\nYour voice sounds like ass, the whole building can hear you. \nIt's 9 pm in the middle of the week. \nBuzz off. \n\nYou've fucking sang \"Let iT gOoOOoOooOo\" 57 fucking times. \nUnemployed. "
    },
    {
        "title": "Lash Techs on Campus?",
        "author": "LyleJohnBelushi69",
        "created_utc": 1761192504.0,
        "num_comments": 2,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odtn0c/lash_techs_on_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Preferably with availability before next Thursday! "
    },
    {
        "title": "Why Stress??? UCSD is EASY",
        "author": "Lazy-Power-8031",
        "created_utc": 1761190561.0,
        "num_comments": 9,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odt1gp/why_stress_ucsd_is_easy/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I honestly don’t get why people here are always stressed out. Everything’s going great for us.  \nIf you’re reading this, congrats! You’re already beyond privileged. Your problems? They won’t matter in 10 years. That’s if you’re even here in 10 years.\n\nWe’ve all got straight A’s, multiple internships, a dozen clubs, friends who actually like us, and supportive families. Life couldn’t be easier.\n\nSo stop complaining. Stop pretending UCSD is hard.  \nJust chill. Go study your STEM notes; it’s easy and relaxing.\n\nAnyway, have a great day living your privileged, easy, stress-free life. I’ll be doing the same. 👍"
    },
    {
        "title": "Horror house ucsd",
        "author": "Actual_Egg3472",
        "created_utc": 1761190340.0,
        "num_comments": 2,
        "score": 6,
        "permalink": "/r/UCSD/comments/1odsz2o/horror_house_ucsd/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I am a current ucsd student but I want to go to the HAUNTED MAZE at mandeville with a friend who isn’t a ucsd student. \nDoes anyone know if they would allow that? \n\nUPDATE: apparently, you can bring a non ucsd friend they will just have to register their name there!! \n(To whoever it helps:) )"
    },
    {
        "title": "yogurt world fundraiser tmrw 10/23 🫰",
        "author": "OnionRepulsive6772",
        "created_utc": 1761189552.0,
        "num_comments": 3,
        "score": 9,
        "permalink": "/r/UCSD/comments/1odspz9/yogurt_world_fundraiser_tmrw_1023/",
        "image_url": "https://i.redd.it/6alcondr4swf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/VQLGdYghwBkRzz5etMonLjpEcPxF9r344wH481UiYwc.jpg",
        "body": "go go!"
    },
    {
        "title": "dining points",
        "author": "Comfortable_Sugar893",
        "created_utc": 1761188190.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1odsa0h/dining_points/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I have sm what can u use them for? or are they pointless"
    },
    {
        "title": "WANTED: Guitarist/Drummer/Violinist/Vocalist for a new and upcoming band!!",
        "author": "bittersweetnight7",
        "created_utc": 1761188044.0,
        "num_comments": 0,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ods89e/wanted_guitaristdrummerviolinistvocalist_for_a/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "If you are a musician and play one of the following instruments (or another instrument that you think can translate well to a band), please don’t hesitate to text this number! 8583129563. We will get back to you soon for more information. We are really excited to create music together, and we love these genres, jazz/funk/bossanova/latin/ indie/alt/dream pop/r&amp;b/soul. We plan to write originals, play at events, and also just jam for fun! If you or anyone you know is interested reach out:)"
    },
    {
        "title": "Will 11 units cancel my housing contract?",
        "author": "Syncgrey",
        "created_utc": 1761185261.0,
        "num_comments": 5,
        "score": 2,
        "permalink": "/r/UCSD/comments/1odrajk/will_11_units_cancel_my_housing_contract/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Basically what the title says. I want to drop a class but it will bring my total units to 11 instead of 12. Would I automatically lose my housing contract if I did this? Cause the minimum to be a full time student is 12. "
    },
    {
        "title": "Middle class scholarship withdrawn!!???",
        "author": "Ok_Relief2014",
        "created_utc": 1761181636.0,
        "num_comments": 15,
        "score": 61,
        "permalink": "/r/UCSD/comments/1odq1uh/middle_class_scholarship_withdrawn/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Yo. I just got an email saying it got withdrawn and their reasons did NOT apply to me. Did anyone else get this issue?? Idk what to do. Ima go to the financials aid office but hopefully it was a mistake:/\n\nEDIT: it was a mistake yall!! The scholarship and financial aid office said they made a mistake!! Yay so happy:))"
    },
    {
        "title": "taco bell",
        "author": "StillBullet",
        "created_utc": 1761181233.0,
        "num_comments": 6,
        "score": 48,
        "permalink": "/r/UCSD/comments/1odpwta/taco_bell/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "wasnt it suppose to be open bruh"
    },
    {
        "title": "Middle Class Scholarship Revoked",
        "author": "East_Business4529",
        "created_utc": 1761180670.0,
        "num_comments": 69,
        "score": 143,
        "permalink": "/r/UCSD/comments/1odppo4/middle_class_scholarship_revoked/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I need help. I just got a email saying that my middle class scholarship got revoked and I dont understand why. I’ve recently had a loss of income and I’m taking the amount of units needed. The only aid I have is a loan so im\nnot sure if thats making me not qualify but its frustrating and conveniently the financial aid office is closed tmr …\n\nupdate: finicial aid office is aware of the issue and will reevaluate "
    },
    {
        "title": "does anyone know if there is still 24 hr printing at price",
        "author": "malokes",
        "created_utc": 1761176624.0,
        "num_comments": 2,
        "score": 3,
        "permalink": "/r/UCSD/comments/1odo9o9/does_anyone_know_if_there_is_still_24_hr_printing/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "title "
    },
    {
        "title": "Where can i burn a read a CD on campus?",
        "author": "LilNilx",
        "created_utc": 1761173468.0,
        "num_comments": 11,
        "score": 9,
        "permalink": "/r/UCSD/comments/1odn2tk/where_can_i_burn_a_read_a_cd_on_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Where on campus can I access a CD reader or a computer with a CD slot? want to copy an old music CD I have. I tried borrowing one at Giesel, but they no longer keep any.  \nThanks\n\nTitle edit: Where can i read a CD on campus?[](https://www.reddit.com/r/UCSD/?f=flair_name%3A%22Question%22)"
    },
    {
        "title": "What is the undergraduate limit for double majoring, 200 or 400 credits?",
        "author": "richj8991",
        "created_utc": 1761171350.0,
        "num_comments": 8,
        "score": 24,
        "permalink": "/r/UCSD/comments/1odm9t8/what_is_the_undergraduate_limit_for_double/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I suspected my stepson never got into graduate school at UCSD...he was an undergraduate there since around 2017. Extremely secretive person to the point of being psychotic. Begs his mom to let him double major in Physics. Then last year, he says he's done with undergrad and is taking PhD courses online. I have no idea when he actually last set foot on campus physically. One of those stay in his room 24/7 in a bathrobe people. He hasn't taken a campus class physically since before Covid hit. His mother was so happy he got accepted. Well...not so fast, see below. \n\nSo yesterday I go on a mountain bike group ride, one of the riders is a PhD math student. I say my stepson is also in the program and taking online classes. He says there are no online graduate classes in math. He then looks up the student's name on the graduate directory...it's missing. I text my wife that we need to talk about this. She confronts him and he does admit that 'technically' he's not in the PhD program yet. \n\nHere is his plan and please tell me how whacked out this is, or if it could actually work: UCSD allows 5.5 years or 200 credits before forcing graduation (or kicking them out). If he double majored, I assume that's 11.0 years and 400 credits? He's been there since 2017 so he has until 2028 to finalize everything? He'll be 33 years old in 2 months BTW... Graduate school is $20K a year. His plan is to take as many PhD courses as he can (if he is indeed really taking ANY of them online) as an undergrad who as a scholarship and doesn't pay for classes. If he can take two years of classes and get those out of the way, and pass the qualifying exam, then in theory he only has two years left for a dissertation and he saves $40K for not having to pay for four years. \n\nIMO it's a really f-ed up way to go about trying to save $40K. If it works, and he gets his PhD and actually moves out and gets a postdoc somewhere, all will be more or less forgiven. I personally think it will not work; first of all he never even applied for the program and there is no guarantee he will be accepted. He does have other offers in Texas and Florida as a backup (out of state tuition of course). \n\nCan he really take most/all of his PhD classes still enrolled as an undergrad? And are any graduate classes online, especially in math?"
    },
    {
        "title": "Growing potatoes in UCSD",
        "author": "Protolinux217",
        "created_utc": 1761171295.0,
        "num_comments": 0,
        "score": 44,
        "permalink": "/r/UCSD/comments/1odm90p/growing_potatoes_in_ucsd/",
        "image_url": "https://i.redd.it/isgxym0hmqwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/6zUgzRYTgKy40MzOoogenF2mJSrsBS9Lwnb7J2KuGZA.jpg",
        "body": "Used the sixth college market potatoes I think"
    },
    {
        "title": "Socal cal state la Research study",
        "author": "Capt_ricardo",
        "created_utc": 1761169832.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1odlnny/socal_cal_state_la_research_study/",
        "image_url": "https://i.redd.it/m9ntrid4iqwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/2x7rT4aNOdwuu0zILFMhnpLHk-FOiRgLm6ijZHn5IeQ.jpg",
        "body": "Hi guys, sorry to bother you, but would y'all please take this survery regarding financial stress and Alcohol use for a research study. It would be much appreciated and if you can also share with your friend. In case the qr does not work please use the link to survey. https://calstatela.co1.qualtrics.com/jfe/form/SV_eb5UgB31VVWgUVo?Q_CHL=qr "
    },
    {
        "title": "How is biking on campus in 2025?",
        "author": "Aggressive_Sir800",
        "created_utc": 1761168432.0,
        "num_comments": 7,
        "score": 3,
        "permalink": "/r/UCSD/comments/1odl2uu/how_is_biking_on_campus_in_2025/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I brought a bike from home and I haven't brought it on campus yet...i saw threads from a couple years ago saying biking on campus is a horrible experience, but im assuming it got better over the years? thoughts?"
    },
    {
        "title": "Calling All UC San Diego Students: Enter the 2nd Annual ME/CFS Essay Contest hosted by ME/CFS San Diego (a CA 501c3 non-profit)!",
        "author": "dmhshop",
        "created_utc": 1761168304.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1odl0w4/calling_all_uc_san_diego_students_enter_the_2nd/",
        "image_url": "https://external-preview.redd.it/quoMPBzSr-Eupat4IwHFZv6rCoC0t4yu97Sxmg6N5hg.png?auto=webp&s=454fee5a4120fa87d092fb55fe650ad2297061c7",
        "thumbnail_url": "https://external-preview.redd.it/quoMPBzSr-Eupat4IwHFZv6rCoC0t4yu97Sxmg6N5hg.png?width=140&height=140&auto=webp&s=41766075adf4bbcccc16dd8529534723fc5202e1",
        "body": "We’re excited to announce that ME/CFS San Diego is now accepting entries for the 2025-2026 UCSD Student ME/CFS Essay Contest! To help raise awareness and inspire more participation, this year we’re expanding the contest to undergraduate students, as well as graduate and professional students.\n\n**Theme: Design a Future Where People with ME/CFS Can Truly Thrive**\n\nWe invite all UC San Diego students (undergraduate, graduate, and professional) to participate. The essay prompt challenges you to imagine a future where individuals living with Myalgic Encephalomyelitis/Chronic Fatigue Syndrome (ME/CFS) can truly thrive. Propose a solution, system, policy, tool, or story that tackles real-world barriers people with ME/CFS face in healthcare, education, and daily life.\n\n**About ME/CFS:**\n\nME/CFS is a debilitating, multisystemic disease that severely limits energy and function. It’s a complex, often misunderstood condition that affects millions globally. This contest encourages you to think critically and compassionately about how we can create a more inclusive, supportive world for those with ME/CFS.\n\n**Contest Details:**\n\n* **Eligibility:** All current UCSD students (undergraduate, graduate, and professional)\n* **Essay Length:** 500 words max\n* **Deadline:** December 31, 2025\n\n**Prizes:**\n\n* **First Prize:** $500\n* **Publication:** Leading ME/CFS organizations will publish winning essay information!\n\n**How to Enter &amp; Learn More:**\n\nVisit the contest website: [https://bit.ly/mecfsSDessay](https://bit.ly/mecfsSDessay)\n\nPlease share this post, forward it to UCSD student organizations, or include it in newsletters.  \n\n[ME\\/CFS San Diego is now accepting entries for the 2025-2026 UCSD Student ME\\/CFS Essay Contest https:\\/\\/bit.ly\\/mecfsSDessay Deadline 12\\/31\\/25.  Open to all current UCSD students. Cash Prizes up to $500 ](https://preview.redd.it/k3b14l2l5swf1.png?width=1932&amp;format=png&amp;auto=webp&amp;s=9202e15a9f088df9fd74fedac03b452a97f436a3)\n\n"
    },
    {
        "title": "Order sent to 9540 Gilman Dr. instead of 9450, what will happen?",
        "author": "Imaginary_Bus1198",
        "created_utc": 1761168195.0,
        "num_comments": 8,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odkz9w/order_sent_to_9540_gilman_dr_instead_of_9450_what/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I ordered a package to a random road by the Gilman parking structure and I don't think mailing services would know where to put the package in that situation. I'm hoping my package will be redirected to the correct place, I already sent a ticket to student mail services but I'm worried they wont be able to do anything. Thoughts/past experiences? Thanks. "
    },
    {
        "title": "Just Stressed",
        "author": "According-Gap-7141",
        "created_utc": 1761168033.0,
        "num_comments": 13,
        "score": 43,
        "permalink": "/r/UCSD/comments/1odkwtx/just_stressed/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I lowkey have no one to vent to so I’m just going to vent here. Ever since I started uni, I have been stressed. It’s my first year so obviously it’s going to be an adjustment and I don’t feel homesick because I’m commuting. But, academically, I have never been so stressed in my life and that’s coming from someone who excelled in high school. And the crazy part is that I’m not even taking what is considered hard classes or even taking 16 credits. I’m taking 12 so I could get used it and I am ahead due to taking dual enrollment in high school. But, I’m constantly drained and I never feel like I’m doing enough. And it’s the constant anxiety because all I want to do is pass. It’s crazy and I feel like I’m going crazy. Whenever I’m in class I’m so locked in and then I look around and people are just having convos or on their phones like are they just crazy smart? I am struggling and my major is also known to not be that hard, it’s cogs sci spec. in neuro. I just am so stressed right now. I literally wake up with my heart pumping with anxiety! My dad told me that the first year is going to be the hardest and now I understand why. But, I feel so guilty for feeling this way because there’s people working a job and taking harder classes or doing a harder degree in general and here I am complaining. Is it normal to feel this way? Any advice? Like things you did to not feel this looming sense of doom and despair and just misery 😭?"
    },
    {
        "title": "Econ100B midterm",
        "author": "BreathOwn3922",
        "created_utc": 1761167852.0,
        "num_comments": 4,
        "score": 3,
        "permalink": "/r/UCSD/comments/1odku6u/econ100b_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Is it just me or…"
    },
    {
        "title": "$1,500 Billing statement, Due by this Friday. Idk what to do",
        "author": "Responsible-Trust-60",
        "created_utc": 1761167416.0,
        "num_comments": 2,
        "score": 9,
        "permalink": "/r/UCSD/comments/1odknkt/1500_billing_statement_due_by_this_friday_idk/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm currently enrolled in 10 units, and was waitlisted for math20c. I ended up being dropped from the waitlist and now sitting at 10 units, and with part time status.... I've been a full time student for the past 3 years and idk what to do with this $1,500 charge DUE on Friday. I called student billing and the Registar office, they told me they can't do anything since I'm under the 12 units. Genuinely don't know what to do."
    },
    {
        "title": "math 10b midterm",
        "author": "Different_Manner_591",
        "created_utc": 1761166859.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odkf0y/math_10b_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "what was that "
    },
    {
        "title": "ACE parking on La Jolla Shores Dr",
        "author": "Commercial-Row1651",
        "created_utc": 1761166380.0,
        "num_comments": 2,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odk7ju/ace_parking_on_la_jolla_shores_dr/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "does anyone know what the deal is with that lot?  i see its empty all the time.  the signs say its public parking but theres also signs saying 'no parking' and 'tow at any time'\n\n"
    },
    {
        "title": "Does anyone else HATE chem 6b with Kim Albizati?😭 (UPDATED)",
        "author": "Dry_Weather_969",
        "created_utc": 1761165611.0,
        "num_comments": 10,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odjvbf/does_anyone_else_hate_chem_6b_with_kim_albizati/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I’m genuinely losing my mind in this class. He talks so quietly I can barely hear him even in the front row, and he rushes through every single slide like it’s a race. There are hardly ANY practice problems, which is wild because that’s literally how most of us actually learn chem.\n\nThen he had the nerve to ask, “was the midterm too hard?” Sir… yes. Yes it was.\n\nI’m honestly planning to email him because something needs to change. If you guys feel the same, please email too — maybe if enough of us say something, they’ll actually adjust the pacing or SOMETHING.\n\nIdk, maybe i’m reaching. Can someone w Chem background lmk if you think his teaching style is…. not good.\n\nKk bye"
    },
    {
        "title": "study abroad for art!",
        "author": "Emotional-Ad-3576",
        "created_utc": 1761164975.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1odjlj7/study_abroad_for_art/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi yall i’m a second year student fine arts major, and i would love to study abroad sometime next year, not too picky on the time or length. I was wondering if anyone here has studied abroad for the arts?\n\nLowkey there isn’t much for us out here, so I was wondering what your guys experience is and such"
    },
    {
        "title": "vendor fair hours",
        "author": "RemarkableForever150",
        "created_utc": 1761164957.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1odjl9e/vendor_fair_hours/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "do you guys know what time the vendor fair closes today"
    },
    {
        "title": "10% off yogurt world today",
        "author": "Open_Squirrel2645",
        "created_utc": 1761164933.0,
        "num_comments": 0,
        "score": 3,
        "permalink": "/r/UCSD/comments/1odjkwa/10_off_yogurt_world_today/",
        "image_url": "https://i.redd.it/efw8izxj3qwf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/waYEiVzoZrIsNc5sPKyoTmytik8_U7hnlitI-OybPC8.jpg",
        "body": ""
    },
    {
        "title": "Visitor parking?",
        "author": "ti-84_gang",
        "created_utc": 1761164868.0,
        "num_comments": 3,
        "score": 4,
        "permalink": "/r/UCSD/comments/1odjjue/visitor_parking/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "My usual parking area was completely full today, and I don’t really have a backup. Where are there V spots without a 2 hour limit? \n\nNervous that I’ll end up without parking on an important day like a midterm "
    },
    {
        "title": "is it possible to walk on the trolley tracks?",
        "author": "inblooks",
        "created_utc": 1761164603.0,
        "num_comments": 11,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odjfli/is_it_possible_to_walk_on_the_trolley_tracks/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "largely out of morbid curiosity - i live off campus in the nearby area next to a trolley station, and sometimes after studying on campus until 2 am i have no way to get back asides from walking. \n\ngiven that there are no more trolleys running at this time, would it be possible to walk on it like a bridge? or would there be some other hazard, like active power lines or whatnot?"
    },
    {
        "title": "Super random please dont upvote",
        "author": "Top_Acanthisitta154",
        "created_utc": 1761164476.0,
        "num_comments": 27,
        "score": 430,
        "permalink": "/r/UCSD/comments/1odjdk1/super_random_please_dont_upvote/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone at sixth college got a can opener I can borrow? I am at KA, i got these two peach cans and i aint tryna get a whole can opener just to use it for two cans lmao. Its not urgent or anything so if you do you can just let me know"
    },
    {
        "title": "Rave yard",
        "author": "Substantial_Count915",
        "created_utc": 1761162595.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1odijfq/rave_yard/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Is the rave yard halloween rave fun or legit? \nI heard the welcome week rave was bad so me and my friends are worried that this rave will be bad.\nAny halloween parties recommendations ...too..."
    },
    {
        "title": "Free Wok at 64",
        "author": "Muted_Village_6171",
        "created_utc": 1761162440.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1odigy4/free_wok_at_64/",
        "image_url": "https://i.redd.it/x9isuy55wpwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/CELT5HN0FIuxM90gh2SOPro5QnN8xtmA47podB1NFxo.jpg",
        "body": ""
    },
    {
        "title": "ECE 102 Midterm",
        "author": "sisgetthecam",
        "created_utc": 1761160830.0,
        "num_comments": 5,
        "score": 4,
        "permalink": "/r/UCSD/comments/1odhrcq/ece_102_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "What was that midterm 😭😭Bro I did not have enough time to finish that exam… I stared at problem 1 for like 10 minutes 🥀"
    },
    {
        "title": "Easiest upper div Econ classes",
        "author": "PlatypusBubbly9339",
        "created_utc": 1761160684.0,
        "num_comments": 0,
        "score": 3,
        "permalink": "/r/UCSD/comments/1odhoz0/easiest_upper_div_econ_classes/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hello, I am in need for recommendations for upper div Econ classes that aren’t too difficult since I just need it to complete an elective. Which classes would u recommend that isn’t too hard and an A is possible. Thank you! \n"
    },
    {
        "title": "protest outside of geisle",
        "author": "Formal-Finger-2056",
        "created_utc": 1761160649.0,
        "num_comments": 11,
        "score": 19,
        "permalink": "/r/UCSD/comments/1odhoeu/protest_outside_of_geisle/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Theres a large protest happening outside of Geisel but I can't make out what they're saying. Whats going on??"
    },
    {
        "title": "Math 181B Midterm",
        "author": "Square_Broccoli6549",
        "created_utc": 1761160552.0,
        "num_comments": 1,
        "score": 3,
        "permalink": "/r/UCSD/comments/1odhmx9/math_181b_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Surely its graded on steps and not the final answer bc I’m 100% sure I inputted a calculation wrong somewhere in the summation 😀😀😀\n\nAlso wrote down the entire course just to not put why there’s (r-1)(c-1) DF FML 😭"
    },
    {
        "title": "Weird unmarked black SUV saw in front of Sixth market heading towards ERC",
        "author": "Past_Distribution854",
        "created_utc": 1761159890.0,
        "num_comments": 55,
        "score": 287,
        "permalink": "/r/UCSD/comments/1odhc7p/weird_unmarked_black_suv_saw_in_front_of_sixth/",
        "image_url": "https://i.redd.it/v0mjf8yjopwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/8ouTrgXm_okldglGUnqWfJ6ujd5E6bbZ_gPoTGT6RSs.jpg",
        "body": "Both people in the front seat wearing sunglasses and maybe baseball caps I can’t remember tbh. HIGHKEY looked like ICE or DHS, PLEASE BE CAREFUL YALL🙏🏽🙏🏽"
    },
    {
        "title": "Girl taken away by cops",
        "author": "gelatossb",
        "created_utc": 1761159316.0,
        "num_comments": 10,
        "score": 0,
        "permalink": "/r/UCSD/comments/1odh2w2/girl_taken_away_by_cops/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "She got arrested and it’s none of your damn business anyways. Focus on yourself, grades, clubs, activities and working on your resume youngins peace."
    },
    {
        "title": "So eepy",
        "author": "OneEvidence4352",
        "created_utc": 1761158782.0,
        "num_comments": 5,
        "score": 27,
        "permalink": "/r/UCSD/comments/1odgu4y/so_eepy/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anybody else sleep deprived as well? I didn't start feeling so sleepy until this week that I'm like falling in and out of sleep in classes. Midterm studying has got me on a chokehold and I'm trying not to get burnt out alr. "
    },
    {
        "title": "UCSD MRI + Computer Treatment Study!",
        "author": "UCSD_SNLab",
        "created_utc": 1761157556.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1odgaea/ucsd_mri_computer_treatment_study/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/LcGl6J3MEVNCmOy4-KuNa6wqRSnHIVoTIZtzoSMujTM.jpg",
        "body": "Hello Tritons!\n\nThe Neurocognition of Stress, Trauma, and Anxiety Recovery Lab led by Dr. Jessica Bomyea is conducting a new research study at this very university! The purpose of this study is to learn whether an experimental computer-based program designed to improve thinking skills can help with symptoms of anxiety, depression, and PTSD.  \n\nIf you are interested in participating, please call 858-822-1470 or email [UCSDanxietylab@health.ucsd.edu](mailto:UCSDanxietylab@health.ucsd.edu), leaving us your name and phone number.  \n\nAny general questions can be answered in the comments as the lab Reddit becomes more active, but specific questions can be directed through the provided phone number/email! Please do not hesitate to ask any clarifying questions regarding the study, we are more than happy to answer as many questions as we can.\n\nhttps://preview.redd.it/pjq3vz7dhpwf1.png?width=640&amp;format=png&amp;auto=webp&amp;s=a64e76a595b420fd3633e651584296e000fcef00\n\nhttps://preview.redd.it/rkpwl36ehpwf1.png?width=640&amp;format=png&amp;auto=webp&amp;s=47d1d846bdc8034ccec3836b2fa58bf62534f2ec\n\n**You can also fill out this quick survey that can help determine your eligibility - if the link does not automatically work please give it a second to load:** [https://my.ctri.ucsd.edu/surveys/?s=EP3WMECAWX9YHKP](https://my.ctri.ucsd.edu/surveys/?s=EP3WMECAWX9YHKPA)  \n"
    },
    {
        "title": "Anyone starting a RAGNAR team?",
        "author": "empirate1123",
        "created_utc": 1761155318.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1odf9u0/anyone_starting_a_ragnar_team/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hello! My friend and I are potentially interested in being on a Ragnar team and wanted to see if there were any groups forming and need runners? PM me if so!"
    },
    {
        "title": "UCSD dress code?",
        "author": "Responsible-Dare5339",
        "created_utc": 1761152712.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ode2rn/ucsd_dress_code/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "starting as a nurse at UCSD soon and wondering what the color requirement is for scrubs "
    },
    {
        "title": "Does anyone know the grading scale for chem6b with Albizati?",
        "author": "ToastWithMayoOnly",
        "created_utc": 1761152066.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oddrub/does_anyone_know_the_grading_scale_for_chem6b/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Do"
    },
    {
        "title": "Is Bowers a harsh grader?",
        "author": "Efficient-Chemist248",
        "created_utc": 1761151329.0,
        "num_comments": 1,
        "score": 10,
        "permalink": "/r/UCSD/comments/1oddfi1/is_bowers_a_harsh_grader/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "So we had our midterm today and idk how to feel abt it. Does he give any partial credit?? "
    },
    {
        "title": "Hey guys! How did y'all find the Math 20 Midterm w/ Prof. Bowers?",
        "author": "Jazzlike_Road_8971",
        "created_utc": 1761151195.0,
        "num_comments": 1,
        "score": 5,
        "permalink": "/r/UCSD/comments/1odddag/hey_guys_how_did_yall_find_the_math_20_midterm_w/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Cooked"
    },
    {
        "title": "Group Study for Math 20B",
        "author": "LilNilx",
        "created_utc": 1761150853.0,
        "num_comments": 2,
        "score": 4,
        "permalink": "/r/UCSD/comments/1odd7oj/group_study_for_math_20b/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Looking for some Math 20B students to group study with.  \nI'm in Prof Cheng's MWF 8 am class, but students from any class/Prof work.  \nim a cambridge A-Levels student and have good experience with integration, complex numbers and diff equations.  \ndm me to connect\nThanks"
    },
    {
        "title": "Help w 3D printing😭",
        "author": "Daydreamer4everafter",
        "created_utc": 1761150121.0,
        "num_comments": 6,
        "score": 4,
        "permalink": "/r/UCSD/comments/1odcvsx/help_w_3d_printing/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I need print two cookie cutters ik this is weird but it’s lowkey for midterm😭😭\n\nSomewhere not that expensive plz"
    },
    {
        "title": "Calc 20B Midterm Bing Cheng",
        "author": "No_Ebb7623",
        "created_utc": 1761149687.0,
        "num_comments": 3,
        "score": 6,
        "permalink": "/r/UCSD/comments/1odcou8/calc_20b_midterm_bing_cheng/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "How cooked are we 😭 wtf was that midterm 🥀 gonna crash out fr and pray to the gods for a curve "
    },
    {
        "title": "dropping below 12 units",
        "author": "UnfairSweet3303",
        "created_utc": 1761124643.0,
        "num_comments": 4,
        "score": 3,
        "permalink": "/r/UCSD/comments/1od3eon/dropping_below_12_units/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "if i drop out of a class and have less than 12 units, am i gonna get kicked off my on campus housing? i will be a full time student again starting winter quarter"
    },
    {
        "title": "Friends to game with???",
        "author": "No-Ad6524",
        "created_utc": 1761123215.0,
        "num_comments": 2,
        "score": 4,
        "permalink": "/r/UCSD/comments/1od315x/friends_to_game_with/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Looking for some people to game with, most of my friends don't really game anymore..\n\nPlay 2k, fifa, cod, bf6...\n\nfornite... ig.."
    },
    {
        "title": "Beng 2",
        "author": "dard-e-disco777",
        "created_utc": 1761115333.0,
        "num_comments": 3,
        "score": 0,
        "permalink": "/r/UCSD/comments/1od104s/beng_2/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Any advice on how to study for BENG2 and what to expect in exams?"
    },
    {
        "title": "Math 20A midterm? (Gaojin He)",
        "author": "Mammoth_Phrase_9107",
        "created_utc": 1761112300.0,
        "num_comments": 6,
        "score": 3,
        "permalink": "/r/UCSD/comments/1od06tu/math_20a_midterm_gaojin_he/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "How did it go guys?"
    },
    {
        "title": "Curry up now is lowkey the meta",
        "author": "RecordingOnly6853",
        "created_utc": 1761112157.0,
        "num_comments": 2,
        "score": 6,
        "permalink": "/r/UCSD/comments/1od05e8/curry_up_now_is_lowkey_the_meta/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Those sexy fries are everything they say they are, gahdamn"
    },
    {
        "title": "Math 20A Midterm",
        "author": "MasterpieceFun3855",
        "created_utc": 1761111695.0,
        "num_comments": 0,
        "score": 6,
        "permalink": "/r/UCSD/comments/1od00yi/math_20a_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Chat how cooked are we? I probably got 50% 😭"
    },
    {
        "title": "sociology courses for winter quarter",
        "author": "YNGLUVZ-",
        "created_utc": 1761111211.0,
        "num_comments": 4,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oczw97/sociology_courses_for_winter_quarter/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "does anyone have any good recommendations for the winter quarter for sociology. i am going to be doing some upper divisions and then one lower division plus a method. \n\none of the classes i wanted isn’t offered during the winter sadly, so im open to suggestions for it. i’ve already taken soci 117, 148e and 138. \n\nalso pls pls let me know the profs are for said recommendations and if its worth taking a professor that might lowkey suck thank u"
    },
    {
        "title": "How do u guys like ur triple room?",
        "author": "Terrible_Werewolf_18",
        "created_utc": 1761110795.0,
        "num_comments": 8,
        "score": 21,
        "permalink": "/r/UCSD/comments/1oczs41/how_do_u_guys_like_ur_triple_room/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I just hate it so much. The room stink cuz one of them never does the laundry ( dont know how to tell her…) and i cannot sleep when the light is still on. Never requesting a roommate again."
    },
    {
        "title": "Screened Majors?",
        "author": "Feeling_Solution_468",
        "created_utc": 1761109677.0,
        "num_comments": 4,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oczgjh/screened_majors/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "What does it mean that a major is screened? I am an applying first-year student, and it seems like the major I am applying for is an impacted major. I read some information online about needing to complete the \"screening criteria\" to choose the major, so I am confused about whether or not I can/should apply."
    },
    {
        "title": "Girl taken away by cops",
        "author": "Infinite-Ad7127",
        "created_utc": 1761109566.0,
        "num_comments": 36,
        "score": 130,
        "permalink": "/r/UCSD/comments/1oczfem/girl_taken_away_by_cops/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Did yalls see that girl get taken by the cops outside of the 20A midterm in the catalyst building "
    },
    {
        "title": "for anyone looking to make new friends",
        "author": "malokes",
        "created_utc": 1761108721.0,
        "num_comments": 4,
        "score": 8,
        "permalink": "/r/UCSD/comments/1ocz6ec/for_anyone_looking_to_make_new_friends/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "my dms are open. im a second year cogsci major and im autistic and have adhd 😛 my special interest is people so even though i already have friends here i am ALWAYS willing to meet more. i also know of social events that happen on campus for varying clubs and the occasional greek life get together because insta//my own involvement//friends + events the school hosts. sooo yeah feel free to reach out and/or leave a comment if you want other people to dm you!"
    },
    {
        "title": "Covid Tests",
        "author": "CoolCatIsRadical",
        "created_utc": 1761107943.0,
        "num_comments": 2,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ocyy3d/covid_tests/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anyone know where I can get a covid test?  I tried the vending machine in Price but I don't think it's working right now. "
    },
    {
        "title": "phys 2b fa25",
        "author": "Similar_Ear_4101",
        "created_utc": 1761106090.0,
        "num_comments": 3,
        "score": 6,
        "permalink": "/r/UCSD/comments/1ocydtz/phys_2b_fa25/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "anyone else taking PHYS 2B with Barrerio and genuinely think they aren’t going to pass after taking 2A with Shotwell? Im looking at quiz 2 practice and everything and I can’t even do a simple problem. \nI’m so scared Im going to fail but at the same time it feels like everyone else knows what they’re doing 😭"
    },
    {
        "title": "hair stylist for dying hair",
        "author": "Disastrous_Gap468",
        "created_utc": 1761105687.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ocy91c/hair_stylist_for_dying_hair/",
        "image_url": "https://i.redd.it/gfgj8fwd7lwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/LOrePcsuDcBF-JyhZl0Z6nwreWuuqkXoLxXMbv_r7wY.jpg",
        "body": "anyone have a good hair salon/stylist in sd to recommend? i’d like to dye my hair like this (blonde balayage)"
    },
    {
        "title": "math 173A",
        "author": "Future-Print1974",
        "created_utc": 1761105314.0,
        "num_comments": 12,
        "score": 12,
        "permalink": "/r/UCSD/comments/1ocy4kr/math_173a/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone else not have a clue what is going on in this class? I'm getting cooked hard "
    },
    {
        "title": "Halloween Plans",
        "author": "jussjoos",
        "created_utc": 1761103070.0,
        "num_comments": 15,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ocxe1d/halloween_plans/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone know of any Halloween parties/events this weekend coming up or on Halloween? Please lemme know:)"
    },
    {
        "title": "Parking Help",
        "author": "angelic444lol",
        "created_utc": 1761101662.0,
        "num_comments": 7,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ocwwwl/parking_help/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I have some friends coming from a different city that want to visit me on campus over the weekend from Halloween until November 2. One of them has a car and she was thinking of driving here with another friend and then staying at my dorm for a few days. I'm a second year and don't have a car on campus and I don't understand the parking situation here at all, I've only heard very bad stuff about it. I was wondering where I could find like 24/7 parking for those few days. Any tips? The parking permit situation is very confusing, I'm totally lost. "
    },
    {
        "title": "Halloween party",
        "author": "UCSDParties",
        "created_utc": 1761101463.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ocwufg/halloween_party/",
        "image_url": "https://i.redd.it/z49n4pntukwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/8jtKVTbgi-o7_9kYh9NMItrbAuK1vdEVBdCl-MYCIoY.jpg",
        "body": ""
    },
    {
        "title": "Anybody listen to danny brown",
        "author": "RecordingOnly6853",
        "created_utc": 1761099657.0,
        "num_comments": 8,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ocw8gu/anybody_listen_to_danny_brown/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "People in this campus seem to have very diverse tastes I wonder if anyone likes danny brown or any of his associates. He’s dropping a new album in November called Starburst and it features a lot of hyperpop and trans figures in the music industry like underscores and femtanyl."
    },
    {
        "title": "costa verde ppl",
        "author": "Present_Roll_9312",
        "created_utc": 1761097565.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ocvidy/costa_verde_ppl/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi, can anyone who lives at costa do me a favor? dm me please "
    },
    {
        "title": "ANTH 10 Midterm?",
        "author": "souls920",
        "created_utc": 1761097118.0,
        "num_comments": 3,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ocvcqb/anth_10_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I saw from previous ANTH 10 posts saying that exams are take-home, so I’m wondering it doesn’t require that much studying in the past?? Because now I’m in Stewarts’ for Fall quarter and we have to do it in lockdown browser. I thought it’d just be an essay but there’s vocab matching…i don’t think I took enough notes LOL\n\nIs anyone also in ANTH 10 willing to share some…or does anyone know if all the vocab will be on the slides ? Because sometimes I see him changing up the slides so!\n\nAny suggestions from past students as well? I appreciate it!! "
    },
    {
        "title": "cogsci",
        "author": "Bubbly_Dress5974",
        "created_utc": 1761095726.0,
        "num_comments": 4,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ocuvaa/cogsci/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "hi all is the cogsci here really  competitive for undergrad "
    },
    {
        "title": "Math 140a midterm grades came back",
        "author": "Intrepid-Factor5321",
        "created_utc": 1761093765.0,
        "num_comments": 11,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ocu5o0/math_140a_midterm_grades_came_back/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "What a harsh grading scheme lmao. Rip see you on the next midterm. "
    },
    {
        "title": "twenty one pilots concert",
        "author": "RecentMagician",
        "created_utc": 1761093299.0,
        "num_comments": 0,
        "score": 5,
        "permalink": "/r/UCSD/comments/1octzkg/twenty_one_pilots_concert/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i'm seeing twenty one pilots in chula vista this thursday, and i don't have a car ☠️. lmk if you are also going and want to carpool or share an uber 🙏"
    },
    {
        "title": "For those who've taken Mingyu Yang for BIPN 100",
        "author": "kingkrish_15",
        "created_utc": 1761093019.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1octvwt/for_those_whove_taken_mingyu_yang_for_bipn_100/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "How are the midterms like, are they similar to the practice questions he gives? Do you think I can get an A if I'm good with the practice sets and know my pathways/anatomies? Kinda stressed cause its tmr lol\n\n(for midterm 1)"
    },
    {
        "title": "Midterm math 3b",
        "author": "AccessLegal3350",
        "created_utc": 1761092728.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1octs5u/midterm_math_3b/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Has anyone taken the midterm for math 3b, if so how is it like? How many questions are there? Is it formatted similar to the 3 versions of the practice midterms that hammock posted. I know for the quizzes they are formatted similar to the practice quizzes, and I was wondering if the midterm was similar. "
    },
    {
        "title": "Lost Airpod on 30 Bus",
        "author": "Top_Soil_6524",
        "created_utc": 1761091675.0,
        "num_comments": 0,
        "score": 4,
        "permalink": "/r/UCSD/comments/1octeh0/lost_airpod_on_30_bus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "If you dropped your case on the way off the bus at like 4:30, its at the 30 stop under the bridge leading to the med side of campus "
    },
    {
        "title": "UCSD Haunted Maze/House",
        "author": "Fawnsk1n",
        "created_utc": 1761090811.0,
        "num_comments": 5,
        "score": 22,
        "permalink": "/r/UCSD/comments/1oct312/ucsd_haunted_mazehouse/",
        "image_url": "https://i.redd.it/f74pjoi5zjwf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/tP69kfqAMd9sxzlqdfbdV6op2W8w0OsCYfvk0UCKOr8.jpg",
        "body": "Anyone going? I am unsure of going because I'm scaredy pant and hope I feel better (health wise( by then . Could anyone tell me their experience of going on a scaredy ness scale ⚖️"
    },
    {
        "title": "Scribing opportunities/ premed",
        "author": "IllReality5974",
        "created_utc": 1761089723.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ocsohc/scribing_opportunities_premed/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi guys! Does anyone have any leads on any potential scribing opportunities. Im in the trenches and have been searching these past few months. I really want this experience but cannot find any leads pleaseee help!"
    },
    {
        "title": "I was definitely gonna do smth",
        "author": "WorkGroundbreaking83",
        "created_utc": 1761089070.0,
        "num_comments": 4,
        "score": 28,
        "permalink": "/r/UCSD/comments/1ocsfvg/i_was_definitely_gonna_do_smth/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "But don't remember it now"
    },
    {
        "title": "Lost AirPods case on bus route 201",
        "author": "Physical-Current-762",
        "created_utc": 1761087848.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ocrz5q/lost_airpods_case_on_bus_route_201/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I think I lost my AirPods case on a 201 bus. If anybody has seen them please reply or dm me. They don’t have any AirPods inside, only the case. Thank you."
    },
    {
        "title": "feel alone",
        "author": "fools_hardy",
        "created_utc": 1761087491.0,
        "num_comments": 4,
        "score": 15,
        "permalink": "/r/UCSD/comments/1ocru4m/feel_alone/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "im a first year and yea yeah its like socially dead or whatever but I genuinely cannot get myself to try and introduce myself to new people and make friends. Its a real struggle ive liked joined clubs and stuff but ive always feel a sort of “I dont really belong here” to a majority of things I try. Its a mental thing I know but like man do I feel pretty lonely here especially when walking around seeing other people with friends. I feel like im going a little crazy"
    },
    {
        "title": "Yogurt world fundraiser!! (Friday 10/27)",
        "author": "Faketalesofsan_diego",
        "created_utc": 1761087165.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ocrpia/yogurt_world_fundraiser_friday_1027/",
        "image_url": "https://i.redd.it/jnb9so6bojwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/P3JWUYQBE73R8HdqBOV81rcTxRiH0_sfExFPYZ3U5PU.jpg",
        "body": "Come get froyo this Friday and also support your favourite club on campus. All-day event, bring your friends!"
    },
    {
        "title": "Guitar String",
        "author": "nokiacalling",
        "created_utc": 1761086966.0,
        "num_comments": 2,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ocrmrp/guitar_string/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "My guitar string snapped recently and I was wondering if there are any on campus resources to get it restrung? Obviously I would buy a replacement string but just hoping for a free restringing."
    },
    {
        "title": "please stop talking during lectures",
        "author": "Silver_Fox_3682",
        "created_utc": 1761086759.0,
        "num_comments": 6,
        "score": 90,
        "permalink": "/r/UCSD/comments/1ocrjqk/please_stop_talking_during_lectures/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "why do people feel the need to have entire conversations for the whole class to hear when the professor is just trying to teach 😭"
    },
    {
        "title": "STEM Job Market doesn't make sense to me",
        "author": "phildeezle",
        "created_utc": 1761086337.0,
        "num_comments": 19,
        "score": 122,
        "permalink": "/r/UCSD/comments/1ocrdru/stem_job_market_doesnt_make_sense_to_me/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I genuinely don't understand the STEM job market.  I applied for a General Atomics role last year, got an interview but didn't land the job because another stronget candidate had more skills needed.  I got feedback from the interview and used it to improve myself by obtaining skills necessary from my masters program.  My masters research project helped me obtain skills specific to the job.\n\n1 year later, I obtain the needed skills for the job through completing my masters program and completing my research project\n\nI apply for the same role and my application doesn't even make it to the interview stage.  Apparently they are looking for more junior level applicants.  \n\nSo I was underqualified when i was in the middle of school and had little industry skills but now that I'm done and obtained industry skills I'm over qualified.  This market makes zero sense.  It also seems like I had better odds for the job when I didn't achieve my masters degree.\n\nThis job market is so demoralizing and I'm losing faith that I'll land a job."
    },
    {
        "title": "Rejected from the Markets???",
        "author": "Aggressive_Topic_913",
        "created_utc": 1761085111.0,
        "num_comments": 3,
        "score": 4,
        "permalink": "/r/UCSD/comments/1ocqw2d/rejected_from_the_markets/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Me and my roommate both applied to the same markets today and she heard back in minutes while I still haven't heard anything I did apply 10 minutes after she did. Am I just over stressing or am I actually gonna get rejected lol "
    },
    {
        "title": "sitting next to your friends in class",
        "author": "huggablebeetle",
        "created_utc": 1761083610.0,
        "num_comments": 12,
        "score": 113,
        "permalink": "/r/UCSD/comments/1ocq9vi/sitting_next_to_your_friends_in_class/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "if you want to sit next to your friends in class perhaps come in together, have your friend come on time, OR accept that you guys don’t have to sit together \n\nstop wasting the time of people who come on time and genuinely just want to find a seat to take an exam "
    },
    {
        "title": "\"What's it like to work for HDH?\"",
        "author": "PhoGaPhoever",
        "created_utc": 1761082605.0,
        "num_comments": 2,
        "score": 37,
        "permalink": "/r/UCSD/comments/1ocpup8/whats_it_like_to_work_for_hdh/",
        "image_url": "https://i.redd.it/9m6tdb21ajwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/QUKuunFjd6hP3KV2yUmMpSEsJJ9TcmJmCaE9LCUon6k.jpg",
        "body": ""
    },
    {
        "title": "Anyone else sick rn",
        "author": "Fawnsk1n",
        "created_utc": 1761082526.0,
        "num_comments": 12,
        "score": 40,
        "permalink": "/r/UCSD/comments/1ocptf9/anyone_else_sick_rn/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "So sick 🤧 my body feels to weak and I sound like a cigarette mom. My sickness started Saturday and since then I haven't been able to go any of my classes because I feel so weak, tired, and dizzy when I just stand up. So cooked for midterms because I've been trying to sleep the sickness off. Anyway my doctor at student health basically told me my body would fight it but I never felt this sick before 🤒 in my life 🙏"
    },
    {
        "title": "Mad Max:  Library Walk",
        "author": "PhoGaPhoever",
        "created_utc": 1761082298.0,
        "num_comments": 1,
        "score": 16,
        "permalink": "/r/UCSD/comments/1ocppuo/mad_max_library_walk/",
        "image_url": "https://i.redd.it/ugrgq5ar9jwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/rmijIclpapsh2t6nEiDFTE_yuHDzibKaJKKqrWgCpeI.jpg",
        "body": ""
    },
    {
        "title": "A crime drama in two acts",
        "author": "PhoGaPhoever",
        "created_utc": 1761081356.0,
        "num_comments": 2,
        "score": 6,
        "permalink": "/r/UCSD/comments/1ocpbfl/a_crime_drama_in_two_acts/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/kasfHadTmLWNMt9CZOo7RULizDGku0L5uFAxA_zr3zs.jpg",
        "body": ""
    },
    {
        "title": "Lost my wallet this morning",
        "author": "Few_Entertainment527",
        "created_utc": 1761081130.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ocp7zc/lost_my_wallet_this_morning/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I lost my wallet sometime today either in York 2722, Jean Aud, or MOS 0113. If anybody finds it please dm me I’m desperate 😢🥀"
    },
    {
        "title": "$5 for orphans!",
        "author": "Accomplished-Long-58",
        "created_utc": 1761080905.0,
        "num_comments": 10,
        "score": 16,
        "permalink": "/r/UCSD/comments/1ocp4g7/5_for_orphans/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Did anyone else see the guys by Target shouting this? They're probably just assholes who feel like main characters but seriously what's their deal"
    },
    {
        "title": "BSB alarm?",
        "author": "SDCouple4131",
        "created_utc": 1761079301.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ocof8x/bsb_alarm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Another Asshole pull the alarm again?"
    },
    {
        "title": "67 math 18 guy",
        "author": "Swimming_Weight_7723",
        "created_utc": 1761079119.0,
        "num_comments": 2,
        "score": 38,
        "permalink": "/r/UCSD/comments/1ococdv/67_math_18_guy/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "when the prof asks for example scenarios you don't have to shout for 67 every single time..\nNormally I find brainrot funny but it's been every week and (practically) every lecture.\nIt's tiring n this is why jokes die out so fast.\nAlso your questions always are too quiet for anyone to even hear + sound like gibberish... save it for office hours plz ✌️✌️\nDoes this guy piss anyone else off too cuz I stg I visibly sigh every time I hear random mumbling and the prof asking them to repeat themselves 5 times"
    },
    {
        "title": "What is the University and Professional Studies program for? Is it different to Visiting student?",
        "author": "Strong_Engineering27",
        "created_utc": 1761078157.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ocnx8w/what_is_the_university_and_professional_studies/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "[https://extendedstudies.ucsd.edu/international-programs/dates-prices/dates-prices](https://extendedstudies.ucsd.edu/international-programs/dates-prices/dates-prices)\n\nis it worth it to do this program?"
    },
    {
        "title": "My favorite restroom on campus",
        "author": "wqr03",
        "created_utc": 1761076836.0,
        "num_comments": 16,
        "score": 36,
        "permalink": "/r/UCSD/comments/1ocnbnn/my_favorite_restroom_on_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "My favorite restroom on campus is the"
    },
    {
        "title": "Thoughts on CSE291: AI Agents (Winter 2026) with Professor Prithviraj Ammanabrolu?",
        "author": "Leather_Influence288",
        "created_utc": 1761076211.0,
        "num_comments": 0,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ocn1iv/thoughts_on_cse291_ai_agents_winter_2026_with/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I'm planning to take CSE291: AI Agents with Professor Prithviraj Ammanabrolu in Winter 2026. From his website, the course seems to cover topics on Reinforcement Learning and LLMs.\n\nSince Prof. Ammanabrolu just joined UCSD in 2024, there isn't much info about his teaching or this course yet. Has anyone taken this class before (Winter 2025)? How was it -- content, difficulty, projects, teaching style, etc.?\n\nFor context, I've only taken CSE250A and have limited RL background, with almost no experience in DL, NLP, or LLMs. Would I be okay in this course?"
    },
    {
        "title": "CBN Major Study Abroad",
        "author": "Livid-Ferret-3741",
        "created_utc": 1761076204.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1ocn1et/cbn_major_study_abroad/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Just wondering if anyone has any recommendations on where to study abroad as a CBN major! Also which programs are more cost effective (UCEAP vs Global Exchange) "
    },
    {
        "title": "Soci 138",
        "author": "Gate-More",
        "created_utc": 1761075851.0,
        "num_comments": 3,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ocmvqm/soci_138/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey is anyone in soci 138 with Navon? The class is right before my work shift, which is downtown so I usually can't make it to lecture, and he doesn't podcast. Anyone have any notes?"
    },
    {
        "title": "Lost light blue-green wallet with hedgehog patterns at SME",
        "author": "soicon1998",
        "created_utc": 1761075192.0,
        "num_comments": 1,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ocml2s/lost_light_bluegreen_wallet_with_hedgehog/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hello, I dropped my wallet near/inside the SME building from 8-9 AM this morning (Oct 21). If you happened to pick it up, please reply in the post. I just need the wallet back, it holds significant personal meaning. "
    },
    {
        "title": "Are we serious",
        "author": "tritonprince",
        "created_utc": 1761074833.0,
        "num_comments": 27,
        "score": 309,
        "permalink": "/r/UCSD/comments/1ocmfe9/are_we_serious/",
        "image_url": "https://i.redd.it/02ckghemniwf1.jpeg",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/kavGGYIT5SjMNzpqwkXHW0kLNvpxjfV9qTsb7sszAj8.jpg",
        "body": "Outside Peterson "
    },
    {
        "title": "Psyc Pivot to Cog sci / Machine learning?",
        "author": "Falkery",
        "created_utc": 1761074213.0,
        "num_comments": 0,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ocm5en/psyc_pivot_to_cog_sci_machine_learning/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Graduating this year as a psyc major, and my work experience currently builds toward a master's program in psychotherapy (lots of clinical hours through ABA and working with a practice). However, I don't know, I dont feel satisfied with my exposure to the field, thus far. As I expose myself to more cognitive and neurobio upper divs, I find myself more fascinated understanding those topics as opposed to the general psyc. curriculum. ML might be too big of a pivot, but I plan to take a gap year to build up my resume, research experience, pursue a coaching certification, and develop more mathematical and statistical foundation for my career. Long term goal, I want to break into higher ed. For now, I still plan on pursing a master's program, post the gap year. I'd like to ask for general thoughts, resources, and what the post-grad experience is like getting involved with cog-sci research. Additionally, if you are a recent psyc UCSD graduate, what are you doing now? What do you have planned for yourself? A lot is up in the air, any and all things are appreciated. "
    },
    {
        "title": "should i take math 20E or 109 first?",
        "author": "Available_Run_3619",
        "created_utc": 1761074035.0,
        "num_comments": 5,
        "score": 0,
        "permalink": "/r/UCSD/comments/1ocm2hz/should_i_take_math_20e_or_109_first/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "🤔 thank u in advanced"
    },
    {
        "title": "Groupwork: Lets talk about it.",
        "author": "UCSDICK",
        "created_utc": 1761073669.0,
        "num_comments": 4,
        "score": 5,
        "permalink": "/r/UCSD/comments/1oclwlv/groupwork_lets_talk_about_it/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "it seems that there are people who come in at the end of a group project and beg to submit or, beg to participate after most of the group is done, or have so many excuses. How to deal with these types? "
    },
    {
        "title": "got ringworm somehow",
        "author": "StopMaterial7891",
        "created_utc": 1761071708.0,
        "num_comments": 6,
        "score": 11,
        "permalink": "/r/UCSD/comments/1ocl0e6/got_ringworm_somehow/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "already gotten ringworm and it’s barely been a month here😭 i don’t even wrestle and i shower too like don’t come to revelle yall 😭"
    },
    {
        "title": "Star Wars keychain/charm turned in to Price 3rd floor Lost and Found",
        "author": "PhoGaPhoever",
        "created_utc": 1761071671.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ockzt0/star_wars_keychaincharm_turned_in_to_price_3rd/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "My dad found it in the traffic circle outside Burger King.  Tell L&amp;F what it looks like to retrieve it."
    },
    {
        "title": "CHEM 40A Midterm",
        "author": "BookishDiscourse",
        "created_utc": 1761070223.0,
        "num_comments": 1,
        "score": 5,
        "permalink": "/r/UCSD/comments/1ockcax/chem_40a_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Am I the only one who’s completely lost in chapter 3😭. I am doing the worksheet right now and I swear none of this makes sense. \n\nIf the midterm is even remotely like this I’m dropping the class and retaking it next quarter :("
    },
    {
        "title": "why is skipping so addictive",
        "author": "YNGLUVZ-",
        "created_utc": 1761069840.0,
        "num_comments": 55,
        "score": 309,
        "permalink": "/r/UCSD/comments/1ock606/why_is_skipping_so_addictive/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i swear i feel like once u skip it’s like some chronic disease because then you just indoctrinate the mindset that like “oh they’ll post it on canvas” even if that’s like 50/50 lmao\n\nedit: u guys who are saying im wasting my student loans a) i wasn’t able to qualify for student loans so i barely make it by paying my tuition out of pocket and b) i am not the only one skipping trust me. all of u tight asses who are taking this post seriously need to light a blunt and call it a day 😭"
    },
    {
        "title": "UCDC Housing Inquiry",
        "author": "figtreereverie",
        "created_utc": 1761069812.0,
        "num_comments": 6,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ock5jv/ucdc_housing_inquiry/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I just got into the UCDC program and I’m super excited!! For those who’ve done or are planning to do UCDC, would you recommend staying in the university housing or finding your own place?\n\nThe $1.6k/month rent for university housing seems pretty steep, but I’m open to paying it if the convenience and community make it worth it. I’d love to hear your thoughts or experiences!"
    },
    {
        "title": "Phys2a",
        "author": "avacadotoasttoe",
        "created_utc": 1761069651.0,
        "num_comments": 5,
        "score": 2,
        "permalink": "/r/UCSD/comments/1ock2s2/phys2a/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Idk how im gonna pass this class ngl. The lectures kinda make sense but then i try doing the questions on my own and stumble before i use online resources to get the answer and it makes it seem so easy. How do you guys study for this class???"
    },
    {
        "title": "Carpool Lanes & B Permit? no",
        "author": "Akan4h",
        "created_utc": 1761069374.0,
        "num_comments": 7,
        "score": 11,
        "permalink": "/r/UCSD/comments/1ocjy6g/carpool_lanes_b_permit_no/",
        "image_url": "https://i.redd.it/8ozfuqpe7iwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/0gJcl-AAHeTm_jIGkhpsErf2FtDgfNwM2QRsXPCVPTw.jpg",
        "body": "sorry if this is a dumb question, I just got a B permit and didn’t anticipate it to be this hard to find parking😭 but can B permits park in the carpool spots after 11 A.M., or am I misinterpreting the sign? it makes it seem that the carpool permits have first priority from 7-11am and then after A,B, and S permits can park here too, is that right? or do i need to have both to park :|"
    },
    {
        "title": "found Apple Pencil in Geisel East 2nd floor",
        "author": "sakakiplanet",
        "created_utc": 1761068932.0,
        "num_comments": 0,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ocjqzb/found_apple_pencil_in_geisel_east_2nd_floor/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "holler @ me with what it looks like/where you last used it"
    },
    {
        "title": "Mycology Club!",
        "author": "Hello-James",
        "created_utc": 1761066994.0,
        "num_comments": 0,
        "score": 25,
        "permalink": "/r/UCSD/comments/1ocivpt/mycology_club/",
        "image_url": "https://i.redd.it/f8kg8osb0iwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/Qb1E2FF81gpbwVIb98tJED_nCXSn5mfW-zgP49RcUAQ.jpg",
        "body": "Join our discord for more info https://discord.gg/fBq35kz8x2"
    },
    {
        "title": "Math 20A midterm",
        "author": "Efficient-Chemist248",
        "created_utc": 1761065691.0,
        "num_comments": 4,
        "score": 3,
        "permalink": "/r/UCSD/comments/1ocib44/math_20a_midterm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hey yall so what’s the best way to practice for my math midterm w prof bowers tomorrow 🙏🏼? "
    },
    {
        "title": "Bikelane",
        "author": "AwarenessApart6889",
        "created_utc": 1761063938.0,
        "num_comments": 15,
        "score": 22,
        "permalink": "/r/UCSD/comments/1ochjgz/bikelane/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "If u use the bike lane, use the round about by sungod lawn properly. Almost died rn to someone who ignored the round about"
    },
    {
        "title": "making friends at ucsd",
        "author": "jaundicebaddie",
        "created_utc": 1761043910.0,
        "num_comments": 16,
        "score": 19,
        "permalink": "/r/UCSD/comments/1oc9q0e/making_friends_at_ucsd/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i'm a second year at ucsd and i'm out of state. it's so hard making friends here because it feels like everyone is already situated in their own friend groups and when i try to make new friends they don't like to be around me that much. maybe the culture from my home is different from california, and my roommate who's from anaheim tells me that california is way different from where i'm from (which i didn't know). i thought it would get better after my first year, but it doesn't feel like it. i've tried to go rush for a sorority but they denied me and i've joined clubs but i still don't feel a part of anything here. whenever my parents call and ask about school i tell them i'm fine and that everything is super fun but i'm lying and it's really not. i've started a new internship so i'm excited for that, but it's hard to look forward to when the rest of your life is kind of bland. hopefully someone understands! i do still love this school and am glad i'm given this opportunity to come here, it's just hard to find a community here. "
    },
    {
        "title": "Is there a discord for BIEB102 with Isidora Echenique?",
        "author": "SabotageSensei",
        "created_utc": 1761031550.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oc6hmc/is_there_a_discord_for_bieb102_with_isidora/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "If you’re in the class please send me the link!"
    },
    {
        "title": "idk how i feel about this school",
        "author": "Aggravating-Job266",
        "created_utc": 1761028235.0,
        "num_comments": 30,
        "score": 106,
        "permalink": "/r/UCSD/comments/1oc5m8x/idk_how_i_feel_about_this_school/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i’m a first year at ucsd and so far i’m not sure how i’m liking it here. i have not made any friends and most of the time when i talk to people i feel like i’m just annoying the hell out of them. it’s kinda funny how flat out rude some of the people i’ve talked to have been. i don’t really blame them, i’m sure some people don’t realize, but it’s just really hard to connect with others and i’ve felt very displaced this past month. i also feel very poor compared to the people around me and sometimes feel like i’m being judged. i’ll say things like “thank you” or “have a nice day” and still get no response from others. so most of my day i hardly speak to people. it gets a little lonely at times. i want to leave the campus sometimes (not utc it’s basically the same) but the location and lack of transportation makes it kinda hard. it takes so long (with public transport) just to get away from the la jolla area it’s almost not worth it. im sure these are normal feelings when going away for college, and i love many parts about the school. so please don’t take any offense to what i’m saying. i’ve been trying to keep my positive outlook on college and have been using my hiccups as a learning experience. but i kinda just wanted to rant since the inter dialogue in my head has been driving me nuts. i feel so out of place. "
    },
    {
        "title": "Rooftop waffle fries",
        "author": "strawberry_cupcake76",
        "created_utc": 1761028157.0,
        "num_comments": 1,
        "score": 13,
        "permalink": "/r/UCSD/comments/1oc5lgf/rooftop_waffle_fries/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "im an alum from 2 yrs ago and the super seasoned waffle fries from rooftop live rent free in my head. does anyone who worked for hdh know the recipe bc im craving them 😵‍💫"
    },
    {
        "title": "why do the people here have a \"everyone get out my way\" walk",
        "author": "WashPopular3753",
        "created_utc": 1761028125.0,
        "num_comments": 13,
        "score": 45,
        "permalink": "/r/UCSD/comments/1oc5l4r/why_do_the_people_here_have_a_everyone_get_out_my/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "i've had my fair share of people like that but its so abundant at this campus.\n\n i'm disabled and frequently use a cane to get around, and groups of four to six will take up the entire walkway and i try to wait for them to pass, but they all come at me in a sweeping motion and leave me to either nearly fall off the gap between the sidewalk and the terrain, or theyll bump into me. \n\n a few times now people will skid past with their foot swiping my cane out. no spatial awareness, and sometimes it feels purposeful as if they have a early 2000s movie bully complex. ive even had some guy near the walk path towards target 2 weeks ago (black hoodie with red bird on it, i saw you man.) push me to the ground on purpose.\n\nno spatial awareness, even in a slow chatty walk. i have a brain disease that affects my equilibrium, vision, and proprioception by a lot, and even i  can navigate and accustom accordingly. what is their excuse? genuinely? "
    },
    {
        "title": "A UCSD scholarship for Black California students now has to accept white applicants following lawsuit",
        "author": "ripcitybitch",
        "created_utc": 1761027934.0,
        "num_comments": 23,
        "score": 99,
        "permalink": "/r/UCSD/comments/1oc5jbf/a_ucsd_scholarship_for_black_california_students/",
        "image_url": "https://external-preview.redd.it/edIEhRrfqJiUWWV8b9l8g585Irempkwgq8SwQPF4mGg.jpeg?auto=webp&s=21d31877f297e74a083c577a682bb93236a3d1aa",
        "thumbnail_url": "https://external-preview.redd.it/edIEhRrfqJiUWWV8b9l8g585Irempkwgq8SwQPF4mGg.jpeg?width=140&height=93&auto=webp&s=2256363c762117c4ee29ff93ef7d828891b512cf",
        "body": ""
    },
    {
        "title": "Someone's glasses with green frames and purple earpieces are atop the Pronto scanner at Central Campus North trolley stop (heading to UTC), facing Pepper Canyon East",
        "author": "PhoGaPhoever",
        "created_utc": 1761026348.0,
        "num_comments": 0,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oc53nv/someones_glasses_with_green_frames_and_purple/",
        "image_url": "https://i.redd.it/xba3rvdvmewf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/0FSjj44wkp4n3Y7JU-XMWjO10zrPBh_tnYO1X--JtvI.jpg",
        "body": ""
    },
    {
        "title": "hum 1",
        "author": "anniqk",
        "created_utc": 1761025994.0,
        "num_comments": 1,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oc50ai/hum_1/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I was looking over the HUM 1 syllabus for Professor Kristina Markman, and I noticed that during Week 9 she has remote sections but also has a recorded lecture + quiz. Can anyone who has had her first quarter last year or previous years tell me about this? I was planning on heading back home Monday night for an extended thanksgiving break that week…"
    },
    {
        "title": "learn to be quiet",
        "author": "Junior_Fruit4659",
        "created_utc": 1761025913.0,
        "num_comments": 12,
        "score": 45,
        "permalink": "/r/UCSD/comments/1oc4ziy/learn_to_be_quiet/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "who ever is literally yelling outside of the muir apartments.. it is 11pm please learn to stfu. respectfully. "
    },
    {
        "title": "How to get canva premium for free?",
        "author": "FantasticLeek760",
        "created_utc": 1761024981.0,
        "num_comments": 1,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oc4q9d/how_to_get_canva_premium_for_free/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "anybody invite me to the team, DM"
    },
    {
        "title": "geisel west 2 chargers",
        "author": "zckryyy",
        "created_utc": 1761023792.0,
        "num_comments": 6,
        "score": 26,
        "permalink": "/r/UCSD/comments/1oc4dxw/geisel_west_2_chargers/",
        "image_url": "https://i.redd.it/89bv25dvfewf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/3kR4QP2qWXXgiLFRpS02i_LQrDVbP0eWGdMNeuMlKwk.jpg",
        "body": "ts is unreal i cant believe it "
    },
    {
        "title": "Going to LA?",
        "author": "alexkaze312",
        "created_utc": 1761022366.0,
        "num_comments": 3,
        "score": 3,
        "permalink": "/r/UCSD/comments/1oc3ytd/going_to_la/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Hi, is anybody here want to go to LA this Thursday??? Wanna go there for some appointments, but don’t want to drive there alone :’) . We can also explore &amp; eat delicious food there! And go back after avoiding traffic lol.  I can share my student id &amp; answer questions so y’all are comfortable. I hope u do the same as well &amp; let me know !"
    },
    {
        "title": "Yeat concert 2026 march",
        "author": "Flat_You_5763",
        "created_utc": 1761022342.0,
        "num_comments": 3,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oc3yk3/yeat_concert_2026_march/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Talked to the activities leader and he said Yeat is gonna have a concert in march at sun god "
    },
    {
        "title": "Cheapest hotels that arent over 200$",
        "author": "Tobybryant818",
        "created_utc": 1761016311.0,
        "num_comments": 6,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oc22ne/cheapest_hotels_that_arent_over_200/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I want a one night stay that isnt too far from the campus like not over 20 min drive. But all the hotels i see are so expensive even with the 15% discount. I need some help its urgent "
    },
    {
        "title": "PRENSA @UC San Diego",
        "author": "Fine_Potential6833",
        "created_utc": 1761014016.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1oc1acl/prensa_uc_san_diego/",
        "image_url": "",
        "thumbnail_url": "https://a.thumbs.redditmedia.com/ATpgAbjiW5UJGcv9lAc2ixHxqer7DNGeN3cA4XOpUg0.jpg",
        "body": "https://preview.redd.it/f103vcr4ldwf1.jpg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=22f0b696a824de5ed9920906584ce41dcbe09a9a\n\nWant to join a pre-health/pre-nursing organization on campus that is not overpopulated compared to others?? Join PRENSA...PRENSA stands for \"Pre-Nursing Student Association\". We guide and shed light on a community of pre-nursing students here at UCSD. You don't necessarily have to be pre-nursing; we invite anyone with pre-health interests. We host GBMs, socials, volunteer, internships, and more opportunities. Our main goal for this year is giving back to the UCSD and San Diego community by doing more hands-on work. Whether that is making care packages for the homeless, care packages for UCSD students, or taking trips to Tijuana to volunteer at clinics there as well. This may be a great opportunity for you if you're looking for a pre-health organization that is not as populated as others, making it more likely for you to gain experience. Most of our board members have certifications such as CNA, MA, and Med Tech...we guide out members on the path of getting certifications that you can have before expanding your education post bachelors. Get hands-on clinical experience by letting us mentor you on where to get your certification, what places to apply, and more. Through collaboration, mentorship, and advocacy efforts, members will enhance their understanding of the healthcare field, promote a commitment towards compassionate care, and support each other’s journey towards becoming empathetic healthcare professionals with obtained knowledge, insight, and information surrounding the field of nursing.\n\n  \nAt our first GBM you will find out about a volunteer opportunity for this Sunday 10/26 &amp; an upcoming social event! \n\nFIRST GBM TUESDAY 10/21 TOMORROW @ CENTER HALL \n\nROOM NUMBER WILL BE DISCLOSED 45MIN BEFORE GBM STARTS @ 6:30PM ON OUR INSTAGRAM!!\n\nPRENSA INSTAGRAM --&gt; @ PRENSAUCSD\n\n"
    },
    {
        "title": "barbers/stylists on campus",
        "author": "Important-Plate6265",
        "created_utc": 1761013823.0,
        "num_comments": 1,
        "score": 4,
        "permalink": "/r/UCSD/comments/1oc17yf/barbersstylists_on_campus/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Is there anyone on campus that cuts men’s hair at a decent price. Im trying to get a haircut without breaking the bank 🙏 "
    },
    {
        "title": "Participate in NSA CODE breakers",
        "author": "kabyking",
        "created_utc": 1761012551.0,
        "num_comments": 3,
        "score": 0,
        "permalink": "/r/UCSD/comments/1oc0s1y/participate_in_nsa_code_breakers/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "ALLL CS MAJORS TAP THE FUCK IN. Why are we not particpating in the nsa codebreakers, we losing to sdsu bruh. Bruh we rank 45 in D4, might as well start putting the fries in the bag at this point."
    },
    {
        "title": "The faces of UCSD diversity - throwback 2010",
        "author": "peedubb",
        "created_utc": 1761012210.0,
        "num_comments": 19,
        "score": 201,
        "permalink": "/r/UCSD/comments/1oc0ntu/the_faces_of_ucsd_diversity_throwback_2010/",
        "image_url": "https://i.redd.it/1d912wefhdwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/vJHW6MexwGy1A1uEG2vlCVNFs2bX0GfEvDgiS7j0w2w.jpg",
        "body": "The one dude’s post about his treatment as a black student reminded me of this. \n\nStory time: Back in Feb 2010 the infamous Compton cookout happened. Around that same time, one of the assistant athletic directors asked me to go do a photoshoot to increase visibility for UCSD Athletics. Being the vain mofo I am, I was down. \n\nFor some reason I decided to show up in these terrible ass 2000s extra long jean shorts. Don’t judge me. Baggy was in back then. Maybe it wasn’t. Idk. 😂😂😂\n\nAnyways I don’t know if it before or after the cookout, but around that time this young lady and ai became the faces of diversity at UCSD. \n\nThis picture showed up in every other article about UCSD for probably 2 years. \n\nAlso shoutout to the dude on the bike. I think he was on the tennis team or fencing team. "
    },
    {
        "title": "yogurt world 10% off 10/21",
        "author": "idoartandstuff",
        "created_utc": 1761011897.0,
        "num_comments": 0,
        "score": 8,
        "permalink": "/r/UCSD/comments/1oc0jpu/yogurt_world_10_off_1021/",
        "image_url": "https://i.redd.it/pt4df12igdwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/SfGeITtuUfI0QFSHVJ17YA9eMfr7ECcxYF8pc496srg.jpg",
        "body": "discount on yogurt world tmr if you show the flyer!!!"
    },
    {
        "title": "On campus housing guarantee",
        "author": "Joooonnnnnn",
        "created_utc": 1761008559.0,
        "num_comments": 5,
        "score": 0,
        "permalink": "/r/UCSD/comments/1obzcwd/on_campus_housing_guarantee/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I lived on campus my first year, however I lived off campus my 2nd year and this current academic school year. I was planning on living on campus next year and believed that I would still have guaranteed housing however when I email the student housing department I was told that my 2 year guaranteed housing is only available for consecutive years and that I would have to apply through the waitlist. When I looked up the ucsd requirements to be eligible for 2 years of guaranteed housing the requirements are that you have to live on campus your admitted year which I did. Does anyone know if I’m still eligible to receive guaranteed housing? "
    },
    {
        "title": "Data center outage in Northern Virginia shuts down half the internet (and Canvas)",
        "author": "Choobeen",
        "created_utc": 1761005770.0,
        "num_comments": 0,
        "score": 9,
        "permalink": "/r/UCSD/comments/1obyck7/data_center_outage_in_northern_virginia_shuts/",
        "image_url": "https://external-preview.redd.it/fLLkLGg0YDzqmZUe6DKo-EtijfYB4hXFp0RKz48DBpE.png?auto=webp&s=d5e832b9524a057277c8854639e4eaa58c8c7902",
        "thumbnail_url": "https://external-preview.redd.it/fLLkLGg0YDzqmZUe6DKo-EtijfYB4hXFp0RKz48DBpE.png?width=140&height=83&auto=webp&s=cc205ab62e102d29eff8af54b53a3cccd848e6ce",
        "body": "October 20, 2025"
    },
    {
        "title": "tecca tix dm",
        "author": "Xflasher1104",
        "created_utc": 1761005540.0,
        "num_comments": 0,
        "score": 2,
        "permalink": "/r/UCSD/comments/1oby9hz/tecca_tix_dm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "4 tickets for SOMA tn \nDm if interested"
    },
    {
        "title": "how to get rid of shape thingy",
        "author": "FartRag",
        "created_utc": 1761004251.0,
        "num_comments": 1,
        "score": 7,
        "permalink": "/r/UCSD/comments/1obxs51/how_to_get_rid_of_shape_thingy/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "It’s clogging up my canvas homepage and getting on my nerves \n"
    },
    {
        "title": "Lost Laptop Charger",
        "author": "Uncreative_Nickname9",
        "created_utc": 1761003980.0,
        "num_comments": 0,
        "score": 5,
        "permalink": "/r/UCSD/comments/1obxoml/lost_laptop_charger/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Someone please let me know if they saw a laptop charger at Canyon Vista before noon of today. I must have lost it there. Thank you. "
    },
    {
        "title": "Bladee concert",
        "author": "yeezusmarychain",
        "created_utc": 1761002724.0,
        "num_comments": 2,
        "score": 4,
        "permalink": "/r/UCSD/comments/1obx8ca/bladee_concert/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Anyone else going to the bladee concert on friday? Tap in lmk i want someone to go with"
    },
    {
        "title": "Everybody lock in (Canvas)",
        "author": "underwaterdoors",
        "created_utc": 1761002510.0,
        "num_comments": 5,
        "score": 85,
        "permalink": "/r/UCSD/comments/1obx5e9/everybody_lock_in_canvas/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Canvas is back up now we have no excuse to not study :("
    },
    {
        "title": "Canvas",
        "author": "Complex-Employment66",
        "created_utc": 1761001506.0,
        "num_comments": 2,
        "score": 13,
        "permalink": "/r/UCSD/comments/1obwrjl/canvas/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Canvas is available rn!"
    },
    {
        "title": "NEED ANSWER ASAP (Parking)",
        "author": "tpwk2040",
        "created_utc": 1761000469.0,
        "num_comments": 4,
        "score": 0,
        "permalink": "/r/UCSD/comments/1obwcpl/need_answer_asap_parking/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone know of any weekday overnight parking spots just for one night?? Can be on campus or off camps "
    },
    {
        "title": "6A ortony",
        "author": "Flat_You_5763",
        "created_utc": 1761000466.0,
        "num_comments": 0,
        "score": 4,
        "permalink": "/r/UCSD/comments/1obwcnf/6a_ortony/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "what is the biggest advice for midterm 1? Is it hard, easy and does it correlate with hw or discussion problems?"
    },
    {
        "title": "🔬 Earn $100! Healthy Volunteers Needed for Esophageal Study! 👥🔬",
        "author": "ucsdmotilitylab",
        "created_utc": 1760999208.0,
        "num_comments": 1,
        "score": 3,
        "permalink": "/r/UCSD/comments/1obvun1/earn_100_healthy_volunteers_needed_for_esophageal/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "We're thrilled to invite you to take part in our 1-hour Esophageal Study at the UC San Diego Medical Center. As a healthy adult volunteer, you'll receive $100 as compensation for your time and travel.\n\nIn addition to the monetary reward, you'll gain invaluable firsthand exposure to patient care in a specialized clinical setup. This is a unique chance to explore the world of medical research while contributing to cutting-edge knowledge. We can provide you with the transcript of your results if requested.\n\nTo be eligible, you should be:\n\n• Between 21-70 years old\n\n• Healthy\n\n• Not have any disease/surgery of the esophagus and stomach\n\n• Not have any symptoms (heartburn, chest pain, etc.) related to the esophagus, eating, or swallowing disorders\n\nIf you're interested in joining this important study and making a difference, please send us an email at [ucsdgimotility@gmail.com](mailto:ucsdgimotility@gmail.com) or leave a voicemail at (858) 534-5897 for more information about participation.\n\nDon't miss out on this exciting opportunity. Share this with friends and family who might be interested in participating. We look forward to having you on board!\n\n  \n"
    },
    {
        "title": "Need j*b ☹️",
        "author": "Resident_Success3200",
        "created_utc": 1760997596.0,
        "num_comments": 11,
        "score": 11,
        "permalink": "/r/UCSD/comments/1obv6xo/need_jb/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "you guys i’m actually so desperate for an off campus job plzzz help me. I’m a molecular and cell biology major but i’ll do anything. "
    },
    {
        "title": "Carrots anyone?",
        "author": "xxTonyTonyxx",
        "created_utc": 1760997277.0,
        "num_comments": 0,
        "score": 6,
        "permalink": "/r/UCSD/comments/1obv2bx/carrots_anyone/",
        "image_url": "https://i.redd.it/ddhu57z09cwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/5fUmHGeE7G308QKzXYj_RR8i6USymE5Eh6qzPDOTFAc.jpg",
        "body": "🥕🥕"
    },
    {
        "title": "What is a good % to go to RIMAC?",
        "author": "EatMyFoxBussy",
        "created_utc": 1760997000.0,
        "num_comments": 2,
        "score": 1,
        "permalink": "/r/UCSD/comments/1obuyae/what_is_a_good_to_go_to_rimac/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I haven't gone to the gym in weeks because every time I go to check how busy RIMAC is it is always around 63%. I don't just go and check since I live in 8th and don't want to go all the way down just to see that it's too busy for me. I just want to use free weights, so should I just chance it when it says its busy or wait until it says it's less than 50%?"
    },
    {
        "title": "dressing as yeat for halloween",
        "author": "Flat_You_5763",
        "created_utc": 1760996478.0,
        "num_comments": 0,
        "score": 0,
        "permalink": "/r/UCSD/comments/1obuqcf/dressing_as_yeat_for_halloween/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "valid or corny?"
    },
    {
        "title": "Mexican stuff",
        "author": "Bloup_em",
        "created_utc": 1760996103.0,
        "num_comments": 37,
        "score": 54,
        "permalink": "/r/UCSD/comments/1obukhn/mexican_stuff/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "What's up? I'm from east L.A. and I'm looking for panaderias or any tiendas nearby cause I'm genuinely going crazy with this dining hall food. Anyone have any recommendations that isn't the taco stand?"
    },
    {
        "title": "Anything interesting at the vendor fair today? l’m almost there.",
        "author": "xxTonyTonyxx",
        "created_utc": 1760995143.0,
        "num_comments": 2,
        "score": 3,
        "permalink": "/r/UCSD/comments/1obu5mx/anything_interesting_at_the_vendor_fair_today_lm/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "🤔"
    },
    {
        "title": "Middle Class Scholarship (MCS) Award Date",
        "author": "war1ock970",
        "created_utc": 1760994562.0,
        "num_comments": 2,
        "score": 16,
        "permalink": "/r/UCSD/comments/1obtwn3/middle_class_scholarship_mcs_award_date/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone know when this is awarded? Online it says mid october but I remember last year it was delayed.\n\nThanks"
    },
    {
        "title": "free food @64",
        "author": "kweiu",
        "created_utc": 1760993952.0,
        "num_comments": 1,
        "score": 2,
        "permalink": "/r/UCSD/comments/1obtn2g/free_food_64/",
        "image_url": "https://i.redd.it/k7yndv05zbwf1.jpeg",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/MQ6sdeqUhofAPgoOuVTXb_mrHb6wh5D2zYZW0Gdp4Bg.jpg",
        "body": ""
    },
    {
        "title": "2 unit or easy classes?",
        "author": "FartRag",
        "created_utc": 1760992517.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1obszpr/2_unit_or_easy_classes/",
        "image_url": "",
        "thumbnail_url": "",
        "body": ""
    },
    {
        "title": "psyc 184 Midterm study guide",
        "author": "bamboozled13311",
        "created_utc": 1760992201.0,
        "num_comments": 0,
        "score": 1,
        "permalink": "/r/UCSD/comments/1obsumo/psyc_184_midterm_study_guide/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone have the study guide for the midterm today? Canvas being down sucks"
    },
    {
        "title": "CANVAS DOWN: Group goon sesh to Lebron. Link attached below.",
        "author": "Dj-Carplid",
        "created_utc": 1760991926.0,
        "num_comments": 0,
        "score": 28,
        "permalink": "/r/UCSD/comments/1obsq80/canvas_down_group_goon_sesh_to_lebron_link/",
        "image_url": "",
        "thumbnail_url": "https://b.thumbs.redditmedia.com/nehO7FH8D4498y-fKxusxInt236ERW0gH9QgES2IyFs.jpg",
        "body": "We gonna give him head so good he's gonna see All of the Lights.\n\nhttps://whenisgood.net/xtecfqq\n\n"
    },
    {
        "title": "Mfw canvas shits itself a day before miterms",
        "author": "patybruh_moment",
        "created_utc": 1760991591.0,
        "num_comments": 0,
        "score": 16,
        "permalink": "/r/UCSD/comments/1obskq4/mfw_canvas_shits_itself_a_day_before_miterms/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "of all days"
    },
    {
        "title": "Is anyone down to be friends? (SERIOUS)(psychology major UCSD)",
        "author": "Powerful_Love_2086",
        "created_utc": 1760991454.0,
        "num_comments": 13,
        "score": 18,
        "permalink": "/r/UCSD/comments/1obsiin/is_anyone_down_to_be_friends_seriouspsychology/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "READ FULLY PLEASE: \n\nHey everyone! I’m a psychology major at UCSD, and this is my last year here. I’ve been a bit shy and haven’t really put myself out there as much as I should have. I’m not looking to be best friends with anyone, but I’d love to make some cool friends before I graduate. I’d love to hang out with people I can actually be friends with outside of UCSD. I’m a female, so I’d love female friends! Males are okay too, as long as you’re really cool and not weird. I’m a transfer student, which is part of the reason why it’s been so hard for me to put myself out there. I don’t really commute often, but I’ve been feeling a little lonely. I’m a big fan of trying new things and exploring new places. I’m thinking of going on some hikes around here, and I’ve always been interested in trying “extreme” activities that would probably make most people SH**T themselves. Basically, I don’t want to be friends with anyone who’s too scared to live their life. I get scared too, but I want to meet friends who will challenge us to step outside our comfort zones. Of course, there will be boundaries at first, but I really want to meet friends who are as adventurous as I am (YOLO). Another thing I’ve been wanting to do is go to HHN. I’ve been there before, but it wasn’t as much fun because no one made me feel comfortable enough to be there with them. I really want to have a friend who we can laugh together all night long. I’m a bit weird, but in a really good way… I’m not looking specifically for a psychology major friend, but it would be preferred just because I struggle sometimes in school, and having a friend in that major would make me feel more sane. \n\nSomething I’d like to mention though is… I’m the type of person who sometimes needs a little space, so there might be times when I don’t respond right away or even go a couple days without texting. Please don’t take it personally! It has nothing to do with me not liking you or not wanting to be friends, I just get really focused or overwhelmed with school/life and accidentally go quiet. That being said, I’m still serious about making real friendships. We don’t have to talk every single day to be close, but if we do end up clicking and talking all the time, I’m totally down for that too. I just wanted to put it out there so no one feels ignored or unappreciated. I value quality over constant texting, and I love friendships where we can pick up right where we left off, and still go on fun/adventurous plans together."
    },
    {
        "title": "exam postponed",
        "author": "Different_Manner_591",
        "created_utc": 1760991237.0,
        "num_comments": 6,
        "score": 16,
        "permalink": "/r/UCSD/comments/1obsex6/exam_postponed/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "I got my math 10b exam postponed till Wednesday since the teacher couldn't come in , this is the wildest thing he made us sit the lecture hall with id's and everything ready more than 50 students the exam should have started ten minutes ago and the ta's are like well he moved it to wednesday so he made us stress all morning and we made it on time and he is literally giving us a quiz as well on Wednesday during the disscussion section"
    },
    {
        "title": "Study Guide for Psyc 184",
        "author": "Exciting-Treacle-642",
        "created_utc": 1760991087.0,
        "num_comments": 3,
        "score": 0,
        "permalink": "/r/UCSD/comments/1obscjh/study_guide_for_psyc_184/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "Does anyone have the study guide downloaded for today’s exam?"
    },
    {
        "title": "Structural Engineering / Engineering Clubs: Advice Needed",
        "author": "AccomplishedArt2773",
        "created_utc": 1760990433.0,
        "num_comments": 6,
        "score": 4,
        "permalink": "/r/UCSD/comments/1obs1oy/structural_engineering_engineering_clubs_advice/",
        "image_url": "",
        "thumbnail_url": "",
        "body": "First yr and faced w rejections from the bigger eng clubs on campus, I was looking for advice on what I should do. I dont have any specific engineering focused experiences so I'm trying to go to the human-powered-submarine meetings (but surprisingly there r barely any people there? not to shit on the club but it seems like members just settled for it bc they also got rejected from everything like me), and im debating trying out for some SE clubs but I just don't know what to do; club apps lowk are closed and I did my best, and I want to make the most out of club experiences.\n\n Ik there is always next year but if I get rejected solely based on my resume and answers to questions, I would most likely need more/better experiences to talk about?\n\n  \nAny opinions, advice? I want to actually learn stuff that could then help me land a job/internship later on."
    }
]